const pagesData = {
    144: [
        {
            type: 'heading',
            lines: [
                [
                    { ar: 'سُنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: 'السُّنَّةُ:', id: 'سُنَّه اَدَالَهْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'هِيَ', id: 'إِيَا' },
                    { ar: 'مَا', id: 'أَفَا٢ يَڠْ' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْإِنْسَانِ', id: 'مَانُوسِيَا' },
                    { ar: 'فِعْلُهُ', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'غَيْرِ', id: 'بُوكَنْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْحَتْمِ،', id: 'وَاجِبْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يُثَابُ', id: 'دِيبَرِي فَاهَالَا' }
                ],
                [
                    { ar: 'الْمُسْلِمُ', id: 'سَأَوْرَڠْ مُسْلِمْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'فِعْلِهِ', id: 'مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يُعَاقَبُ', id: 'دِيهُوكُومْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهِ.', id: 'مَنِيڠْڮَلْكَنّيَا.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَرْكَانٌ', id: 'رُوكُون٢' },
                    { ar: 'وَشُرُوطٌ', id: 'دَانْ شَرَط٢' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'بُدَّ', id: 'بُولَيْه تِيدَاكْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'فِعْلِهَا', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْإِلْزَامِ', id: 'كَوَاجِبَنْ' }
                ],
                [
                    { ar: 'أَوْ', id: 'أَتَوْ' },
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'كَيْ', id: 'أَڮَرْ' },
                    { ar: 'تَصِحَّ', id: 'سَهْ' },
                    { ar: 'الصَّلَاةُ؛', id: 'صَلَاةْ؛' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'ذَكَرْنَاهَا', id: 'كَامِي تَلَاهْ مَثَبُوتْكَنّيَا' },
                    { ar: 'فِيمَا', id: 'فَدَا أَفَا يَڠْ' },
                    { ar: 'سَبَقَ.', id: 'تَلَاهْ لَالُو.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'سُنَنٌ', id: 'سُنَّه٢' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَڠْ يَڠْ صَلَاةْ' },
                    { ar: 'فِعْلُهَا،', id: 'مڠرجاكنيَا،' },
                    { ar: 'وَلَكِنْ', id: 'دَانْ تَتَافِي' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' }
                ],
                [
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يَزْدَادُ', id: 'بَرْتَامْبَاهْ' },
                    { ar: 'ثَوَابُ', id: 'فَاهَالَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'بِفِعْلِهَا', id: 'دڠَنْ مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'عِقَابَ', id: 'هُوكُومَنْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهَا.', id: 'مَنِيڠْڮَلْكَنّيَا.' },
                    { ar: 'وَهَذِهِ', id: 'دَانْ اِينِي' }
                ],
                [
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'كَثِيرَةٌ،', id: 'بَاڽَاكْ،' },
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'تَنْقَسِمُ', id: 'تَرْبَاڮِي' },
                    { ar: 'فِي', id: 'دَالَمْ' },
                    { ar: 'مَجْمُوعِهَا', id: 'كُومْفُولَنّيَا' },
                    { ar: 'إِلَى :', id: 'كَفَدَا :' },
                    { ar: 'سُنَنٍ', id: 'سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ،' }
                ],
                [
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'أَثْنَائِهَا،', id: 'تڠَهْ-تڠَهْيَا،' },
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'عَقِبَهَا.', id: 'سَتَلَاهْيَا.' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '( أ )', id: '(A)' },
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ:', id: 'صَلَاةْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'تَزِيدُ', id: 'لَبِيهْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'الْأُمُورِ', id: 'فَرْكَارَا٢' },
                    { ar: 'الثَّلَاثَةِ', id: 'يَڠْ تِيقَا' },
                    { ar: 'التَّالِيَةِ:', id: 'بَرِيكُوتْ اِينِي:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الْأَوَّلُ', id: 'فَرْتَامَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْأَذَانُ :', id: 'أَذَانْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'تَعْرِيفُهُ', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'دَلِيلِهِ', id: 'دَلِيلْيَا' },
                    { ar: 'وَشُرُوطِهِ', id: 'دَانْ شَرَط٢يَا' },
                    { ar: 'وَمَا', id: 'دَانْ أَفَا يَڠْ' },
                    { ar: 'يَتَعَلَّقُ', id: 'بَرْكَائِيْتَنْ' },
                    { ar: 'بِذَلِكَ .', id: 'دڠَنْ حَالْ اِيتُو.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الثَّانِي', id: 'كَدُوَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْإِقَامَةُ :', id: 'إِقَامَةْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'تَعْرِيفُهَا', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'شُرُوطِهَا', id: 'شَرَط٢يَا' },
                    { ar: 'وَالْفَرْقُ', id: 'دَانْ فَرْبَيدَاءَنْ' },
                    { ar: 'بَيْنَهَا', id: 'دِي أَنْتَارَايَا' },
                    { ar: 'وَبَيْنَ', id: 'دَانْ دِي أَنْتَارَا' },
                    { ar: 'الْأَذَانِ.', id: 'أَذَانْ.' }
                ]
            ]
        }
    ]
,
    145: [
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "الثَّالِثُ",
                        "id": "يَڠْ كَتِيكَا"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "اِتِّخَاذُ",
                        "id": "مڠمبيل"
                    },
                    {
                        "ar": "سُتْرَةٍ",
                        "id": "فمباتس"
                    },
                    {
                        "ar": "أَمَامَهُ",
                        "id": "دِي دَفانيَا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "تَحُولُ",
                        "id": "مڠحالاڠي"
                    },
                    {
                        "ar": "بَيْنَهُ",
                        "id": "أنتارايا"
                    },
                    {
                        "ar": "وَبَيْنَ",
                        "id": "دان أنتارا"
                    },
                    {
                        "ar": "الْمَارِّينَ",
                        "id": "أورڠ٢ يڠ ليوات"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "كَجِدَارٍ",
                        "id": "سفرتي تيمبوق"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَعَمُودٍ",
                        "id": "دان تياڠ"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَعَصَا",
                        "id": "دان توڠكت"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "أَوْ",
                        "id": "أتاو"
                    },
                    {
                        "ar": "كَأَنْ",
                        "id": "سفرتي"
                    },
                    {
                        "ar": "يَبْسُطَ",
                        "id": "ديَا ممبنتڠكن"
                    },
                    {
                        "ar": "أَمَامَهُ",
                        "id": "دي دفانيا"
                    },
                    {
                        "ar": "مُصَلَّى",
                        "id": "تمفت صلاة"
                    },
                    {
                        "ar": "كَسَجَّادَةٍ",
                        "id": "سفرتي سجادۃ"
                    },
                    {
                        "ar": "وَنَحْوِهَا",
                        "id": "دان سميسليا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "فَإِنْ",
                        "id": "مك جك"
                    },
                    {
                        "ar": "لَمْ يَجِدْ",
                        "id": "ديَا تيدق منموكن"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "رَوَى",
                        "id": "تله مريوايتكن"
                    },
                    {
                        "ar": "الْبُخَارِيُّ",
                        "id": "امام بخاري"
                    },
                    {
                        "ar": "(٥٠٤)",
                        "id": "(٥٠٤)"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "وَمُسْلِمٌ",
                        "id": "دان امام مسلم"
                    },
                    {
                        "ar": "(٥٠١)",
                        "id": "(٥٠١)"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "ابْنِ عُمَرَ",
                        "id": "ابن عمر"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ",
                        "id": "رضي الله"
                    }
                ],
                [
                    {
                        "ar": "عَنْهُمَا",
                        "id": "عنهما"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَنَّ",
                        "id": "سسوڠڮوهيا"
                    },
                    {
                        "ar": "رَسُولَ اللَّهِ",
                        "id": "رسول الله"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "كَانَ",
                        "id": "اداله"
                    },
                    {
                        "ar": "إِذَا",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "خَرَجَ",
                        "id": "ديَا كلوار"
                    },
                    {
                        "ar": "يَوْمَ",
                        "id": "فد هاري"
                    },
                    {
                        "ar": "الْعِيدِ",
                        "id": "عيد"
                    },
                    {
                        "ar": "أَمَرَ",
                        "id": "ديَا ممرينتهكن"
                    },
                    {
                        "ar": "بِالْحَرْبَةِ",
                        "id": "دڠن تومبق"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "فَتُوضَعَ",
                        "id": "مك ديلتقكن"
                    }
                ],
                [
                    {
                        "ar": "بَيْنَ",
                        "id": "أنتارا"
                    },
                    {
                        "ar": "يَدَيْهِ",
                        "id": "كدوا تاڠنيا (ددفنيا)"
                    },
                    {
                        "ar": "فَيُصَلِّي",
                        "id": "مك ديَا صلاة"
                    },
                    {
                        "ar": "إِلَيْهَا",
                        "id": "كفدايا"
                    },
                    {
                        "ar": "وَالنَّاسُ",
                        "id": "دان مَانُوسِيَا"
                    },
                    {
                        "ar": "وَرَاءَهُ",
                        "id": "دِبلاكڠيا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَكَانَ",
                        "id": "دان اداله ديَا"
                    },
                    {
                        "ar": "يَفْعَلُ",
                        "id": "ملاكوكن"
                    },
                    {
                        "ar": "ذَلِكَ",
                        "id": "ايتو"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "السَّفَرِ",
                        "id": "سفر"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "[",
                        "id": "["
                    },
                    {
                        "ar": "الْحَرْبَةُ",
                        "id": "تومبق"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "رُمْحٌ",
                        "id": "تومبق"
                    },
                    {
                        "ar": "قَصِيرٌ",
                        "id": "يڠ فينديق"
                    },
                    {
                        "ar": "عَرِيضُ",
                        "id": "يڠ ليبار"
                    },
                    {
                        "ar": "النَّصْلِ",
                        "id": "ماتايا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "بَيْنَ يَدَيْهِ",
                        "id": "ددفنيا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "قُدَّامَهُ",
                        "id": "ددفنيا"
                    },
                    {
                        "ar": "]",
                        "id": "]"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَالْأَفْضَلُ",
                        "id": "دان يڠ أوتاما"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "تَكُونَ",
                        "id": "اداله"
                    },
                    {
                        "ar": "السُّتْرَةُ",
                        "id": "فمباتس"
                    },
                    {
                        "ar": "قَرِيبَةً",
                        "id": "دكت"
                    },
                    {
                        "ar": "مِنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "مَوْضِعِ",
                        "id": "تمفت"
                    },
                    {
                        "ar": "سُجُودِهِ",
                        "id": "سجوديا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "فَقَدْ",
                        "id": "مك سسوڠڮوهيا"
                    },
                    {
                        "ar": "رَوَى",
                        "id": "تله مريوايتكن"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "رَوَى",
                        "id": "تله مريوايتكن"
                    },
                    {
                        "ar": "الْبُخَارِيُّ",
                        "id": "امام بخاري"
                    },
                    {
                        "ar": "(٤٧٩)",
                        "id": "(٤٧٩)"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "وَمُسْلِمٌ",
                        "id": "دان امام مسلم"
                    },
                    {
                        "ar": "(٥٠٨)",
                        "id": "(٥٠٨)"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "سَهْلِ بْنِ سَعْدٍ",
                        "id": "سهل بن سعد"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    }
                ],
                [
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "كَانَ",
                        "id": "اداله"
                    },
                    {
                        "ar": "بَيْنَ",
                        "id": "أنتارا"
                    },
                    {
                        "ar": "مُصَلَّى",
                        "id": "تمفت صلاة"
                    },
                    {
                        "ar": "رَسُولِ اللَّهِ",
                        "id": "رسول الله"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "وَبَيْنَ",
                        "id": "دان أنتارا"
                    },
                    {
                        "ar": "الْجِدَارِ",
                        "id": "تيمبوق"
                    },
                    {
                        "ar": "مَمَرُّ",
                        "id": "تمفت ليوات"
                    }
                ],
                [
                    {
                        "ar": "الشَّاةِ",
                        "id": "كمبيڠ"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "[",
                        "id": "["
                    },
                    {
                        "ar": "مُصَلَّى",
                        "id": "تمفت صلاة"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "مَوْضِعُ",
                        "id": "تمفت"
                    },
                    {
                        "ar": "السُّجُودِ",
                        "id": "سجود"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "مَمَرُّ الشَّاةِ",
                        "id": "تمفت ليوات كمبيڠ"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "سَعَةُ",
                        "id": "كلواسن"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "تَمُرُّ",
                        "id": "ليوات"
                    },
                    {
                        "ar": "مِنْهُ",
                        "id": "دارييا"
                    },
                    {
                        "ar": "الشَّاةُ",
                        "id": "كمبيڠ"
                    },
                    {
                        "ar": "]",
                        "id": "]"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "ب)",
                        "id": "ب)"
                    },
                    {
                        "ar": "السُّنَنُ",
                        "id": "سُنَّه٢"
                    },
                    {
                        "ar": "الَّتِي",
                        "id": "يڠ"
                    },
                    {
                        "ar": "تُؤَدَّى",
                        "id": "ديلقسناكن"
                    },
                    {
                        "ar": "أَثْنَاءَ",
                        "id": "دالم كتيكا"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "فَالْأَبْعَاضُ",
                        "id": "مك أبعاض"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": "كُلُّ",
                        "id": "ستياف"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "يُجْبَرُ",
                        "id": "دتمبل"
                    },
                    {
                        "ar": "تَرْكُهُ",
                        "id": "منيڠڮلكنيا"
                    },
                    {
                        "ar": "بِسُجُودِ",
                        "id": "دڠن سجود"
                    },
                    {
                        "ar": "السَّهْوِ",
                        "id": "سهوي"
                    },
                    {
                        "ar": "فِي",
                        "id": "دي"
                    },
                    {
                        "ar": "آخِرِ",
                        "id": "أخير"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "وَالْهَيْئَاتُ",
                        "id": "دان هيئات"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": "كُلُّ",
                        "id": "ستياف"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "لَا يُجْبَرُ",
                        "id": "تيدق دتمبل"
                    },
                    {
                        "ar": "تَرْكُهُ",
                        "id": "منيڠڮلكنيا"
                    },
                    {
                        "ar": "بِسُجُودِ",
                        "id": "دڠن سجود"
                    },
                    {
                        "ar": "السَّهْوِ",
                        "id": "سهوي"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "وَسَنَشْرَحُ",
                        "id": "دان كامي أكن منجلسكن"
                    },
                    {
                        "ar": "سُجُودَ",
                        "id": "سجود"
                    },
                    {
                        "ar": "السَّهْوِ",
                        "id": "سهوي"
                    }
                ],
                [
                    {
                        "ar": "وَمَا",
                        "id": "دان أفا٢ يڠ"
                    },
                    {
                        "ar": "يَتَعَلَّقُ",
                        "id": "بركاءيتن"
                    },
                    {
                        "ar": "بِهِ",
                        "id": "دڠنيا"
                    },
                    {
                        "ar": "مِنْ",
                        "id": "دَارِي"
                    }
                ],
                [
                    {
                        "ar": "أَبْحَاثٍ",
                        "id": "فمبهسن٢"
                    },
                    {
                        "ar": "آخِرَ",
                        "id": "دي أخير"
                    },
                    {
                        "ar": "الْكَلَامِ",
                        "id": "فمبيچاراءن"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    }
                ],
                [
                    {
                        "ar": "أَعْمَالِ",
                        "id": "عمل٢"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَنَبْدَأُ",
                        "id": "دان كامي ممولائي"
                    },
                    {
                        "ar": "بِتَعْدَادِ",
                        "id": "دڠن مڠهيتوڠ"
                    },
                    {
                        "ar": "أَبْعَاضِ",
                        "id": "أبعاض"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "أَوَّلًا",
                        "id": "فرتام"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "ثُمَّ",
                        "id": "كمودين"
                    },
                    {
                        "ar": "هَيْئَاتِهَا",
                        "id": "هيئاتيا"
                    },
                    {
                        "ar": "ثَانِيًا",
                        "id": "كدوا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "الْأَبْعَاضُ",
                        "id": "أبعاض"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "١ -",
                        "id": "١ -"
                    },
                    {
                        "ar": "التَّشَهُدُ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "الْأَوَّلُ",
                        "id": "أَوَّل"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَيُقْصَدُ",
                        "id": "دان ديمقصودكن"
                    },
                    {
                        "ar": "بِهِ",
                        "id": "دڠنيا"
                    },
                    {
                        "ar": "التَّشَهُدُ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْجُلُوسِ",
                        "id": "دُودُوق"
                    },
                    {
                        "ar": "الَّذِي",
                        "id": "يڠ"
                    },
                    {
                        "ar": "لَا يَعْقُبُهُ",
                        "id": "تيدق مڠيكوتيا"
                    },
                    {
                        "ar": "سَلَامٌ",
                        "id": "سلام"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَهُوَ",
                        "id": "دان ديَا"
                    },
                    {
                        "ar": "الْجُلُوسُ",
                        "id": "دودوق"
                    }
                ]
            ]
        }
    ],
    146: [
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "الَّذِي",
                        "id": "يڠ"
                    },
                    {
                        "ar": "يَكُونُ",
                        "id": "اداله"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "رَأْسِ",
                        "id": "فڠهوجوڠ"
                    },
                    {
                        "ar": "رَكْعَتَيْنِ",
                        "id": "دوا ركعة"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "صَلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "الظُّهْرِ",
                        "id": "ظهر"
                    },
                    {
                        "ar": "وَالْعَصْرِ",
                        "id": "دان عصر"
                    },
                    {
                        "ar": "وَالْمَغْرِبِ",
                        "id": "دان مغرب"
                    },
                    {
                        "ar": "وَالْعِشَاءِ",
                        "id": "دان عشاء"
                    }
                ],
                [
                    {
                        "ar": "فَيُسَنُّ",
                        "id": "مك دسنَّهكن"
                    },
                    {
                        "ar": "التَّشَهُدُ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "فِيهِ",
                        "id": "دالميا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "جَاءَ",
                        "id": "تله داتڠ"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "حَدِيثِ",
                        "id": "حديث"
                    },
                    {
                        "ar": "الْمُسِيءِ",
                        "id": "يڠ بوروق"
                    },
                    {
                        "ar": "صَلَاتُهُ",
                        "id": "صلاةيا"
                    },
                    {
                        "ar": "عِنْدَ",
                        "id": "منوروت"
                    },
                    {
                        "ar": "أَبِي دَاوُدَ",
                        "id": "أبي داود"
                    },
                    {
                        "ar": "(٨٦٠)",
                        "id": "(٨٦٠)"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ],
                [
                    {
                        "ar": "«",
                        "id": "«"
                    },
                    {
                        "ar": "فَإِذَا",
                        "id": "مك كتيكا"
                    },
                    {
                        "ar": "جَلَسْتَ",
                        "id": "كأو دودوق"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "وَسَطِ",
                        "id": "تڠه"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "فَاطْمَئِنَّ",
                        "id": "مك طمأنينهله"
                    },
                    {
                        "ar": "وَافْتَرِشْ",
                        "id": "دان دودوق افتراشله"
                    },
                    {
                        "ar": "فَخِذَكَ",
                        "id": "فها مو"
                    },
                    {
                        "ar": "الْيُسْرَى",
                        "id": "يڠ كيري"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "ثُمَّ",
                        "id": "كمودين"
                    },
                    {
                        "ar": "تَشَهَّدْ",
                        "id": "تَشَهُدله"
                    },
                    {
                        "ar": "»",
                        "id": "»"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَالدَّلِيلُ",
                        "id": "دان داليل"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "أَنَّهُ",
                        "id": "بهاواييا"
                    },
                    {
                        "ar": "سُنَّةٌ",
                        "id": "سُنَّه"
                    },
                    {
                        "ar": "وَلَيْسَ",
                        "id": "دان بوكن"
                    },
                    {
                        "ar": "بِفَرْضٍ",
                        "id": "دڠن فرض"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "رَوَاهُ",
                        "id": "تله مريوايتكنيا"
                    },
                    {
                        "ar": "الْبُخَارِيُّ",
                        "id": "امام بخاري"
                    }
                ],
                [
                    {
                        "ar": "(٨٢٩)",
                        "id": "(٨٢٩)"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "وَمُسْلِمٌ",
                        "id": "دان امام مسلم"
                    },
                    {
                        "ar": "(٥٧٠)",
                        "id": "(٥٧٠)"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ],
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "أَنَّ",
                        "id": "سسوڠڮوهيا"
                    },
                    {
                        "ar": "رَسُولَ اللَّهِ",
                        "id": "رسول الله"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "قَامَ",
                        "id": "ديَا برديري"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "صَلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "الظُّهْرِ",
                        "id": "ظهر"
                    },
                    {
                        "ar": "وَعَلَيْهِ",
                        "id": "دان واجب أَتَسْيَا"
                    },
                    {
                        "ar": "جُلُوسٌ",
                        "id": "دودوق"
                    }
                ],
                [
                    {
                        "ar": "الَّذِي",
                        "id": "يڠ"
                    },
                    {
                        "ar": "تَرَكَهُ",
                        "id": "تله منيڠڮلكنيا ديَا"
                    },
                    {
                        "ar": "بِتَرْكِ",
                        "id": "دڠن منيڠڮلكن"
                    },
                    {
                        "ar": "الْجُلُوسِ",
                        "id": "دودوق"
                    },
                    {
                        "ar": "لَهُ",
                        "id": "بڮييا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "فَلَوْ",
                        "id": "مك لو"
                    },
                    {
                        "ar": "كَانَ",
                        "id": "اداله ديَا"
                    },
                    {
                        "ar": "رُكْنًا",
                        "id": "ركون"
                    },
                    {
                        "ar": "لَاضْطُرَّ",
                        "id": "نچايَا دترفقسا"
                    },
                    {
                        "ar": "إِلَى",
                        "id": "كفد"
                    },
                    {
                        "ar": "الْإِتْيَانِ",
                        "id": "منداتڠكن"
                    },
                    {
                        "ar": "بِهِ",
                        "id": "دڠنيا"
                    }
                ],
                [
                    {
                        "ar": "وَلَمْ",
                        "id": "دان تيدق"
                    },
                    {
                        "ar": "يُنْجَبَرْ",
                        "id": "دتمبل"
                    },
                    {
                        "ar": "تَرْكُهُ",
                        "id": "منيڠڮلكنيا"
                    },
                    {
                        "ar": "بِسُجُودِ",
                        "id": "دڠن سجود"
                    },
                    {
                        "ar": "السَّهْوِ",
                        "id": "سهوي"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٢ -",
                        "id": "٢ -"
                    },
                    {
                        "ar": "الصَّلَاةُ",
                        "id": "صلاة (شلاوات)"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "عَقِبَ",
                        "id": "سسوده"
                    },
                    {
                        "ar": "التَّشَهُدِ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "الْأَوَّلِ",
                        "id": "أَوَّل"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٣ -",
                        "id": "٣ -"
                    },
                    {
                        "ar": "الْجُلُوسُ",
                        "id": "دودوق"
                    },
                    {
                        "ar": "لِلتَّشَهُدِ",
                        "id": "أونْتُوق تَشَهُد"
                    },
                    {
                        "ar": "الْأَوَّلِ",
                        "id": "أَوَّل"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "أَيْ",
                        "id": "يائيتو"
                    },
                    {
                        "ar": "فَهِيَ",
                        "id": "مك ديَا"
                    },
                    {
                        "ar": "إِذًا",
                        "id": "كلاو بڮيتو"
                    },
                    {
                        "ar": "ثَلَاثُ",
                        "id": "تيڮا"
                    },
                    {
                        "ar": "سُنَنٍ",
                        "id": "سُنَّه٢"
                    },
                    {
                        "ar": "مُسْتَقِلَّةٍ",
                        "id": "يڠ برديري سنديري"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "سُنَّةُ",
                        "id": "سُنَّه"
                    },
                    {
                        "ar": "الْجُلُوسِ",
                        "id": "دودوق"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَسُنَّةُ",
                        "id": "دان سُنَّه"
                    },
                    {
                        "ar": "التَّشَهُدِ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "فِيهِ",
                        "id": "دالميا"
                    }
                ],
                [
                    {
                        "ar": "ثُمَّ",
                        "id": "كمودين"
                    },
                    {
                        "ar": "سُنَّةُ",
                        "id": "سُنَّه"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٤ -",
                        "id": "٤ -"
                    },
                    {
                        "ar": "الصَّلَاةُ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "آلِ",
                        "id": "كلوارڮا"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "بَعْدَ",
                        "id": "ستله"
                    },
                    {
                        "ar": "التَّشَهُدِ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "الْأَخِيرِ",
                        "id": "يڠ أخير"
                    },
                    {
                        "ar": "الَّذِي",
                        "id": "يڠ"
                    }
                ],
                [
                    {
                        "ar": "هُوَ",
                        "id": "ديَا"
                    },
                    {
                        "ar": "رُكْنٌ",
                        "id": "ركون"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "أَيْ",
                        "id": "يائيتو"
                    },
                    {
                        "ar": "يُسَنُّ",
                        "id": "دسنَّهكن"
                    },
                    {
                        "ar": "عِنْدَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "أَدَاءِ",
                        "id": "ملاكوكن"
                    },
                    {
                        "ar": "رُكْنِ",
                        "id": "ركون"
                    },
                    {
                        "ar": "التَّشَهُدِ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْجَلْسَةِ",
                        "id": "دودوق"
                    },
                    {
                        "ar": "الْأَخِيرَةِ",
                        "id": "أخير"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَرُكْنِ",
                        "id": "دان ركون"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    }
                ],
                [
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "الصَّلَاةُ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "آلِ",
                        "id": "كلوارڮا"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "لِمَا",
                        "id": "كرنا أفا٢"
                    },
                    {
                        "ar": "مَرَّ",
                        "id": "يڠ تله ليوات"
                    },
                    {
                        "ar": "مَعَكَ",
                        "id": "برسام مو"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    }
                ],
                [
                    {
                        "ar": "الصِّيغَةِ",
                        "id": "صيغة"
                    },
                    {
                        "ar": "الْكَامِلَةِ",
                        "id": "يڠ سمفورنا"
                    },
                    {
                        "ar": "لِلصَّلَاةِ",
                        "id": "أونْتُوق صلاة"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٥ -",
                        "id": "٥ -"
                    },
                    {
                        "ar": "الْقُنُوتُ",
                        "id": "قنوت"
                    },
                    {
                        "ar": "عِنْدَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "الِاعْتِدَالِ",
                        "id": "إعتدال"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "الرَّكْعَةِ",
                        "id": "ركعة"
                    },
                    {
                        "ar": "الثَّانِيَةِ",
                        "id": "كدوا"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "صَلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "الْفَجْرِ",
                        "id": "فجر"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَفِي",
                        "id": "دان دالم"
                    },
                    {
                        "ar": "آخِرِ",
                        "id": "أخير"
                    },
                    {
                        "ar": "رَكْعَةٍ",
                        "id": "ركعة"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "الْوِتْرِ",
                        "id": "وتر"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "النِّصْفِ",
                        "id": "ستڠه"
                    },
                    {
                        "ar": "الثَّانِي",
                        "id": "يڠ كدوا"
                    },
                    {
                        "ar": "مِنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "رَمَضَانَ",
                        "id": "رمضان"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَفِي",
                        "id": "دان دالم"
                    }
                ],
                [
                    {
                        "ar": "اعْتِدَالِ",
                        "id": "إعتدال"
                    },
                    {
                        "ar": "الرَّكْعَةِ",
                        "id": "ركعة"
                    },
                    {
                        "ar": "الْأَخِيرَةِ",
                        "id": "أخير"
                    },
                    {
                        "ar": "مِنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "أَيِّ",
                        "id": "أفا٢"
                    },
                    {
                        "ar": "صَلَاةٍ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "بِالنِّسْبَةِ",
                        "id": "دڠن بنسبه"
                    },
                    {
                        "ar": "لِقُنُوتِ",
                        "id": "أونْتُوق قنوت"
                    },
                    {
                        "ar": "النَّازِلَةِ",
                        "id": "نازلة"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        }
    ],
    147: [
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "رَوَى",
                        "id": "تله مريوايتكن"
                    },
                    {
                        "ar": "أَحْمَدُ",
                        "id": "أحمد"
                    },
                    {
                        "ar": "وَغَيْرُهُ",
                        "id": "دان سلاينيا"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "أَنَسٍ",
                        "id": "أنس"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "«",
                        "id": "«"
                    },
                    {
                        "ar": "مَا زَالَ",
                        "id": "سنانتياسا"
                    },
                    {
                        "ar": "رَسُولُ اللَّهِ",
                        "id": "رسول الله"
                    }
                ],
                [
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "يَقْنُتُ",
                        "id": "ديَا برقنوت"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الصُّبْحِ",
                        "id": "صبح"
                    },
                    {
                        "ar": "حَتَّى",
                        "id": "سهيڠڮا"
                    },
                    {
                        "ar": "فَارَقَ",
                        "id": "ديَا منيڠڮلكن"
                    },
                    {
                        "ar": "الدُّنْيَا",
                        "id": "دنيا"
                    },
                    {
                        "ar": "»",
                        "id": "»"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "(",
                        "id": "("
                    },
                    {
                        "ar": "وَرَوَى",
                        "id": "دان تله مريوايتكن"
                    },
                    {
                        "ar": "الْبُخَارِيُّ",
                        "id": "امام بخاري"
                    },
                    {
                        "ar": "(١٠٠٤)",
                        "id": "(١٠٠٤)"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "وَمُسْلِمٌ",
                        "id": "دان امام مسلم"
                    },
                    {
                        "ar": "(٦٧٧)",
                        "id": "(٦٧٧)"
                    },
                    {
                        "ar": ")",
                        "id": ")"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "أَنَسٍ",
                        "id": "أنس"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    }
                ],
                [
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَقَدْ",
                        "id": "دان سوڠڮوه"
                    },
                    {
                        "ar": "سُئِلَ",
                        "id": "ديَا دتاڽا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَقَنَتَ",
                        "id": "أفاكه برقنوت"
                    },
                    {
                        "ar": "النَّبِيُّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الصُّبْحِ",
                        "id": "صبح"
                    },
                    {
                        "ar": "؟",
                        "id": "؟"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "نَعَمْ",
                        "id": "يَا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "فَقِيلَ",
                        "id": "مك دكاتاكن"
                    },
                    {
                        "ar": "لَهُ",
                        "id": "بڮييا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَقَبْلَ",
                        "id": "أفاكه سبلوم"
                    },
                    {
                        "ar": "الرُّكُوعِ",
                        "id": "ركوع"
                    },
                    {
                        "ar": "؟",
                        "id": "؟"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "بَعْدَ",
                        "id": "ستله"
                    },
                    {
                        "ar": "الرُّكُوعِ",
                        "id": "ركوع"
                    },
                    {
                        "ar": "يَسِيرًا",
                        "id": "سديكيت"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "[",
                        "id": "["
                    },
                    {
                        "ar": "يُنْظَرُ",
                        "id": "دليهت"
                    },
                    {
                        "ar": "الْبَيْهَقِيُّ",
                        "id": "بيهقي"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الصُّبْحِ",
                        "id": "صبح"
                    },
                    {
                        "ar": "وَفِي",
                        "id": "دان دالم"
                    },
                    {
                        "ar": "قُنُوتِ",
                        "id": "قنوت"
                    },
                    {
                        "ar": "الْوِتْرِ",
                        "id": "وتر"
                    },
                    {
                        "ar": "]",
                        "id": "]"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَتُؤَدَّى",
                        "id": "دان ديلقسناكن"
                    },
                    {
                        "ar": "سُنَّةُ",
                        "id": "سُنَّه"
                    },
                    {
                        "ar": "الْقُنُوتِ",
                        "id": "قنوت"
                    },
                    {
                        "ar": "بِأَنْ",
                        "id": "دڠن بهاوا"
                    },
                    {
                        "ar": "يُثْنِيَ",
                        "id": "ديَا مموجي"
                    },
                    {
                        "ar": "الْمُصَلِّي",
                        "id": "أورڠ يڠ صلاة"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "اللَّهِ",
                        "id": "الله"
                    },
                    {
                        "ar": "تَعَالَى",
                        "id": "تعالى"
                    },
                    {
                        "ar": "وَيَدْعُوَهُ",
                        "id": "دان بردعاء كفدايا"
                    },
                    {
                        "ar": "بِأَيِّ",
                        "id": "دڠن أفا٢"
                    }
                ],
                [
                    {
                        "ar": "لَفْظٍ",
                        "id": "لفظ"
                    },
                    {
                        "ar": "شَاءَ",
                        "id": "يڠ ديَا كهندقي"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "كَأَنْ",
                        "id": "سفرتي"
                    },
                    {
                        "ar": "يَقُولَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "«",
                        "id": "«"
                    },
                    {
                        "ar": "اللَّهُمَّ",
                        "id": "يا الله"
                    },
                    {
                        "ar": "اغْفِرْ",
                        "id": "امفونيله"
                    },
                    {
                        "ar": "لِي",
                        "id": "بڮيكو"
                    },
                    {
                        "ar": "يَا غَفُورُ",
                        "id": "واهاي يڠ مها فڠامفون"
                    },
                    {
                        "ar": "»",
                        "id": "»"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "وَلَكِنَّ",
                        "id": "دان أكن تتافي"
                    }
                ],
                [
                    {
                        "ar": "الْكَمَالَ",
                        "id": "كسمفورناءن"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "أَدَائِهَا",
                        "id": "ملاكوكنيا"
                    },
                    {
                        "ar": "يَكُونُ",
                        "id": "اداله"
                    },
                    {
                        "ar": "بِالْتِزَامِ",
                        "id": "دڠن منتاعَتي"
                    },
                    {
                        "ar": "الدُّعَاءِ",
                        "id": "دعاء"
                    },
                    {
                        "ar": "الْوَارِدِ",
                        "id": "يڠ داتڠ"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "رَسُولِ اللَّهِ",
                        "id": "رسول الله"
                    }
                ],
                [
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "ذَلِكَ",
                        "id": "ايتو"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "رَوَى",
                        "id": "تله مريوايتكن"
                    },
                    {
                        "ar": "أَبُو دَاوُدَ",
                        "id": "أبو داود"
                    },
                    {
                        "ar": "(١٤٢٥)",
                        "id": "(١٤٢٥)"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "الْحَسَنِ بْنِ عَلِيٍّ",
                        "id": "الحسن بن علي"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُمَا",
                        "id": "رضي الله عنهما"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ],
                [
                    {
                        "ar": "عَلَّمَنِي",
                        "id": "تله مڠاجركن كفداكو"
                    },
                    {
                        "ar": "رَسُولُ اللَّهِ",
                        "id": "رسول الله"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "كَلِمَاتٍ",
                        "id": "ببراف كلمة"
                    },
                    {
                        "ar": "أَقُولُهُنَّ",
                        "id": "اكو مڠوچفكنيا"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْوِتْرِ",
                        "id": "وتر"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ],
                [
                    {
                        "ar": "«",
                        "id": "«"
                    },
                    {
                        "ar": "اللَّهُمَّ",
                        "id": "يا الله"
                    },
                    {
                        "ar": "اهْدِنِي",
                        "id": "بريله فتونجوق كفداكو"
                    },
                    {
                        "ar": "فِيمَنْ",
                        "id": "دالم أورڠ"
                    },
                    {
                        "ar": "هَدَيْتَ",
                        "id": "يڠ تله اڠكاو بري فتونجوق"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَعَافِنِي",
                        "id": "دان بريله عافية كفداكو"
                    },
                    {
                        "ar": "فِيمَنْ",
                        "id": "دالم أورڠ"
                    },
                    {
                        "ar": "عَافَيْتَ",
                        "id": "يڠ تله اڠكاو بري عافية"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَتَوَلَّنِي",
                        "id": "دان فيمفينله اكو"
                    },
                    {
                        "ar": "فِيمَنْ",
                        "id": "دالم أورڠ"
                    },
                    {
                        "ar": "تَوَلَّيْتَ",
                        "id": "يڠ تله اڠكاو فيمفين"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَبَارِكْ",
                        "id": "دان بركهيله"
                    },
                    {
                        "ar": "لِي",
                        "id": "بڮيكو"
                    },
                    {
                        "ar": "فِيمَا",
                        "id": "دالم أفا٢ يڠ"
                    },
                    {
                        "ar": "أَعْطَيْتَ",
                        "id": "تله اڠكاو بريكن"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَقِنِي",
                        "id": "دان فليهاراله اكو"
                    },
                    {
                        "ar": "شَرَّ",
                        "id": "كجلِكَن"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "قَضَيْتَ",
                        "id": "تله اڠكاو تتفكن"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "إِنَّكَ",
                        "id": "سسوڠڮوهيا اڠكاو"
                    },
                    {
                        "ar": "تَقْضِي",
                        "id": "مننتوكن"
                    },
                    {
                        "ar": "وَلَا يُقْضَى",
                        "id": "دان تيدق دتنتوكن"
                    },
                    {
                        "ar": "عَلَيْكَ",
                        "id": "أَتَسْمو"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَإِنَّهُ",
                        "id": "دان سسوڠڮوهيا"
                    },
                    {
                        "ar": "لَا يَذِلُّ",
                        "id": "تيدق أكن هينا"
                    },
                    {
                        "ar": "مَنْ",
                        "id": "أورڠ يڠ"
                    },
                    {
                        "ar": "وَالَيْتَ",
                        "id": "تله اڠكاو توْلوڠ"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَلَا يَعِزُّ",
                        "id": "دان تيدق أكن موليا"
                    },
                    {
                        "ar": "مَنْ",
                        "id": "أورڠ يڠ"
                    },
                    {
                        "ar": "عَادَيْتَ",
                        "id": "تله اڠكاو موسوهي"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "تَبَارَكْتَ",
                        "id": "مها سوچي اڠكاو"
                    },
                    {
                        "ar": "رَبَّنَا",
                        "id": "توهن كامي"
                    },
                    {
                        "ar": "وَتَعَالَيْتَ",
                        "id": "دان مها تيڠڮي اڠكاو"
                    },
                    {
                        "ar": "»",
                        "id": "»"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "وَيُسَنُّ",
                        "id": "دان دسنَّهكن"
                    },
                    {
                        "ar": "لِلْإِمَامِ",
                        "id": "بڮي امام"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يَأْتِيَ",
                        "id": "ديَا منداتڠكن"
                    }
                ],
                [
                    {
                        "ar": "بِهِ",
                        "id": "دڠنيا"
                    },
                    {
                        "ar": "بِصِيغَةِ",
                        "id": "دڠن صيغة"
                    },
                    {
                        "ar": "الْجَمْعِ",
                        "id": "جمع (بَاڽَق)"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": "التِّرْمِذِيُّ",
                        "id": "الترمذي"
                    },
                    {
                        "ar": "(٤٦٤)",
                        "id": "(٤٦٤)"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "هَذَا",
                        "id": "إِني"
                    },
                    {
                        "ar": "حَدِيثٌ",
                        "id": "حديث"
                    },
                    {
                        "ar": "حَسَنٌ",
                        "id": "حسن"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "وَقَالَ",
                        "id": "دان ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "وَلَا",
                        "id": "دان تيدق"
                    },
                    {
                        "ar": "نَعْرِفُ",
                        "id": "كامي مڠتاهوي"
                    },
                    {
                        "ar": "عَنِ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    }
                ],
                [
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْقُنُوتِ",
                        "id": "قنوت"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْوِتْرِ",
                        "id": "وتر"
                    },
                    {
                        "ar": "شَيْئًا",
                        "id": "سسواتو"
                    },
                    {
                        "ar": "أَحْسَنَ",
                        "id": "يڠ لبيه بايك"
                    },
                    {
                        "ar": "مِنْهُ",
                        "id": "دارييا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَعِنْدَ",
                        "id": "دان منوروت"
                    },
                    {
                        "ar": "أَبِي دَاوُدَ",
                        "id": "أبي داود"
                    },
                    {
                        "ar": "(١٤٢٨)",
                        "id": "(١٤٢٨)"
                    },
                    {
                        "ar": "أَنَّ",
                        "id": "سسوڠڮوهيا"
                    },
                    {
                        "ar": "أُبَيَّ بْنَ كَعْبٍ",
                        "id": "أبي بن كعب"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    },
                    {
                        "ar": "أَمَّهُمْ",
                        "id": "مڠإمامي مريك"
                    }
                ],
                [
                    {
                        "ar": "يَعْنِي",
                        "id": "يائيتو"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "رَمَضَانَ",
                        "id": "رمضان"
                    },
                    {
                        "ar": "وَكَانَ",
                        "id": "دان اداله ديَا"
                    },
                    {
                        "ar": "يَقْنُتُ",
                        "id": "ديَا برقنوت"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "النِّصْفِ",
                        "id": "ستڠه"
                    },
                    {
                        "ar": "الْأَخِيرِ",
                        "id": "يڠ أخير"
                    },
                    {
                        "ar": "مِنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "رَمَضَانَ",
                        "id": "رمضان"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَرَوَى",
                        "id": "دان تله مريوايتكن"
                    },
                    {
                        "ar": "الْحَاكِمُ",
                        "id": "الحاكم"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "أَبِي هُرَيْرَةَ",
                        "id": "أبي هريرة"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    },
                    {
                        "ar": "أَنَّ",
                        "id": "سسوڠڮوهيا"
                    },
                    {
                        "ar": "رَسُولَ اللَّهِ",
                        "id": "رسول الله"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "لَمَّا",
                        "id": "كتيكا"
                    }
                ],
                [
                    {
                        "ar": "رَفَعَ",
                        "id": "ديَا مڠڠكت"
                    },
                    {
                        "ar": "رَأْسَهُ",
                        "id": "كفالايا"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "الرُّكُوعِ",
                        "id": "ركوع"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "صَلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "الصُّبْحِ",
                        "id": "صبح"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الرَّكْعَةِ",
                        "id": "ركعة"
                    },
                    {
                        "ar": "الثَّانِيَةِ",
                        "id": "كدوا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "رَفَعَ",
                        "id": "ديَا مڠڠكت"
                    }
                ],
                [
                    {
                        "ar": "يَدَيْهِ",
                        "id": "كدوا تاڠنيا"
                    },
                    {
                        "ar": "يَدْعُو",
                        "id": "ديَا بردعاء"
                    },
                    {
                        "ar": "بِهَذَا",
                        "id": "دڠن إِني"
                    },
                    {
                        "ar": "الدُّعَاءِ",
                        "id": "دعاء"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "«",
                        "id": "«"
                    },
                    {
                        "ar": "اللَّهُمَّ",
                        "id": "يا الله"
                    },
                    {
                        "ar": "اهْدِنِي",
                        "id": "بريله فتونجوق كفداكو"
                    },
                    {
                        "ar": "...",
                        "id": "..."
                    },
                    {
                        "ar": "»",
                        "id": "»"
                    }
                ]
            ]
        }
    ],
    148: [
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَاسْتَحَبَّ",
                        "id": "دان مڠڠڮف بايك"
                    },
                    {
                        "ar": "الْعُلَمَاءُ",
                        "id": "عُلَمَاءُ"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يُزَادَ",
                        "id": "دتامبهكن"
                    },
                    {
                        "ar": "فِيهِ",
                        "id": "دالميا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "فَلَكَ",
                        "id": "مك باڮي مو"
                    },
                    {
                        "ar": "الْحَمْدُ",
                        "id": "سڮالا فوجي"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "قَضَيْتَ",
                        "id": "تله اڠكاو تتفكن"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "نَسْتَغْفِرُكَ",
                        "id": "كامي مموهون أمفون كفدامو"
                    }
                ],
                [
                    {
                        "ar": "اللَّهُمَّ",
                        "id": "يا الله"
                    },
                    {
                        "ar": "رَبَّنَا",
                        "id": "توهن كامي"
                    },
                    {
                        "ar": "وَنَتُوبُ",
                        "id": "دان كامي برتوبة"
                    },
                    {
                        "ar": "إِلَيْكَ",
                        "id": "كفدامو"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَصَلَّى",
                        "id": "دان تله برصلاة (شلاوات)"
                    },
                    {
                        "ar": "اللَّهُ",
                        "id": "الله"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "سَيِّدِنَا",
                        "id": "ڮوستي كامي"
                    },
                    {
                        "ar": "مُحَمَّدٍ",
                        "id": "محمد"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    }
                ],
                [
                    {
                        "ar": "الْأُمِّيِّ",
                        "id": "يڠ أمّي"
                    },
                    {
                        "ar": "وَعَلَى",
                        "id": "دان أَتَسْ"
                    },
                    {
                        "ar": "آلِهِ",
                        "id": "كلوارڮايا"
                    },
                    {
                        "ar": "وَصَحْبِهِ",
                        "id": "دان صحابتيا"
                    },
                    {
                        "ar": "وَسَلَّمَ",
                        "id": "دان تله ممبري كسلامتن"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "لِلْأَخْبَارِ",
                        "id": "كرنا بِرِيتَا٢"
                    },
                    {
                        "ar": "الصَّحِيحَةِ",
                        "id": "يڠ صحيح"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "بَعْدَ",
                        "id": "ستله"
                    },
                    {
                        "ar": "الدُّعَاءِ",
                        "id": "دعاء"
                    },
                    {
                        "ar": "وَالذِّكْرِ",
                        "id": "دان ذكر"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "[",
                        "id": "["
                    },
                    {
                        "ar": "مُغْنِي الْمُحْتَاجِ",
                        "id": "مغني المحتاج"
                    },
                    {
                        "ar": "١ / ١١٦ - ١١٧",
                        "id": "١ / ١١٦ - ١١٧"
                    },
                    {
                        "ar": "]",
                        "id": "]"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَيُسَنُّ",
                        "id": "دان دسنَّهكن"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يَرْفَعَ",
                        "id": "ديَا مڠڠكت"
                    },
                    {
                        "ar": "يَدَيْهِ",
                        "id": "كدوا تاڠنيا"
                    },
                    {
                        "ar": "أَثْنَاءَ",
                        "id": "دالم كتيكا"
                    },
                    {
                        "ar": "هَذَا",
                        "id": "إِني"
                    },
                    {
                        "ar": "الْقُنُوتِ",
                        "id": "قنوت"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَيَجْعَلَ",
                        "id": "دان ديَا منجاديكن"
                    },
                    {
                        "ar": "بَطْنَهُمَا",
                        "id": "فروتيا (تلافكيا)"
                    },
                    {
                        "ar": "لِجِهَةِ",
                        "id": "كأره"
                    },
                    {
                        "ar": "السَّمَاءِ",
                        "id": "لاڠيت"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "subheading",
            "lines": [
                [
                    {
                        "ar": "ج)",
                        "id": "ج)"
                    },
                    {
                        "ar": "الْهَيْئَاتُ",
                        "id": "هيئات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَقَدْ",
                        "id": "دان سوڠڮوه"
                    },
                    {
                        "ar": "ذَكَرْنَا",
                        "id": "تله كامي سبوتكن"
                    },
                    {
                        "ar": "أَنَّ",
                        "id": "سسوڠڮوهيا"
                    },
                    {
                        "ar": "الْهَيْئَاتِ",
                        "id": "هيئات"
                    },
                    {
                        "ar": "هِيَ",
                        "id": "ديَا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "سُنَنُ",
                        "id": "سُنَّه٢"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "الَّتِي",
                        "id": "يڠ"
                    },
                    {
                        "ar": "إِنْ",
                        "id": "جك"
                    },
                    {
                        "ar": "تَرَكَهَا",
                        "id": "منيڠڮلكنيا ديَا"
                    },
                    {
                        "ar": "الْمُصَلِّي",
                        "id": "أورڠ يڠ صلاة"
                    },
                    {
                        "ar": "لَمْ يُسَنَّ",
                        "id": "تيدق دسنَّهكن"
                    }
                ],
                [
                    {
                        "ar": "جَبْرُهَا",
                        "id": "منمبليا"
                    },
                    {
                        "ar": "بِسُجُودِ",
                        "id": "دڠن سجود"
                    },
                    {
                        "ar": "السَّهْوِ",
                        "id": "سهوي"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "بِخِلَافِ",
                        "id": "بربيدا دڠن"
                    },
                    {
                        "ar": "الْأَبْعَاضِ",
                        "id": "أبعاض"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "وَالْهَيْئَاتُ",
                        "id": "دان هيئات"
                    },
                    {
                        "ar": "تَتَلَخَّصُ",
                        "id": "دريڠكس"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْأُمُورِ",
                        "id": "فركارا٢"
                    },
                    {
                        "ar": "التَّالِيَةِ",
                        "id": "يڠ برايكوتيا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "١ -",
                        "id": "١ -"
                    },
                    {
                        "ar": "رَفْعُ",
                        "id": "مڠڠكت"
                    },
                    {
                        "ar": "الْيَدَيْنِ",
                        "id": "كدوا تاڠن"
                    },
                    {
                        "ar": "عِنْدَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "تَكْبِيرَةِ",
                        "id": "تكبيرة"
                    },
                    {
                        "ar": "الْإِحْرَامِ",
                        "id": "الإحرام"
                    },
                    {
                        "ar": "وَعِنْدَ",
                        "id": "دان كتيكا"
                    },
                    {
                        "ar": "الرُّكُوعِ",
                        "id": "ركوع"
                    },
                    {
                        "ar": "وَالرَّفْعِ",
                        "id": "دان مڠڠكت"
                    },
                    {
                        "ar": "مِنْهُ",
                        "id": "دارييا"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَكَيْفِيَّةُ",
                        "id": "دان چارا"
                    },
                    {
                        "ar": "أَدَاءِ",
                        "id": "ملاكوكن"
                    },
                    {
                        "ar": "هَذِهِ",
                        "id": "إِني"
                    },
                    {
                        "ar": "السُّنَّةِ",
                        "id": "سُنَّه"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يَرْفَعَ",
                        "id": "ديَا مڠڠكت"
                    },
                    {
                        "ar": "كَفَّيْهِ",
                        "id": "كدوا تلافك تاڠنيا"
                    },
                    {
                        "ar": "مُسْتَقْبِلًا",
                        "id": "حالي مڠادف"
                    },
                    {
                        "ar": "بِهِمَا",
                        "id": "دڠن كدوايا"
                    },
                    {
                        "ar": "الْقِبْلَةَ",
                        "id": "قبلة"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "مَنْشُورَتَيِ",
                        "id": "دالم كأداءن تربوكا"
                    },
                    {
                        "ar": "الْأَصَابِعِ",
                        "id": "جاري٢"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "مُحَاذِيًا",
                        "id": "حالي سجاجر"
                    },
                    {
                        "ar": "بِإِبْهَامَيْهِ",
                        "id": "دڠن كدوا ايبو جاريا"
                    },
                    {
                        "ar": "لِشَحْمَتَيِ",
                        "id": "فد كدوا داون"
                    },
                    {
                        "ar": "الْأُذُنَيْنِ",
                        "id": "تليڠا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "عَلَى أَنْ",
                        "id": "دڠن شرط"
                    }
                ],
                [
                    {
                        "ar": "تَكُونَ",
                        "id": "اداله"
                    },
                    {
                        "ar": "كَفَّاهُ",
                        "id": "كدوا تلافكيا"
                    },
                    {
                        "ar": "حَذْوَ",
                        "id": "سجاجر"
                    },
                    {
                        "ar": "مَنْكِبَيْهِ",
                        "id": "كدوا فوندقيا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "رَوَى",
                        "id": "تله مريوايتكن"
                    },
                    {
                        "ar": "الْبُخَارِيُّ",
                        "id": "امام بخاري"
                    },
                    {
                        "ar": "(٧٣٥)",
                        "id": "(٧٣٥)"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "وَمُسْلِمٌ",
                        "id": "دان امام مسلم"
                    },
                    {
                        "ar": "(٣٩٠)",
                        "id": "(٣٩٠)"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "ابْنِ عُمَرَ",
                        "id": "ابن عمر"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُمَا",
                        "id": "رضي الله عنهما"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ],
                [
                    {
                        "ar": "رَأَيْتُ",
                        "id": "اكو تله مليهت"
                    },
                    {
                        "ar": "النَّبِيَّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "إِذَا",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "كَبَّرَ",
                        "id": "ديَا برتكبير"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "رَفَعَ",
                        "id": "ديَا مڠڠكت"
                    },
                    {
                        "ar": "يَدَيْهِ",
                        "id": "كدوا تاڠنيا"
                    },
                    {
                        "ar": "حَتَّى",
                        "id": "سهيڠڮا"
                    }
                ],
                [
                    {
                        "ar": "يُحَاذِيَ",
                        "id": "ديَا منجاجركن"
                    },
                    {
                        "ar": "بِهِمَا",
                        "id": "دڠن كدوايا"
                    },
                    {
                        "ar": "مَنْكِبَيْهِ",
                        "id": "كدوا فوندقيا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَإِذَا",
                        "id": "دان كتيكا"
                    },
                    {
                        "ar": "كَبَّرَ",
                        "id": "ديَا برتكبير"
                    },
                    {
                        "ar": "لِلرُّكُوعِ",
                        "id": "أونْتُوق ركوع"
                    },
                    {
                        "ar": "فَعَلَ",
                        "id": "ديَا ملاكوكن"
                    },
                    {
                        "ar": "مِثْلَهُ",
                        "id": "سميسليا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَإِذَا",
                        "id": "دان كتيكا"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ",
                        "id": "سَمِعَ اللَّهُ لِمَنْ حَمِدَهُ"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "فَعَلَ",
                        "id": "ديَا ملاكوكن"
                    },
                    {
                        "ar": "مِثْلَهُ",
                        "id": "سميسليا"
                    },
                    {
                        "ar": "وَقَالَ",
                        "id": "دان ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ],
                [
                    {
                        "ar": "رَبَّنَا وَلَكَ الْحَمْدُ",
                        "id": "رَبَّنَا وَلَكَ الْحَمْدُ"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَلَا يَفْعَلُ",
                        "id": "دان تيدق ديَا ملاكوكن"
                    },
                    {
                        "ar": "ذَلِكَ",
                        "id": "ايتو"
                    },
                    {
                        "ar": "حِينَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "يَسْجُدُ",
                        "id": "ديَا سجود"
                    },
                    {
                        "ar": "وَلَا حِينَ",
                        "id": "دان تيدق كتيكا"
                    },
                    {
                        "ar": "يَرْفَعُ",
                        "id": "ديَا مڠڠكت"
                    }
                ],
                [
                    {
                        "ar": "رَأْسَهُ",
                        "id": "كفالايا"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "السُّجُودِ",
                        "id": "سجود"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        }
    ],
    149: [
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٢ -",
                        "id": "٢ -"
                    },
                    {
                        "ar": "وَضْعُ",
                        "id": "ملتقكن"
                    },
                    {
                        "ar": "يَدِهِ",
                        "id": "تاڠنيا"
                    },
                    {
                        "ar": "الْيُمْنَى",
                        "id": "يڠ كانن"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "ظَهْرِ",
                        "id": "فوڠڮوڠ"
                    },
                    {
                        "ar": "يَدِهِ",
                        "id": "تاڠنيا"
                    },
                    {
                        "ar": "الْيُسْرَى",
                        "id": "يڠ كيري"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَذَلِكَ",
                        "id": "دان يڠ دميكين ايتو"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الْوُقُوفِ",
                        "id": "برديري"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَكَيْفِيَّةُ",
                        "id": "دان چارا"
                    },
                    {
                        "ar": "ذَلِكَ",
                        "id": "ايتو"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يَضَعَ",
                        "id": "ديَا ملتقكن"
                    },
                    {
                        "ar": "يَدَهُ",
                        "id": "تاڠنيا"
                    },
                    {
                        "ar": "الْيُمْنَى",
                        "id": "يڠ كانن"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "ظَهْرِ",
                        "id": "فوڠڮوڠ"
                    },
                    {
                        "ar": "كَفِّ",
                        "id": "تلافك"
                    },
                    {
                        "ar": "وَرُسْغِ",
                        "id": "دان فرڮلاڠن"
                    },
                    {
                        "ar": "الْيُسْرَى",
                        "id": "يڠ كيري"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "وَيَقْبِضَ",
                        "id": "دان ديَا مڠڮڠڮم"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "الْيُسْرَى",
                        "id": "يڠ كيري"
                    },
                    {
                        "ar": "بِأَصَابِعِ",
                        "id": "دڠن جاري٢"
                    },
                    {
                        "ar": "يَدِهِ",
                        "id": "تاڠنيا"
                    },
                    {
                        "ar": "الْيُمْنَى",
                        "id": "يڠ كانن"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "وَيَكُونَ",
                        "id": "دان اداله"
                    },
                    {
                        "ar": "مَحَلُّ",
                        "id": "تمفت"
                    },
                    {
                        "ar": "ذَلِكَ",
                        "id": "ايتو"
                    },
                    {
                        "ar": "تَحْتَ",
                        "id": "دباوه"
                    }
                ],
                [
                    {
                        "ar": "صَدْرِهِ",
                        "id": "دادايا"
                    },
                    {
                        "ar": "وَفَوْقَ",
                        "id": "دان دي أَتَسْ"
                    },
                    {
                        "ar": "سُرَّتِهِ",
                        "id": "فوسريا"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "لِخَبَرِ",
                        "id": "كرنا خبر"
                    },
                    {
                        "ar": "مُسْلِمٍ",
                        "id": "امام مسلم"
                    },
                    {
                        "ar": "(٤٠١)",
                        "id": "(٤٠١)"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "وَائِلِ بْنِ حُجْرٍ",
                        "id": "وائل بن حجر"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَنَّهُ",
                        "id": "سسوڠڮوهيا ديَا"
                    },
                    {
                        "ar": "رَأَى",
                        "id": "تله مليهت"
                    },
                    {
                        "ar": "النَّبِيَّ",
                        "id": "نبي"
                    }
                ],
                [
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": "رَفَعَ",
                        "id": "ديَا مڠڠكت"
                    },
                    {
                        "ar": "يَدَيْهِ",
                        "id": "كدوا تاڠنيا"
                    },
                    {
                        "ar": "حِينَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "دَخَلَ",
                        "id": "ديَا ماسوق"
                    },
                    {
                        "ar": "فِي",
                        "id": "دالم"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": ".",
                        "id": "."
                    },
                    {
                        "ar": "ثُمَّ",
                        "id": "كمودين"
                    },
                    {
                        "ar": "وَضَعَ",
                        "id": "ديَا ملتقكن"
                    }
                ],
                [
                    {
                        "ar": "يَدَهُ",
                        "id": "تاڠنيا"
                    },
                    {
                        "ar": "الْيُمْنَى",
                        "id": "يڠ كانن"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "الْيُسْرَى",
                        "id": "يڠ كيري"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَعِنْدَ",
                        "id": "دان منوروت"
                    },
                    {
                        "ar": "النَّسَائِيِّ",
                        "id": "النسائي"
                    },
                    {
                        "ar": "(٢ / ٩١)",
                        "id": "(٢ / ٩١)"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "ثُمَّ",
                        "id": "كمودين"
                    },
                    {
                        "ar": "وَضَعَ",
                        "id": "ديَا ملتقكن"
                    },
                    {
                        "ar": "يَدَهُ",
                        "id": "تاڠنيا"
                    },
                    {
                        "ar": "الْيُمْنَى",
                        "id": "يڠ كانن"
                    },
                    {
                        "ar": "عَلَى",
                        "id": "أَتَسْ"
                    },
                    {
                        "ar": "كَفِّهِ",
                        "id": "تلافكيا"
                    },
                    {
                        "ar": "الْيُسْرَى",
                        "id": "يڠ كيري"
                    }
                ],
                [
                    {
                        "ar": "وَالرُّسْغِ",
                        "id": "دان فرڮلاڠن"
                    },
                    {
                        "ar": "وَالسَّاعِدِ",
                        "id": "دان لڠن"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٣ -",
                        "id": "٣ -"
                    },
                    {
                        "ar": "النَّظَرُ",
                        "id": "مليهت"
                    },
                    {
                        "ar": "إِلَى",
                        "id": "كفد"
                    },
                    {
                        "ar": "مَوْضِعِ",
                        "id": "تمفت"
                    },
                    {
                        "ar": "السُّجُودِ",
                        "id": "سجود"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "فَيُكْرَهُ",
                        "id": "مك دمكروهكن"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يَتَوَزَّعَ",
                        "id": "ترتوجو كمَانَ٢"
                    },
                    {
                        "ar": "نَظَرُهُ",
                        "id": "فنداڠنيا"
                    },
                    {
                        "ar": "فِيمَا",
                        "id": "فد أفا٢ يڠ"
                    },
                    {
                        "ar": "حَوْلَهُ",
                        "id": "دسكيطريا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "أَوْ أَنْ",
                        "id": "أتاو بهاوا"
                    },
                    {
                        "ar": "يَنْظُرَ",
                        "id": "ديَا مليهت"
                    },
                    {
                        "ar": "إِلَى",
                        "id": "كفد"
                    },
                    {
                        "ar": "الْأَعْلَى",
                        "id": "يڠ دي أَتَسْ"
                    },
                    {
                        "ar": "أَوْ إِلَى",
                        "id": "أتاو كفد"
                    }
                ],
                [
                    {
                        "ar": "شَيْءٍ",
                        "id": "سسواتو"
                    },
                    {
                        "ar": "أَمَامَهُ",
                        "id": "دي دفانيا"
                    },
                    {
                        "ar": "حَتَّى",
                        "id": "سهيڠڮا"
                    },
                    {
                        "ar": "وَلَوْ",
                        "id": "دان مسكيفون"
                    },
                    {
                        "ar": "كَانَ",
                        "id": "اداله ديَا"
                    },
                    {
                        "ar": "الْكَعْبَةَ",
                        "id": "كعبة"
                    },
                    {
                        "ar": "؛",
                        "id": "؛"
                    },
                    {
                        "ar": "بَلْ",
                        "id": "بهكن"
                    },
                    {
                        "ar": "يُسَنُّ",
                        "id": "دسنَّهكن"
                    },
                    {
                        "ar": "أَنْ",
                        "id": "بهاوا"
                    },
                    {
                        "ar": "يَجْعَلَ",
                        "id": "ديَا منجاديكن"
                    },
                    {
                        "ar": "نَظَرَهُ",
                        "id": "فنداڠنيا"
                    },
                    {
                        "ar": "الدَّائِمَ",
                        "id": "يڠ تروس منروس"
                    }
                ],
                [
                    {
                        "ar": "إِلَى",
                        "id": "كفد"
                    },
                    {
                        "ar": "مَوْضِعِ",
                        "id": "تمفت"
                    },
                    {
                        "ar": "سُجُودِهِ",
                        "id": "سجوديا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "إِلَّا",
                        "id": "كچوالي"
                    },
                    {
                        "ar": "عِنْدَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "التَّشَهُدِ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "فَلْيَجْعَلْ",
                        "id": "مك هندقله ديَا منجاديكن"
                    },
                    {
                        "ar": "نَظَرَهُ",
                        "id": "فنداڠنيا"
                    },
                    {
                        "ar": "إِلَى",
                        "id": "كفد"
                    },
                    {
                        "ar": "سَبَّابَتِهِ",
                        "id": "جاري تلونجوقيا"
                    }
                ],
                [
                    {
                        "ar": "الَّتِي",
                        "id": "يڠ"
                    },
                    {
                        "ar": "يُشِيرُ",
                        "id": "ديَا ممبري اشارة"
                    },
                    {
                        "ar": "بِهَا",
                        "id": "دڠنيا"
                    },
                    {
                        "ar": "عِنْدَ",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "التَّشَهُدِ",
                        "id": "تَشَهُد"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "دَلِيلُ",
                        "id": "داليل"
                    },
                    {
                        "ar": "ذَلِكَ",
                        "id": "ايتو"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "اتِّبَاعُ",
                        "id": "مڠيكوتي"
                    },
                    {
                        "ar": "فِعْلِ",
                        "id": "فربواتن"
                    },
                    {
                        "ar": "النَّبِيِّ",
                        "id": "نبي"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "٤ -",
                        "id": "٤ -"
                    },
                    {
                        "ar": "افْتِتَاحُ",
                        "id": "ممبوكا"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "بَعْدَ",
                        "id": "ستله"
                    },
                    {
                        "ar": "التَّكْبِيرِ",
                        "id": "تكبير"
                    },
                    {
                        "ar": "بِقِرَاءَةِ",
                        "id": "دڠن ممباچا"
                    },
                    {
                        "ar": "التَّوَجُّهِ",
                        "id": "دعاء توجه"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    }
                ]
            ]
        },
        {
            "type": "paragraph",
            "lines": [
                [
                    {
                        "ar": "وَلَفْظُهُ",
                        "id": "دان لفظيا"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "مَا",
                        "id": "أفا٢ يڠ"
                    },
                    {
                        "ar": "رَوَاهُ",
                        "id": "تله مريوايتكنيا"
                    },
                    {
                        "ar": "مُسْلِمٌ",
                        "id": "امام مسلم"
                    },
                    {
                        "ar": "(٧٧١)",
                        "id": "(٧٧١)"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "عَلِيٍّ",
                        "id": "علي"
                    },
                    {
                        "ar": "رَضِيَ اللَّهُ عَنْهُ",
                        "id": "رضي الله عنه"
                    },
                    {
                        "ar": "عَنْ",
                        "id": "دَارِي"
                    }
                ],
                [
                    {
                        "ar": "رَسُولِ اللَّهِ",
                        "id": "رسول الله"
                    },
                    {
                        "ar": "ﷺ",
                        "id": "ﷺ"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "أَنَّهُ",
                        "id": "سسوڠڮوهيا ديَا"
                    },
                    {
                        "ar": "كَانَ",
                        "id": "اداله ديَا"
                    },
                    {
                        "ar": "إِذَا",
                        "id": "كتيكا"
                    },
                    {
                        "ar": "قَامَ",
                        "id": "ديَا برديري"
                    },
                    {
                        "ar": "إِلَى",
                        "id": "كفد"
                    },
                    {
                        "ar": "الصَّلَاةِ",
                        "id": "صلاة"
                    },
                    {
                        "ar": "قَالَ",
                        "id": "ديَا بركات"
                    },
                    {
                        "ar": ":",
                        "id": ":"
                    },
                    {
                        "ar": "«",
                        "id": "«"
                    },
                    {
                        "ar": "وَجَّهْتُ",
                        "id": "اكو مڠادفكن"
                    }
                ],
                [
                    {
                        "ar": "وَجْهِيَ",
                        "id": "واجهكو"
                    },
                    {
                        "ar": "لِلَّذِي",
                        "id": "كفد زات يڠ"
                    },
                    {
                        "ar": "فَطَرَ",
                        "id": "تله منچيفتاكن"
                    },
                    {
                        "ar": "السَّمَوَاتِ",
                        "id": "لاڠيت٢"
                    },
                    {
                        "ar": "وَالْأَرْضَ",
                        "id": "دان بومي"
                    },
                    {
                        "ar": "حَنِيفًا",
                        "id": "حالي چوندوڠ (كفد كبنرن)"
                    },
                    {
                        "ar": "وَمَا",
                        "id": "دان تيدقله"
                    },
                    {
                        "ar": "أَنَا",
                        "id": "اكو"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "الْمُشْرِكِينَ",
                        "id": "ڮولوڠن أورڠ٢ مشرك"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    }
                ],
                [
                    {
                        "ar": "إِنَّ",
                        "id": "سسوڠڮوهيا"
                    },
                    {
                        "ar": "صَلَاتِي",
                        "id": "صلاةكو"
                    },
                    {
                        "ar": "وَنُسُكِي",
                        "id": "دان عبادةكو"
                    },
                    {
                        "ar": "وَمَحْيَايَ",
                        "id": "دان هيدوفكو"
                    },
                    {
                        "ar": "وَمَمَاتِي",
                        "id": "دان ماتيكو"
                    },
                    {
                        "ar": "لِلَّهِ",
                        "id": "ايتو ميليك الله"
                    },
                    {
                        "ar": "رَبِّ",
                        "id": "توهن"
                    },
                    {
                        "ar": "الْعَالَمِينَ",
                        "id": "سمستا عالم"
                    },
                    {
                        "ar": "،",
                        "id": "،"
                    },
                    {
                        "ar": "لَا",
                        "id": "تيدق ادا"
                    },
                    {
                        "ar": "شَرِيكَ",
                        "id": "سكوتو"
                    },
                    {
                        "ar": "لَهُ",
                        "id": "بڮييا"
                    }
                ],
                [
                    {
                        "ar": "وَبِذَلِكَ",
                        "id": "دان دڠن يڠ دميكين ايتو"
                    },
                    {
                        "ar": "أُمِرْتُ",
                        "id": "اكو دفرينتهكن"
                    },
                    {
                        "ar": "وَأَنَا",
                        "id": "دان اكو"
                    },
                    {
                        "ar": "مِنَ",
                        "id": "دَارِي"
                    },
                    {
                        "ar": "الْمُسْلِمِينَ",
                        "id": "ڮولوڠن أورڠ٢ مسلم"
                    },
                    {
                        "ar": "»",
                        "id": "»"
                    },
                    {
                        "ar": ".",
                        "id": "."
                    }
                ]
            ]
        }
    ],
    150: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "[",
                    "id": "..."
                },
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "يتدابعب",
                    "id": "..."
                },
                {
                    "ar": "تدصق",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "يهجو",
                    "id": "..."
                },
                {
                    "ar": "تهجو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":ًافينح",
                    "id": "..."
                },
                {
                    "ar": ".اهقلخ",
                    "id": "..."
                },
                {
                    "ar": "أدتبا",
                    "id": "..."
                },
                {
                    "ar": ":رطف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "ها",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "هبا",
                    "id": "..."
                },
                {
                    "ar": "او",
                    "id": "..."
                },
                {
                    "ar": "داغ",
                    "id": "..."
                },
                {
                    "ar": "کس",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "کلا",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "اا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "بتابحتسا",
                    "id": "..."
                },
                {
                    "ar": "ناکم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءةلفانلاو",
                    "id": "..."
                },
                {
                    "ar": "ةضورفملا",
                    "id": "..."
                },
                {
                    "ar": "حاتتفا",
                    "id": "..."
                },
                {
                    "ar": "ت",
                    "id": "..."
                },
                {
                    "ar": "هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءأرف",
                    "id": "..."
                },
                {
                    "ar": "بتحتست",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "درفنملل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "اهب",
                    "id": "..."
                },
                {
                    "ar": "ادب",
                    "id": "..."
                },
                {
                    "ar": "ناف",
                    "id": "..."
                },
                {
                    "ar": "د",
                    "id": "..."
                },
                {
                    "ar": "ةحتاملا",
                    "id": "..."
                },
                {
                    "ar": "ةءارقب",
                    "id": "..."
                },
                {
                    "ar": "ادى",
                    "id": "..."
                },
                {
                    "ar": "ال",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ط",
                    "id": "..."
                },
                {
                    "ar": "رشب",
                    "id": "..."
                },
                {
                    "ar": "»مومأملاو",
                    "id": "..."
                },
                {
                    "ar": "ماماللو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةءارق",
                    "id": "..."
                },
                {
                    "ar": "ةينس",
                    "id": "..."
                },
                {
                    "ar": "تتاف",
                    "id": "..."
                },
                {
                    "ar": "ءذوعتلاب",
                    "id": "..."
                },
                {
                    "ar": "وأ",
                    "id": "..."
                },
                {
                    "ar": "_اهنم",
                    "id": "..."
                },
                {
                    "ar": "ءزج",
                    "id": "..."
                },
                {
                    "ar": "ةلمسبلا",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "تملع",
                    "id": "..."
                },
                {
                    "ar": "دقو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "ناک",
                    "id": "..."
                },
                {
                    "ar": "ولو",
                    "id": "..."
                },
                {
                    "ar": "هيلإ",
                    "id": "..."
                },
                {
                    "ar": "دوعی",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ىغبني",
                    "id": "..."
                },
                {
                    "ar": "الف",
                    "id": "..."
                },
                {
                    "ar": "»هجوتلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةضيرفلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "یف",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": "ءةزانجلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "ص",
                    "id": "..."
                },
                {
                    "ar": "هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءأارق",
                    "id": "..."
                },
                {
                    "ar": "بحتس",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".تقولا",
                    "id": "..."
                },
                {
                    "ar": "جرخي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءارقب",
                    "id": "..."
                },
                {
                    "ar": "لختشا",
                    "id": "..."
                },
                {
                    "ar": "نإ",
                    "id": "..."
                },
                {
                    "ar": "يشخ",
                    "id": "..."
                },
                {
                    "ar": "ثيحب",
                    "id": "..."
                },
                {
                    "ar": "»اهتقو",
                    "id": "..."
                },
                {
                    "ar": "قاض",
                    "id": "..."
                },
                {
                    "ar": "اذإ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "دعب",
                    "id": "..."
                },
                {
                    "ar": "ةداعتسالا",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                },
                {
                    "ar": "ه",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "ميجرلا",
                    "id": "..."
                },
                {
                    "ar": "ناطيشلا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "هللاب",
                    "id": "..."
                },
                {
                    "ar": "ذوعأ",
                    "id": "..."
                },
                {
                    "ar": ":لوقي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "یهو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةءارق",
                    "id": "..."
                },
                {
                    "ar": "اهب",
                    "id": "..."
                },
                {
                    "ar": "أدبي",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةذاعتسالا",
                    "id": "..."
                },
                {
                    "ar": "تتاف",
                    "id": "..."
                },
                {
                    "ar": "»ذيعتسي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "لبق",
                    "id": "..."
                },
                {
                    "ar": "ةحتافلا",
                    "id": "..."
                },
                {
                    "ar": "ةءارق",
                    "id": "..."
                },
                {
                    "ar": "ىف",
                    "id": "..."
                },
                {
                    "ar": "عرش",
                    "id": "..."
                },
                {
                    "ar": "اذإف",
                    "id": "..."
                },
                {
                    "ar": "»ةحتافلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".اهيلإ",
                    "id": "..."
                },
                {
                    "ar": "دوعي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "هركو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ناطْيْشلا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "هُللاب",
                    "id": "..."
                },
                {
                    "ar": "ٌدعَتْساف",
                    "id": "..."
                },
                {
                    "ar": "نآَرَقلا",
                    "id": "..."
                },
                {
                    "ar": "تارق",
                    "id": "..."
                },
                {
                    "ar": "اذ",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "هناحبس",
                    "id": "..."
                },
                {
                    "ar": "هلوقل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ميجرلا#",
                    "id": "..."
                },
                {
                    "ar": "(٩).",
                    "id": "..."
                },
                {
                    "ar": "ةيآلا",
                    "id": "..."
                },
                {
                    "ar": ":لحنلا",
                    "id": "..."
                },
                {
                    "ar": "ةروس۸",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ">",
                    "id": "..."
                },
                {
                    "ar": "-",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ةءارقلاب",
                    "id": "..."
                },
                {
                    "ar": "رهجلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "رارسإلاو",
                    "id": "..."
                },
                {
                    "ar": "هعضوم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هعضوم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءرجفلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "اتعكر",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "يه",
                    "id": "..."
                },
                {
                    "ar": "ةءارقلاب",
                    "id": "..."
                },
                {
                    "ar": "رهجلا",
                    "id": "..."
                },
                {
                    "ar": "اهيف",
                    "id": "..."
                },
                {
                    "ar": "نسي",
                    "id": "..."
                },
                {
                    "ar": "يتلا",
                    "id": "..."
                },
                {
                    "ar": "عضاوملاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "›نيديعلاو",
                    "id": "..."
                },
                {
                    "ar": "ءةعمجلا",
                    "id": "..."
                },
                {
                    "ar": "ةالصو",
                    "id": "..."
                },
                {
                    "ar": "»ءاشعلاو",
                    "id": "..."
                },
                {
                    "ar": "برغملا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "نايلوألا",
                    "id": "..."
                },
                {
                    "ar": "ناتعكرلاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "لك",
                    "id": "..."
                },
                {
                    "ar": "»ناضمر",
                    "id": "..."
                },
                {
                    "ar": "رتوو",
                    "id": "..."
                },
                {
                    "ar": "»",
                    "id": "..."
                },
                {
                    "ar": "حيوارتلاو",
                    "id": "..."
                },
                {
                    "ar": "»ءاقستسالا",
                    "id": "..."
                },
                {
                    "ar": "ةالصو",
                    "id": "..."
                },
                {
                    "ar": "»رمقلا",
                    "id": "..."
                },
                {
                    "ar": "فوسخو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".كلذ",
                    "id": "..."
                },
                {
                    "ar": "ادع",
                    "id": "..."
                },
                {
                    "ar": "اميف",
                    "id": "..."
                },
                {
                    "ar": "رارسإلا",
                    "id": "..."
                },
                {
                    "ar": "نسيو",
                    "id": "..."
                },
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "طقف",
                    "id": "..."
                },
                {
                    "ar": "درفنملاو",
                    "id": "..."
                },
                {
                    "ar": "مامإلل",
                    "id": "..."
                },
                {
                    "ar": "ةبسنلاب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":اهنم",
                    "id": "..."
                },
                {
                    "ar": "ثيداحأ",
                    "id": "..."
                },
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "لد",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ")",
                    "id": "..."
                },
                {
                    "ar": "۰",
                    "id": "..."
                }
            ]
        ]
    }
]
};
