const pagesData = {
    144: [
        {
            type: 'heading',
            lines: [
                [
                    { ar: 'سُنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: 'السُّنَّةُ:', id: 'سُنَّه اَدَالَهْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'هِيَ', id: 'إِيَا' },
                    { ar: 'مَا', id: 'أَفَا٢ يَڠْ' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْإِنْسَانِ', id: 'مَانُوسِيَا' },
                    { ar: 'فِعْلُهُ', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'غَيْرِ', id: 'بُوكَنْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْحَتْمِ،', id: 'وَاجِبْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يُثَابُ', id: 'دِيبَرِي فَاهَالَا' }
                ],
                [
                    { ar: 'الْمُسْلِمُ', id: 'سَأَوْرَڠْ مُسْلِمْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'فِعْلِهِ', id: 'مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يُعَاقَبُ', id: 'دِيهُوكُومْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهِ.', id: 'مَنِيڠْڮَلْكَنّيَا.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَرْكَانٌ', id: 'رُوكُون٢' },
                    { ar: 'وَشُرُوطٌ', id: 'دَانْ شَرَط٢' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'بُدَّ', id: 'بُولَيْه تِيدَاكْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'فِعْلِهَا', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْإِلْزَامِ', id: 'كَوَاجِبَنْ' }
                ],
                [
                    { ar: 'أَوْ', id: 'أَتَوْ' },
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'كَيْ', id: 'أَڮَرْ' },
                    { ar: 'تَصِحَّ', id: 'سَهْ' },
                    { ar: 'الصَّلَاةُ؛', id: 'صَلَاةْ؛' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'ذَكَرْنَاهَا', id: 'كَامِي تَلَاهْ مَثَبُوتْكَنّيَا' },
                    { ar: 'فِيمَا', id: 'فَدَا أَفَا يَڠْ' },
                    { ar: 'سَبَقَ.', id: 'تَلَاهْ لَالُو.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'سُنَنٌ', id: 'سُنَّه٢' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَڠْ يَڠْ صَلَاةْ' },
                    { ar: 'فِعْلُهَا،', id: 'مڠرجاكنيَا،' },
                    { ar: 'وَلَكِنْ', id: 'دَانْ تَتَافِي' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' }
                ],
                [
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يَزْدَادُ', id: 'بَرْتَامْبَاهْ' },
                    { ar: 'ثَوَابُ', id: 'فَاهَالَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'بِفِعْلِهَا', id: 'دڠَنْ مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'عِقَابَ', id: 'هُوكُومَنْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهَا.', id: 'مَنِيڠْڮَلْكَنّيَا.' },
                    { ar: 'وَهَذِهِ', id: 'دَانْ اِينِي' }
                ],
                [
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'كَثِيرَةٌ،', id: 'بَاڽَاكْ،' },
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'تَنْقَسِمُ', id: 'تَرْبَاڮِي' },
                    { ar: 'فِي', id: 'دَالَمْ' },
                    { ar: 'مَجْمُوعِهَا', id: 'كُومْفُولَنّيَا' },
                    { ar: 'إِلَى :', id: 'كَفَدَا :' },
                    { ar: 'سُنَنٍ', id: 'سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ،' }
                ],
                [
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'أَثْنَائِهَا،', id: 'تڠَهْ-تڠَهْيَا،' },
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'عَقِبَهَا.', id: 'سَتَلَاهْيَا.' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '( أ )', id: '(A)' },
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ:', id: 'صَلَاةْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'تَزِيدُ', id: 'لَبِيهْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'الْأُمُورِ', id: 'فَرْكَارَا٢' },
                    { ar: 'الثَّلَاثَةِ', id: 'يَڠْ تِيقَا' },
                    { ar: 'التَّالِيَةِ:', id: 'بَرِيكُوتْ اِينِي:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الْأَوَّلُ', id: 'فَرْتَامَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْأَذَانُ :', id: 'أَذَانْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'تَعْرِيفُهُ', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'دَلِيلِهِ', id: 'دَلِيلْيَا' },
                    { ar: 'وَشُرُوطِهِ', id: 'دَانْ شَرَط٢يَا' },
                    { ar: 'وَمَا', id: 'دَانْ أَفَا يَڠْ' },
                    { ar: 'يَتَعَلَّقُ', id: 'بَرْكَائِيْتَنْ' },
                    { ar: 'بِذَلِكَ .', id: 'دڠَنْ حَالْ اِيتُو.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الثَّانِي', id: 'كَدُوَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْإِقَامَةُ :', id: 'إِقَامَةْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'تَعْرِيفُهَا', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'شُرُوطِهَا', id: 'شَرَط٢يَا' },
                    { ar: 'وَالْفَرْقُ', id: 'دَانْ فَرْبَيدَاءَنْ' },
                    { ar: 'بَيْنَهَا', id: 'دِي أَنْتَارَايَا' },
                    { ar: 'وَبَيْنَ', id: 'دَانْ دِي أَنْتَارَا' },
                    { ar: 'الْأَذَانِ.', id: 'أَذَانْ.' }
                ]
            ]
        }
    ]
,
    145: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "‏",
                    "id": "..."
                },
                {
                    "ar": "ثلاثلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "»رادجک",
                    "id": "..."
                },
                {
                    "ar": "»نيراملا",
                    "id": "..."
                },
                {
                    "ar": "نيبو",
                    "id": "..."
                },
                {
                    "ar": "هنیب",
                    "id": "..."
                },
                {
                    "ar": "لوحت",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "همامأ",
                    "id": "..."
                },
                {
                    "ar": "ةه",
                    "id": "..."
                },
                {
                    "ar": "رتس",
                    "id": "..."
                },
                {
                    "ar": "ذداختا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "دجي",
                    "id": "..."
                },
                {
                    "ar": "مل",
                    "id": "..."
                },
                {
                    "ar": "نإف",
                    "id": "..."
                },
                {
                    "ar": ".اهوحنو",
                    "id": "..."
                },
                {
                    "ar": "ةداجسک",
                    "id": "..."
                },
                {
                    "ar": "یلصم",
                    "id": "..."
                },
                {
                    "ar": "همامأ",
                    "id": "..."
                },
                {
                    "ar": "طسي",
                    "id": "..."
                },
                {
                    "ar": "نأك",
                    "id": "..."
                },
                {
                    "ar": "وأ",
                    "id": "..."
                },
                {
                    "ar": "ءاصعو",
                    "id": "..."
                },
                {
                    "ar": "»دومعو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "(",
                    "id": "..."
                },
                {
                    "ar": "يراخبلا",
                    "id": "..."
                },
                {
                    "ar": "ىور۷۲٥).",
                    "id": "..."
                },
                {
                    "ar": "ملسمو",
                    "id": "..."
                },
                {
                    "ar": "‏؛)٤۰۱(",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "رمع",
                    "id": "..."
                },
                {
                    "ar": "نبا",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "عضوتف",
                    "id": "..."
                },
                {
                    "ar": "ءةبرحلاب",
                    "id": "..."
                },
                {
                    "ar": "رَمأ",
                    "id": "..."
                },
                {
                    "ar": "ِديِعلا",
                    "id": "..."
                },
                {
                    "ar": "موي",
                    "id": "..."
                },
                {
                    "ar": "جرح",
                    "id": "..."
                },
                {
                    "ar": "اذإ",
                    "id": "..."
                },
                {
                    "ar": "ناك",
                    "id": "..."
                },
                {
                    "ar": "ب",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوسر",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": ":امهنع",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".رفسلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "لعفي",
                    "id": "..."
                },
                {
                    "ar": "ناكو",
                    "id": "..."
                },
                {
                    "ar": "»ءءارو",
                    "id": "..."
                },
                {
                    "ar": "سانلاو",
                    "id": "..."
                },
                {
                    "ar": "اهيلإ",
                    "id": "..."
                },
                {
                    "ar": "يلصيف",
                    "id": "..."
                },
                {
                    "ar": "هيدي",
                    "id": "..."
                },
                {
                    "ar": "ني",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "[",
                    "id": "..."
                },
                {
                    "ar": ".]همادق",
                    "id": "..."
                },
                {
                    "ar": ":هيدي",
                    "id": "..."
                },
                {
                    "ar": "نيب",
                    "id": "..."
                },
                {
                    "ar": ".لصنلا",
                    "id": "..."
                },
                {
                    "ar": "ضيرع",
                    "id": "..."
                },
                {
                    "ar": "ُريصق",
                    "id": "..."
                },
                {
                    "ar": "حمر",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "ةبرحلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "»",
                    "id": "..."
                },
                {
                    "ar": "هدوجس",
                    "id": "..."
                },
                {
                    "ar": "عصوم",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "ةيرف",
                    "id": "..."
                },
                {
                    "ar": "ةرتسلا",
                    "id": "..."
                },
                {
                    "ar": "نوکت",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "لضفألاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "یور",
                    "id": "..."
                },
                {
                    "ar": "دقف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "(",
                    "id": "..."
                },
                {
                    "ar": "يراخبلا4۷6))»",
                    "id": "..."
                },
                {
                    "ar": "ملسمو",
                    "id": "..."
                },
                {
                    "ar": "؛9٩۸(",
                    "id": "..."
                },
                {
                    "ar": "هنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يصر",
                    "id": "..."
                },
                {
                    "ar": "دعس",
                    "id": "..."
                },
                {
                    "ar": "نب",
                    "id": "..."
                },
                {
                    "ar": "لهس",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "رمم",
                    "id": "..."
                },
                {
                    "ar": "راّدجلا",
                    "id": "..."
                },
                {
                    "ar": "نيبو",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوُسر",
                    "id": "..."
                },
                {
                    "ar": "ىلصُم",
                    "id": "..."
                },
                {
                    "ar": "نيب",
                    "id": "..."
                },
                {
                    "ar": "ناك",
                    "id": "..."
                },
                {
                    "ar": ":لاق",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ةاشلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "[",
                    "id": "..."
                },
                {
                    "ar": ".]ةاشلا",
                    "id": "..."
                },
                {
                    "ar": "هنم",
                    "id": "..."
                },
                {
                    "ar": "رمتام",
                    "id": "..."
                },
                {
                    "ar": "ةعس",
                    "id": "..."
                },
                {
                    "ar": ":ةاشلا",
                    "id": "..."
                },
                {
                    "ar": "رمم",
                    "id": "..."
                },
                {
                    "ar": ".دوجسلا",
                    "id": "..."
                },
                {
                    "ar": "عضوم",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "ىلصم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "(",
                    "id": "..."
                },
                {
                    "ar": ":ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "ءانثأ",
                    "id": "..."
                },
                {
                    "ar": "ىدؤت",
                    "id": "..."
                },
                {
                    "ar": "ىتلا",
                    "id": "..."
                },
                {
                    "ar": "ننسلا",
                    "id": "..."
                },
                {
                    "ar": ")ب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "(",
                    "id": "..."
                },
                {
                    "ar": ".ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "رخا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "وهسلا",
                    "id": "..."
                },
                {
                    "ar": "دوجسب",
                    "id": "..."
                },
                {
                    "ar": "هکرت",
                    "id": "..."
                },
                {
                    "ar": "ربجي",
                    "id": "..."
                },
                {
                    "ar": "ام",
                    "id": "..."
                },
                {
                    "ar": "لک",
                    "id": "..."
                },
                {
                    "ar": ")ضاعبألاف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "وهسلا",
                    "id": "..."
                },
                {
                    "ar": "دوجس",
                    "id": "..."
                },
                {
                    "ar": "حرشنسو",
                    "id": "..."
                },
                {
                    "ar": ".وهسلا",
                    "id": "..."
                },
                {
                    "ar": "دوجسد",
                    "id": "..."
                },
                {
                    "ar": "هکرت",
                    "id": "..."
                },
                {
                    "ar": "ربجي",
                    "id": "..."
                },
                {
                    "ar": "ال",
                    "id": "..."
                },
                {
                    "ar": "ام",
                    "id": "..."
                },
                {
                    "ar": "لک",
                    "id": "..."
                },
                {
                    "ar": ")تائيهلاو(",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "هب",
                    "id": "..."
                },
                {
                    "ar": "قلعتي",
                    "id": "..."
                },
                {
                    "ar": "امو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "مالكلا",
                    "id": "..."
                },
                {
                    "ar": "رخا",
                    "id": "..."
                },
                {
                    "ar": "ثاحبأ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "لامعأ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ايناث",
                    "id": "..."
                },
                {
                    "ar": "اهتائيه",
                    "id": "..."
                },
                {
                    "ar": "مث",
                    "id": "..."
                },
                {
                    "ar": "ءأالوأ",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "ضاعبأ",
                    "id": "..."
                },
                {
                    "ar": "دادعتب",
                    "id": "..."
                },
                {
                    "ar": "دبنو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":ضامعبألا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "|",
                    "id": "..."
                },
                {
                    "ar": ":لوألا",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "سولجلا",
                    "id": "..."
                },
                {
                    "ar": "وهو",
                    "id": "..."
                },
                {
                    "ar": "»مالس",
                    "id": "..."
                },
                {
                    "ar": "هبقعي",
                    "id": "..."
                },
                {
                    "ar": "ال",
                    "id": "..."
                },
                {
                    "ar": "يذلا",
                    "id": "..."
                },
                {
                    "ar": "سولجلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "هب",
                    "id": "..."
                },
                {
                    "ar": "دصقيو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "\\",
                    "id": "..."
                },
                {
                    "ar": "€",
                    "id": "..."
                },
                {
                    "ar": "٥",
                    "id": "..."
                }
            ]
        ]
    }
],
    146: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءاشعلاو",
                    "id": "..."
                },
                {
                    "ar": "برغملاو",
                    "id": "..."
                },
                {
                    "ar": "رصعلاو",
                    "id": "..."
                },
                {
                    "ar": "رهظلا",
                    "id": "..."
                },
                {
                    "ar": "ةاالص",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "نیتعکر",
                    "id": "..."
                },
                {
                    "ar": "سأر",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "لوکی",
                    "id": "..."
                },
                {
                    "ar": "يذلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".هيف",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "نسيف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ")",
                    "id": "..."
                },
                {
                    "ar": "دواد",
                    "id": "..."
                },
                {
                    "ar": "یبأ",
                    "id": "..."
                },
                {
                    "ar": "دنع",
                    "id": "..."
                },
                {
                    "ar": "هتالص",
                    "id": "..."
                },
                {
                    "ar": "ءیسملا",
                    "id": "..."
                },
                {
                    "ar": "ثیدح",
                    "id": "..."
                },
                {
                    "ar": "یف",
                    "id": "..."
                },
                {
                    "ar": "ءاج۸٦۰(",
                    "id": "..."
                },
                {
                    "ar": "تشسلج",
                    "id": "..."
                },
                {
                    "ar": "اذإف«",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".»دهشت",
                    "id": "..."
                },
                {
                    "ar": "مث",
                    "id": "..."
                },
                {
                    "ar": "»ىّرسْيلا",
                    "id": "..."
                },
                {
                    "ar": "كّدْجف",
                    "id": "..."
                },
                {
                    "ar": "شرتفاو",
                    "id": "..."
                },
                {
                    "ar": "ٌنْيَمطاف",
                    "id": "..."
                },
                {
                    "ar": "ةالّصلا",
                    "id": "..."
                },
                {
                    "ar": "طَّسَو",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يراخبلا",
                    "id": "..."
                },
                {
                    "ar": "هاور",
                    "id": "..."
                },
                {
                    "ar": "ام",
                    "id": "..."
                },
                {
                    "ar": "؛ضرفب",
                    "id": "..."
                },
                {
                    "ar": "سیلو",
                    "id": "..."
                },
                {
                    "ar": "ةنس",
                    "id": "..."
                },
                {
                    "ar": "هنأ",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ليلدلاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ")۱١۱۷۴۳(",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "٥)",
                    "id": "..."
                },
                {
                    "ar": "ملسمو۷",
                    "id": "..."
                },
                {
                    "ar": "سولج",
                    "id": "..."
                },
                {
                    "ar": "هيلعو",
                    "id": "..."
                },
                {
                    "ar": "رهظلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ماق",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوسر",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "‏(١",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "بهب",
                    "id": "..."
                },
                {
                    "ar": "نايتإلا",
                    "id": "..."
                },
                {
                    "ar": "ىلإ",
                    "id": "..."
                },
                {
                    "ar": "رطضال",
                    "id": "..."
                },
                {
                    "ar": "انكر",
                    "id": "..."
                },
                {
                    "ar": "ناك",
                    "id": "..."
                },
                {
                    "ar": "ولف",
                    "id": "..."
                },
                {
                    "ar": "هل",
                    "id": "..."
                },
                {
                    "ar": "سولجلا",
                    "id": "..."
                },
                {
                    "ar": "كرتب",
                    "id": "..."
                },
                {
                    "ar": "هكرت",
                    "id": "..."
                },
                {
                    "ar": "يذلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".)وهسلا",
                    "id": "..."
                },
                {
                    "ar": "دوجسب",
                    "id": "..."
                },
                {
                    "ar": "هكرت",
                    "id": "..."
                },
                {
                    "ar": "ربجني",
                    "id": "..."
                },
                {
                    "ar": "ملو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "۲",
                    "id": "..."
                },
                {
                    "ar": "-",
                    "id": "..."
                },
                {
                    "ar": ":لوألا",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "بقع",
                    "id": "..."
                },
                {
                    "ar": "ىبنلا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "اا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "۳",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "لوألا",
                    "id": "..."
                },
                {
                    "ar": "دهشتلل",
                    "id": "..."
                },
                {
                    "ar": "سولحلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "هيف",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "ةنسو",
                    "id": "..."
                },
                {
                    "ar": ".سولجلا",
                    "id": "..."
                },
                {
                    "ar": "ةنس",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "ةلقتسم",
                    "id": "..."
                },
                {
                    "ar": "ننس",
                    "id": "..."
                },
                {
                    "ar": "ثالث",
                    "id": "..."
                },
                {
                    "ar": "ًاذإ",
                    "id": "..."
                },
                {
                    "ar": "يهف",
                    "id": "..."
                },
                {
                    "ar": "يأ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةنس",
                    "id": "..."
                },
                {
                    "ar": "مث",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "ديم",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "‏٤",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "-",
                    "id": "..."
                },
                {
                    "ar": "دعب",
                    "id": "..."
                },
                {
                    "ar": "يب",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يذلا",
                    "id": "..."
                },
                {
                    "ar": "ريخألا",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "نكر",
                    "id": "..."
                },
                {
                    "ar": "وه",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "نكرو",
                    "id": "..."
                },
                {
                    "ar": "»ةريخألا",
                    "id": "..."
                },
                {
                    "ar": "ةسلجلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "نكر",
                    "id": "..."
                },
                {
                    "ar": "ءادأ",
                    "id": "..."
                },
                {
                    "ar": "دنع",
                    "id": "..."
                },
                {
                    "ar": "نسي",
                    "id": "..."
                },
                {
                    "ar": "يأ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "كعم",
                    "id": "..."
                },
                {
                    "ar": "ٌرمامل",
                    "id": "..."
                },
                {
                    "ar": "»",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "ىبنلا",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "»",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "ىبنلا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةغيصلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "يَ",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ةالصلل",
                    "id": "..."
                },
                {
                    "ar": "ةلماكلا۰",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءرجفلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ةيناثلا",
                    "id": "..."
                },
                {
                    "ar": "ةعكرلا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "لادتعالا",
                    "id": "..."
                },
                {
                    "ar": "دنع",
                    "id": "..."
                },
                {
                    "ar": "تونقلا",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                },
                {
                    "ar": "ه",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يفو",
                    "id": "..."
                },
                {
                    "ar": "»ناضمر",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "يناثلا",
                    "id": "..."
                },
                {
                    "ar": "فصنلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "رتولا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "ةعكر",
                    "id": "..."
                },
                {
                    "ar": "رخا",
                    "id": "..."
                },
                {
                    "ar": "يفو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":ةلزانلا",
                    "id": "..."
                },
                {
                    "ar": "تونقل",
                    "id": "..."
                },
                {
                    "ar": "ةبسنلاب",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "يأ",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "ةريخألا",
                    "id": "..."
                },
                {
                    "ar": "ةعكرلا",
                    "id": "..."
                },
                {
                    "ar": "لادتعا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "Ea",
                    "id": "..."
                }
            ]
        ]
    }
],
    147: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "لاراَم«",
                    "id": "..."
                },
                {
                    "ar": ":لاق",
                    "id": "..."
                },
                {
                    "ar": "هنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "سنأ",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "»هريغو",
                    "id": "..."
                },
                {
                    "ar": "دمحأ",
                    "id": "..."
                },
                {
                    "ar": "ىور",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".»اينّذلا",
                    "id": "..."
                },
                {
                    "ar": "َقَراف",
                    "id": "..."
                },
                {
                    "ar": "ىح",
                    "id": "..."
                },
                {
                    "ar": "حْبْصلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "تنقي",
                    "id": "..."
                },
                {
                    "ar": "ةَ",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوُسَر",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "‏؛)٩٩(",
                    "id": "..."
                },
                {
                    "ar": "يراخبلا",
                    "id": "..."
                },
                {
                    "ar": "یورو2",
                    "id": "..."
                },
                {
                    "ar": "(۷۷)›",
                    "id": "..."
                },
                {
                    "ar": "`",
                    "id": "..."
                },
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "وغ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "هللا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":لاق",
                    "id": "..."
                },
                {
                    "ar": "؟ّحّبْصلا",
                    "id": "..."
                },
                {
                    "ar": "لب",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "تنقأ",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "لئس",
                    "id": "..."
                },
                {
                    "ar": "دقو",
                    "id": "..."
                },
                {
                    "ar": "»هنع",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "أ",
                    "id": "..."
                },
                {
                    "ar": ":هل",
                    "id": "..."
                },
                {
                    "ar": "ليقف",
                    "id": "..."
                },
                {
                    "ar": "معن",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ًاريسي",
                    "id": "..."
                },
                {
                    "ar": "عوكرلا",
                    "id": "..."
                },
                {
                    "ar": "دعب",
                    "id": "..."
                },
                {
                    "ar": ":لاق",
                    "id": "..."
                },
                {
                    "ar": "؟",
                    "id": "..."
                },
                {
                    "ar": "عوكرلا",
                    "id": "..."
                },
                {
                    "ar": "لب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "[",
                    "id": "..."
                },
                {
                    "ar": "]رتولا",
                    "id": "..."
                },
                {
                    "ar": "تونق",
                    "id": "..."
                },
                {
                    "ar": "يفو",
                    "id": "..."
                },
                {
                    "ar": "حبصلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "يقهيبلا",
                    "id": "..."
                },
                {
                    "ar": "رظني",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ىأبهوعديو",
                    "id": "..."
                },
                {
                    "ar": "ىلاعت",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ىلصملا",
                    "id": "..."
                },
                {
                    "ar": "ينثي",
                    "id": "..."
                },
                {
                    "ar": "نأب",
                    "id": "..."
                },
                {
                    "ar": "تونقلا",
                    "id": "..."
                },
                {
                    "ar": "ةنس",
                    "id": "..."
                },
                {
                    "ar": "ىدؤتو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "اهئادأ",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "لامكلا",
                    "id": "..."
                },
                {
                    "ar": "نكلو",
                    "id": "..."
                },
                {
                    "ar": ".»روفغ",
                    "id": "..."
                },
                {
                    "ar": "اي",
                    "id": "..."
                },
                {
                    "ar": "يل",
                    "id": "..."
                },
                {
                    "ar": "رفغا",
                    "id": "..."
                },
                {
                    "ar": "مهللا«",
                    "id": "..."
                },
                {
                    "ar": ":لوقي",
                    "id": "..."
                },
                {
                    "ar": "نأك",
                    "id": "..."
                },
                {
                    "ar": "ءءاش",
                    "id": "..."
                },
                {
                    "ar": "ظفل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".كلذ",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوسر",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "دراولا",
                    "id": "..."
                },
                {
                    "ar": "ءاعدلا",
                    "id": "..."
                },
                {
                    "ar": "مازتلاب",
                    "id": "..."
                },
                {
                    "ar": "نوكي",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":لاق",
                    "id": "..."
                },
                {
                    "ar": "امهنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "يلع",
                    "id": "..."
                },
                {
                    "ar": "نب",
                    "id": "..."
                },
                {
                    "ar": "نسحلا",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "‏(١٠٠٤٠)",
                    "id": "..."
                },
                {
                    "ar": "دواد",
                    "id": "..."
                },
                {
                    "ar": "وبآ",
                    "id": "..."
                },
                {
                    "ar": "ىور",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ْنَميف",
                    "id": "..."
                },
                {
                    "ar": "ينها",
                    "id": "..."
                },
                {
                    "ar": "مهلا",
                    "id": "..."
                },
                {
                    "ar": ":رتولا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "نهلوقأ",
                    "id": "..."
                },
                {
                    "ar": "تاملك",
                    "id": "..."
                },
                {
                    "ar": "لق",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوسر",
                    "id": "..."
                },
                {
                    "ar": "ينمأع",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يوو",
                    "id": "..."
                },
                {
                    "ar": "»تيفاع",
                    "id": "..."
                },
                {
                    "ar": "ْنَميف",
                    "id": "..."
                },
                {
                    "ar": "ينفاَعو",
                    "id": "..."
                },
                {
                    "ar": "تيدET",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "إو",
                    "id": "..."
                },
                {
                    "ar": ".ٌكْيَلَع",
                    "id": "..."
                },
                {
                    "ar": "ىضقي",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": "ىضقت",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "كنإ",
                    "id": "..."
                },
                {
                    "ar": "نیش",
                    "id": "..."
                },
                {
                    "ar": "اف",
                    "id": "..."
                },
                {
                    "ar": "رش",
                    "id": "..."
                },
                {
                    "ar": "ينقو",
                    "id": "..."
                },
                {
                    "ar": "»تيطغأ",
                    "id": "..."
                },
                {
                    "ar": "امي",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نسيو",
                    "id": "..."
                },
                {
                    "ar": "»",
                    "id": "..."
                },
                {
                    "ar": "تیلاًعتو",
                    "id": "..."
                },
                {
                    "ar": "انبر",
                    "id": "..."
                },
                {
                    "ar": "تقرا",
                    "id": "..."
                },
                {
                    "ar": "›َتْيَداَع",
                    "id": "..."
                },
                {
                    "ar": "ْنَم",
                    "id": "..."
                },
                {
                    "ar": "عي",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": "تيلو",
                    "id": "..."
                },
                {
                    "ar": "ْنَم",
                    "id": "..."
                },
                {
                    "ar": "ل",
                    "id": "..."
                },
                {
                    "ar": "ل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".عمجلا",
                    "id": "..."
                },
                {
                    "ar": "ةغيصب",
                    "id": "..."
                },
                {
                    "ar": "هب",
                    "id": "..."
                },
                {
                    "ar": "يتأي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "مامالل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "فرعن",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": ":لاقو",
                    "id": "..."
                },
                {
                    "ar": ".نسح",
                    "id": "..."
                },
                {
                    "ar": "ثيدح",
                    "id": "..."
                },
                {
                    "ar": "اذه",
                    "id": "..."
                },
                {
                    "ar": "‏(٤٦٤):",
                    "id": "..."
                },
                {
                    "ar": "يذمرتلا",
                    "id": "..."
                },
                {
                    "ar": "لاق",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".هنم",
                    "id": "..."
                },
                {
                    "ar": "نسحأ",
                    "id": "..."
                },
                {
                    "ar": "ًائيش",
                    "id": "..."
                },
                {
                    "ar": "رتولا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "تونقلا",
                    "id": "..."
                },
                {
                    "ar": "ىف",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "ىبنلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ")",
                    "id": "..."
                },
                {
                    "ar": "دواد",
                    "id": "..."
                },
                {
                    "ar": "يبأ",
                    "id": "..."
                },
                {
                    "ar": "دنعو۱١٤۸(",
                    "id": "..."
                },
                {
                    "ar": "مهم",
                    "id": "..."
                },
                {
                    "ar": "هنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "بعك",
                    "id": "..."
                },
                {
                    "ar": "أ",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "ريخألا",
                    "id": "..."
                },
                {
                    "ar": "فصنلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "تنقي",
                    "id": "..."
                },
                {
                    "ar": "ناكو",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                },
                {
                    "ar": "ناضمر",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ينعي",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ناضمر",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "هنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "ةريره",
                    "id": "..."
                },
                {
                    "ar": "يبأ",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "رع",
                    "id": "..."
                },
                {
                    "ar": "مكاحلا",
                    "id": "..."
                },
                {
                    "ar": "یورو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "وعدي",
                    "id": "..."
                },
                {
                    "ar": "هيدي",
                    "id": "..."
                },
                {
                    "ar": "َحْفَر",
                    "id": "..."
                },
                {
                    "ar": "ءةيناثلا",
                    "id": "..."
                },
                {
                    "ar": "ةعكرلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "الص",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "عوكرل",
                    "id": "..."
                },
                {
                    "ar": "م",
                    "id": "..."
                },
                {
                    "ar": "ُهَسأَر",
                    "id": "..."
                },
                {
                    "ar": "عفر",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ينِدها",
                    "id": "..."
                },
                {
                    "ar": "َّهللا«",
                    "id": "..."
                },
                {
                    "ar": ":ءاعدلا",
                    "id": "..."
                },
                {
                    "ar": "اذهب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ا",
                    "id": "..."
                }
            ]
        ]
    }
],
    148: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "›»تيضقام",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "دمحلا",
                    "id": "..."
                },
                {
                    "ar": "كلف",
                    "id": "..."
                },
                {
                    "ar": ":هيف",
                    "id": "..."
                },
                {
                    "ar": "دازي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ءاملعلا",
                    "id": "..."
                },
                {
                    "ar": "بحتساو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "دمحم",
                    "id": "..."
                },
                {
                    "ar": "انديس",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "ىلصو",
                    "id": "..."
                },
                {
                    "ar": "»كيلإ",
                    "id": "..."
                },
                {
                    "ar": "بوتنو",
                    "id": "..."
                },
                {
                    "ar": "انبر",
                    "id": "..."
                },
                {
                    "ar": "مهللا",
                    "id": "..."
                },
                {
                    "ar": "كرفغتسن",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "ملسو",
                    "id": "..."
                },
                {
                    "ar": "هبحصو",
                    "id": "..."
                },
                {
                    "ar": "هلا",
                    "id": "..."
                },
                {
                    "ar": "ىلعو",
                    "id": "..."
                },
                {
                    "ar": "ىمألا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ةحيحصلا",
                    "id": "..."
                },
                {
                    "ar": "رابخألل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ركذلاو",
                    "id": "..."
                },
                {
                    "ar": "ءاعدلا",
                    "id": "..."
                },
                {
                    "ar": "دعب",
                    "id": "..."
                },
                {
                    "ar": "ةَ",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".])١١۷",
                    "id": "..."
                },
                {
                    "ar": "-١۱",
                    "id": "..."
                },
                {
                    "ar": "(١/١٦٦",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ينغم[",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "جاتحملا‎",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةهجل",
                    "id": "..."
                },
                {
                    "ar": "امهنطب",
                    "id": "..."
                },
                {
                    "ar": "لعجيو",
                    "id": "..."
                },
                {
                    "ar": "»تونقلا",
                    "id": "..."
                },
                {
                    "ar": "اذه",
                    "id": "..."
                },
                {
                    "ar": "ءانثأ",
                    "id": "..."
                },
                {
                    "ar": "هيدي",
                    "id": "..."
                },
                {
                    "ar": "عفري",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ْنسيو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".ءامسلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "©",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "تاشیهلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يلصملا",
                    "id": "..."
                },
                {
                    "ar": "اهكرت",
                    "id": "..."
                },
                {
                    "ar": "نإ",
                    "id": "..."
                },
                {
                    "ar": "يتلا",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "ننس",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "يه",
                    "id": "..."
                },
                {
                    "ar": "تائيهلا",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "انركذ",
                    "id": "..."
                },
                {
                    "ar": "دقو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "صخلتت",
                    "id": "..."
                },
                {
                    "ar": "تائيهلاو",
                    "id": "..."
                },
                {
                    "ar": ".ضاعبألا",
                    "id": "..."
                },
                {
                    "ar": "فالخب",
                    "id": "..."
                },
                {
                    "ar": "ءوهسلا",
                    "id": "..."
                },
                {
                    "ar": "دوجسب",
                    "id": "..."
                },
                {
                    "ar": "اهربج",
                    "id": "..."
                },
                {
                    "ar": "نسي",
                    "id": "..."
                },
                {
                    "ar": "مل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "|-",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "هنم",
                    "id": "..."
                },
                {
                    "ar": "عفرلاو",
                    "id": "..."
                },
                {
                    "ar": "را",
                    "id": "..."
                },
                {
                    "ar": "دنعو",
                    "id": "..."
                },
                {
                    "ar": "مارحإلا",
                    "id": "..."
                },
                {
                    "ar": "ةريبكت",
                    "id": "..."
                },
                {
                    "ar": "دنع",
                    "id": "..."
                },
                {
                    "ar": "نيديلا",
                    "id": "..."
                },
                {
                    "ar": "عفر",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "بقتسم",
                    "id": "..."
                },
                {
                    "ar": "هيفک",
                    "id": "..."
                },
                {
                    "ar": "عفر",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": ":ةنسلا",
                    "id": "..."
                },
                {
                    "ar": "هذه",
                    "id": "..."
                },
                {
                    "ar": "ءادأ",
                    "id": "..."
                },
                {
                    "ar": "ةيفيكو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءةلبقلا",
                    "id": "..."
                },
                {
                    "ar": "امهب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "هاقك",
                    "id": "..."
                },
                {
                    "ar": "نوكت",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "»نينذألا",
                    "id": "..."
                },
                {
                    "ar": "يتمحشل",
                    "id": "..."
                },
                {
                    "ar": "هيماهباب",
                    "id": "..."
                },
                {
                    "ar": "ااف",
                    "id": "..."
                },
                {
                    "ar": "»عباصألا",
                    "id": "..."
                },
                {
                    "ar": "يتروشنم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "٥(",
                    "id": "..."
                },
                {
                    "ar": "يراخبلا",
                    "id": "..."
                },
                {
                    "ar": "یور۷۰)",
                    "id": "..."
                },
                {
                    "ar": "؛e(",
                    "id": "..."
                },
                {
                    "ar": "‏۳۹۰)»",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "رمع",
                    "id": "..."
                },
                {
                    "ar": "نبا",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "تيأر",
                    "id": "..."
                },
                {
                    "ar": ":لاق",
                    "id": "..."
                },
                {
                    "ar": "امهنع4#",
                    "id": "..."
                },
                {
                    "ar": "عفر",
                    "id": "..."
                },
                {
                    "ar": "قالصلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ريكا",
                    "id": "..."
                },
                {
                    "ar": "فا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "نيج",
                    "id": "..."
                },
                {
                    "ar": "هيدي",
                    "id": "..."
                },
                {
                    "ar": "م",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ll",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "اذإو",
                    "id": "..."
                },
                {
                    "ar": "هلم",
                    "id": "..."
                },
                {
                    "ar": "َّلَعف",
                    "id": "..."
                },
                {
                    "ar": "عوكرلل",
                    "id": "..."
                },
                {
                    "ar": "ربك",
                    "id": "..."
                },
                {
                    "ar": "ادإو",
                    "id": "..."
                },
                {
                    "ar": "هيب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "لعفي",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": "ءٌدمحلا",
                    "id": "..."
                },
                {
                    "ar": "لَو",
                    "id": "..."
                },
                {
                    "ar": "ابر",
                    "id": "..."
                },
                {
                    "ar": ":لاقو",
                    "id": "..."
                },
                {
                    "ar": "هلثم",
                    "id": "..."
                },
                {
                    "ar": "لعف",
                    "id": "..."
                },
                {
                    "ar": "»هدمح",
                    "id": "..."
                },
                {
                    "ar": "نمل",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "عمس",
                    "id": "..."
                },
                {
                    "ar": ":لات",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".دوجسلا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "هسأر",
                    "id": "..."
                },
                {
                    "ar": "عفري",
                    "id": "..."
                },
                {
                    "ar": "نيح",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": "ات",
                    "id": "..."
                },
                {
                    "ar": "نيح",
                    "id": "..."
                },
                {
                    "ar": "كلد",
                    "id": "..."
                }
            ]
        ]
    }
],
    149: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "۲",
                    "id": "..."
                },
                {
                    "ar": "-",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "كلذو",
                    "id": "..."
                },
                {
                    "ar": "ء»ىرسيلا",
                    "id": "..."
                },
                {
                    "ar": "هدي",
                    "id": "..."
                },
                {
                    "ar": "رهظ",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ىنميلا",
                    "id": "..."
                },
                {
                    "ar": "هدي",
                    "id": "..."
                },
                {
                    "ar": "عضو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":فوقولا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "فك",
                    "id": "..."
                },
                {
                    "ar": "رهظ",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ىنميلا",
                    "id": "..."
                },
                {
                    "ar": "هدي",
                    "id": "..."
                },
                {
                    "ar": "عضي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "ةيفيكو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "»ىرسيلا",
                    "id": "..."
                },
                {
                    "ar": "غسرو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "هردص",
                    "id": "..."
                },
                {
                    "ar": "تحت",
                    "id": "..."
                },
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "لحم",
                    "id": "..."
                },
                {
                    "ar": "نوكيو",
                    "id": "..."
                },
                {
                    "ar": "»ىنميلا",
                    "id": "..."
                },
                {
                    "ar": "هدي",
                    "id": "..."
                },
                {
                    "ar": "عباصأب",
                    "id": "..."
                },
                {
                    "ar": "ىرسيلا",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ضبقيو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".هترس",
                    "id": "..."
                },
                {
                    "ar": "قوفو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "٤)»",
                    "id": "..."
                },
                {
                    "ar": "ملسم",
                    "id": "..."
                },
                {
                    "ar": "ربخل۰",
                    "id": "..."
                },
                {
                    "ar": "یأر",
                    "id": "..."
                },
                {
                    "ar": "هنآ",
                    "id": "..."
                },
                {
                    "ar": ":هنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "رجح",
                    "id": "..."
                },
                {
                    "ar": "نب",
                    "id": "..."
                },
                {
                    "ar": "لئاو",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "‏(١",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "هدي",
                    "id": "..."
                },
                {
                    "ar": "عضو",
                    "id": "..."
                },
                {
                    "ar": "مث",
                    "id": "..."
                },
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": ".ٍةالّصلا",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "لحد",
                    "id": "..."
                },
                {
                    "ar": "َنيِج",
                    "id": "..."
                },
                {
                    "ar": "هيدي",
                    "id": "..."
                },
                {
                    "ar": "عفر",
                    "id": "..."
                },
                {
                    "ar": "ب",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "ىنميلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":ىرسلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "(",
                    "id": "..."
                },
                {
                    "ar": "يئاسنلا",
                    "id": "..."
                },
                {
                    "ar": "دنعو۱۲۹/۲):",
                    "id": "..."
                },
                {
                    "ar": "ىرسُْيلا",
                    "id": "..."
                },
                {
                    "ar": "همك",
                    "id": "..."
                },
                {
                    "ar": "ىلَع",
                    "id": "..."
                },
                {
                    "ar": "ىنميلا",
                    "id": "..."
                },
                {
                    "ar": "ُهَدْي",
                    "id": "..."
                },
                {
                    "ar": "عضو",
                    "id": "..."
                },
                {
                    "ar": "مث",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".دعاسلاو",
                    "id": "..."
                },
                {
                    "ar": "غسرلاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "۳",
                    "id": "..."
                },
                {
                    "ar": "-",
                    "id": "..."
                },
                {
                    "ar": ":دوجسلا",
                    "id": "..."
                },
                {
                    "ar": "عضوم",
                    "id": "..."
                },
                {
                    "ar": "ىلإ",
                    "id": "..."
                },
                {
                    "ar": "رظنلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ىلإوأ",
                    "id": "..."
                },
                {
                    "ar": "ىلعألا",
                    "id": "..."
                },
                {
                    "ar": "ىلإ",
                    "id": "..."
                },
                {
                    "ar": "رظني",
                    "id": "..."
                },
                {
                    "ar": "نأوآ",
                    "id": "..."
                },
                {
                    "ar": "»هلوح",
                    "id": "..."
                },
                {
                    "ar": "اميف",
                    "id": "..."
                },
                {
                    "ar": "هرظن",
                    "id": "..."
                },
                {
                    "ar": "عزوتي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "هركيف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ىلإ",
                    "id": "..."
                },
                {
                    "ar": "مئادلا",
                    "id": "..."
                },
                {
                    "ar": "هرظن",
                    "id": "..."
                },
                {
                    "ar": "لعجي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ْنسُي",
                    "id": "..."
                },
                {
                    "ar": "لب",
                    "id": "..."
                },
                {
                    "ar": "؛ةبعكلا",
                    "id": "..."
                },
                {
                    "ar": "ناك",
                    "id": "..."
                },
                {
                    "ar": "ولو",
                    "id": "..."
                },
                {
                    "ar": "ىتح",
                    "id": "..."
                },
                {
                    "ar": "همامأ",
                    "id": "..."
                },
                {
                    "ar": "ءيش",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "اهب",
                    "id": "..."
                },
                {
                    "ar": "ريشي",
                    "id": "..."
                },
                {
                    "ar": "يتلا",
                    "id": "..."
                },
                {
                    "ar": "هتبابس",
                    "id": "..."
                },
                {
                    "ar": "ىلإ",
                    "id": "..."
                },
                {
                    "ar": "هرظن",
                    "id": "..."
                },
                {
                    "ar": "لعجيلف",
                    "id": "..."
                },
                {
                    "ar": "»دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "دنع",
                    "id": "..."
                },
                {
                    "ar": "الإ",
                    "id": "..."
                },
                {
                    "ar": "»هدوجس",
                    "id": "..."
                },
                {
                    "ar": "عضوم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".دهشتلا",
                    "id": "..."
                },
                {
                    "ar": "دنع",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "يم",
                    "id": "..."
                },
                {
                    "ar": "يبنلا",
                    "id": "..."
                },
                {
                    "ar": "لعف",
                    "id": "..."
                },
                {
                    "ar": "عابتا",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "ليلد",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءارقب",
                    "id": "..."
                },
                {
                    "ar": "ريبكتلا",
                    "id": "..."
                },
                {
                    "ar": "دعب",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "حاتتفا",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                },
                {
                    "ar": "؛",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ")»",
                    "id": "..."
                },
                {
                    "ar": "ملسم",
                    "id": "..."
                },
                {
                    "ar": "هاور",
                    "id": "..."
                },
                {
                    "ar": "ام",
                    "id": "..."
                },
                {
                    "ar": "»هظفلو۷۷",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "هنع",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "يضر",
                    "id": "..."
                },
                {
                    "ar": "يلع",
                    "id": "..."
                },
                {
                    "ar": "نع",
                    "id": "..."
                },
                {
                    "ar": "‏(١",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يذل",
                    "id": "..."
                },
                {
                    "ar": "يهْجَو",
                    "id": "..."
                },
                {
                    "ar": "ٌتُْهُجَو«",
                    "id": "..."
                },
                {
                    "ar": ":لاق",
                    "id": "..."
                },
                {
                    "ar": "ةالصلا",
                    "id": "..."
                },
                {
                    "ar": "ىلإ",
                    "id": "..."
                },
                {
                    "ar": "ماق",
                    "id": "..."
                },
                {
                    "ar": "اذإ",
                    "id": "..."
                },
                {
                    "ar": "ناك",
                    "id": "..."
                },
                {
                    "ar": "هنأ",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "ةي",
                    "id": "..."
                },
                {
                    "ar": "هللا",
                    "id": "..."
                },
                {
                    "ar": "لوسر",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يكشسنو",
                    "id": "..."
                },
                {
                    "ar": "يتالص",
                    "id": "..."
                },
                {
                    "ar": "نإ",
                    "id": "..."
                },
                {
                    "ar": "ءًّنيِكرُُملا",
                    "id": "..."
                },
                {
                    "ar": "ْنِم",
                    "id": "..."
                },
                {
                    "ar": "انأ",
                    "id": "..."
                },
                {
                    "ar": "اَمَو",
                    "id": "..."
                },
                {
                    "ar": "ًافينَح",
                    "id": "..."
                },
                {
                    "ar": "ضألاو",
                    "id": "..."
                },
                {
                    "ar": "تاومسلا",
                    "id": "..."
                },
                {
                    "ar": "رصف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "َنِم",
                    "id": "..."
                },
                {
                    "ar": "اأو",
                    "id": "..."
                },
                {
                    "ar": "ُتْرِمُأ",
                    "id": "..."
                },
                {
                    "ar": "كلذبَو",
                    "id": "..."
                },
                {
                    "ar": "هَل",
                    "id": "..."
                },
                {
                    "ar": "كيرش",
                    "id": "..."
                },
                {
                    "ar": "ال",
                    "id": "..."
                },
                {
                    "ar": "»نيمّلاعلا",
                    "id": "..."
                },
                {
                    "ar": "ّبَر",
                    "id": "..."
                },
                {
                    "ar": "هلل",
                    "id": "..."
                },
                {
                    "ar": "يتاَمَمَو",
                    "id": "..."
                },
                {
                    "ar": "ّيايحَمَو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".»نيملسملا",
                    "id": "..."
                }
            ]
        ]
    }
],
    150: [
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "[",
                    "id": "..."
                },
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "يتدابعب",
                    "id": "..."
                },
                {
                    "ar": "تدصق",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "يهجو",
                    "id": "..."
                },
                {
                    "ar": "تهجو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":ًافينح",
                    "id": "..."
                },
                {
                    "ar": ".اهقلخ",
                    "id": "..."
                },
                {
                    "ar": "أدتبا",
                    "id": "..."
                },
                {
                    "ar": ":رطف",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "ها",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "هبا",
                    "id": "..."
                },
                {
                    "ar": "او",
                    "id": "..."
                },
                {
                    "ar": "داغ",
                    "id": "..."
                },
                {
                    "ar": "کس",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "کلا",
                    "id": "..."
                },
                {
                    "ar": "لا",
                    "id": "..."
                },
                {
                    "ar": "اا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "بتابحتسا",
                    "id": "..."
                },
                {
                    "ar": "ناکم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءةلفانلاو",
                    "id": "..."
                },
                {
                    "ar": "ةضورفملا",
                    "id": "..."
                },
                {
                    "ar": "حاتتفا",
                    "id": "..."
                },
                {
                    "ar": "ت",
                    "id": "..."
                },
                {
                    "ar": "هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءأرف",
                    "id": "..."
                },
                {
                    "ar": "بتحتست",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "درفنملل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "اهب",
                    "id": "..."
                },
                {
                    "ar": "ادب",
                    "id": "..."
                },
                {
                    "ar": "ناف",
                    "id": "..."
                },
                {
                    "ar": "د",
                    "id": "..."
                },
                {
                    "ar": "ةحتاملا",
                    "id": "..."
                },
                {
                    "ar": "ةءارقب",
                    "id": "..."
                },
                {
                    "ar": "ادى",
                    "id": "..."
                },
                {
                    "ar": "ال",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ط",
                    "id": "..."
                },
                {
                    "ar": "رشب",
                    "id": "..."
                },
                {
                    "ar": "»مومأملاو",
                    "id": "..."
                },
                {
                    "ar": "ماماللو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةءارق",
                    "id": "..."
                },
                {
                    "ar": "ةينس",
                    "id": "..."
                },
                {
                    "ar": "تتاف",
                    "id": "..."
                },
                {
                    "ar": "ءذوعتلاب",
                    "id": "..."
                },
                {
                    "ar": "وأ",
                    "id": "..."
                },
                {
                    "ar": "_اهنم",
                    "id": "..."
                },
                {
                    "ar": "ءزج",
                    "id": "..."
                },
                {
                    "ar": "ةلمسبلا",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "تملع",
                    "id": "..."
                },
                {
                    "ar": "دقو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ا",
                    "id": "..."
                },
                {
                    "ar": "ناک",
                    "id": "..."
                },
                {
                    "ar": "ولو",
                    "id": "..."
                },
                {
                    "ar": "هيلإ",
                    "id": "..."
                },
                {
                    "ar": "دوعی",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "ىغبني",
                    "id": "..."
                },
                {
                    "ar": "الف",
                    "id": "..."
                },
                {
                    "ar": "»هجوتلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةضيرفلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "یف",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                },
                {
                    "ar": "ءةزانجلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "ص",
                    "id": "..."
                },
                {
                    "ar": "هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءأارق",
                    "id": "..."
                },
                {
                    "ar": "بحتس",
                    "id": "..."
                },
                {
                    "ar": "الو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".تقولا",
                    "id": "..."
                },
                {
                    "ar": "جرخي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "ةءارقب",
                    "id": "..."
                },
                {
                    "ar": "لختشا",
                    "id": "..."
                },
                {
                    "ar": "نإ",
                    "id": "..."
                },
                {
                    "ar": "يشخ",
                    "id": "..."
                },
                {
                    "ar": "ثيحب",
                    "id": "..."
                },
                {
                    "ar": "»اهتقو",
                    "id": "..."
                },
                {
                    "ar": "قاض",
                    "id": "..."
                },
                {
                    "ar": "اذإ",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هجوتلا",
                    "id": "..."
                },
                {
                    "ar": "دعب",
                    "id": "..."
                },
                {
                    "ar": "ةداعتسالا",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                },
                {
                    "ar": "ه",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "ميجرلا",
                    "id": "..."
                },
                {
                    "ar": "ناطيشلا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "هللاب",
                    "id": "..."
                },
                {
                    "ar": "ذوعأ",
                    "id": "..."
                },
                {
                    "ar": ":لوقي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "یهو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةءارق",
                    "id": "..."
                },
                {
                    "ar": "اهب",
                    "id": "..."
                },
                {
                    "ar": "أدبي",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ةذاعتسالا",
                    "id": "..."
                },
                {
                    "ar": "تتاف",
                    "id": "..."
                },
                {
                    "ar": "»ذيعتسي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "لبق",
                    "id": "..."
                },
                {
                    "ar": "ةحتافلا",
                    "id": "..."
                },
                {
                    "ar": "ةءارق",
                    "id": "..."
                },
                {
                    "ar": "ىف",
                    "id": "..."
                },
                {
                    "ar": "عرش",
                    "id": "..."
                },
                {
                    "ar": "اذإف",
                    "id": "..."
                },
                {
                    "ar": "»ةحتافلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".اهيلإ",
                    "id": "..."
                },
                {
                    "ar": "دوعي",
                    "id": "..."
                },
                {
                    "ar": "نأ",
                    "id": "..."
                },
                {
                    "ar": "هركو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ناطْيْشلا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "هُللاب",
                    "id": "..."
                },
                {
                    "ar": "ٌدعَتْساف",
                    "id": "..."
                },
                {
                    "ar": "نآَرَقلا",
                    "id": "..."
                },
                {
                    "ar": "تارق",
                    "id": "..."
                },
                {
                    "ar": "اذ",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "هناحبس",
                    "id": "..."
                },
                {
                    "ar": "هلوقل",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ميجرلا#",
                    "id": "..."
                },
                {
                    "ar": "(٩).",
                    "id": "..."
                },
                {
                    "ar": "ةيآلا",
                    "id": "..."
                },
                {
                    "ar": ":لحنلا",
                    "id": "..."
                },
                {
                    "ar": "ةروس۸",
                    "id": "..."
                },
                {
                    "ar": "‏",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ">",
                    "id": "..."
                },
                {
                    "ar": "-",
                    "id": "..."
                },
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "ةءارقلاب",
                    "id": "..."
                },
                {
                    "ar": "رهجلا",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "يف",
                    "id": "..."
                },
                {
                    "ar": "رارسإلاو",
                    "id": "..."
                },
                {
                    "ar": "هعضوم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":هعضوم",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "ءرجفلا",
                    "id": "..."
                },
                {
                    "ar": "ةالص",
                    "id": "..."
                },
                {
                    "ar": "اتعكر",
                    "id": "..."
                },
                {
                    "ar": ":",
                    "id": "..."
                },
                {
                    "ar": "يه",
                    "id": "..."
                },
                {
                    "ar": "ةءارقلاب",
                    "id": "..."
                },
                {
                    "ar": "رهجلا",
                    "id": "..."
                },
                {
                    "ar": "اهيف",
                    "id": "..."
                },
                {
                    "ar": "نسي",
                    "id": "..."
                },
                {
                    "ar": "يتلا",
                    "id": "..."
                },
                {
                    "ar": "عضاوملاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "›نيديعلاو",
                    "id": "..."
                },
                {
                    "ar": "ءةعمجلا",
                    "id": "..."
                },
                {
                    "ar": "ةالصو",
                    "id": "..."
                },
                {
                    "ar": "»ءاشعلاو",
                    "id": "..."
                },
                {
                    "ar": "برغملا",
                    "id": "..."
                },
                {
                    "ar": "نم",
                    "id": "..."
                },
                {
                    "ar": "نايلوألا",
                    "id": "..."
                },
                {
                    "ar": "ناتعكرلاو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "لك",
                    "id": "..."
                },
                {
                    "ar": "»ناضمر",
                    "id": "..."
                },
                {
                    "ar": "رتوو",
                    "id": "..."
                },
                {
                    "ar": "»",
                    "id": "..."
                },
                {
                    "ar": "حيوارتلاو",
                    "id": "..."
                },
                {
                    "ar": "»ءاقستسالا",
                    "id": "..."
                },
                {
                    "ar": "ةالصو",
                    "id": "..."
                },
                {
                    "ar": "»رمقلا",
                    "id": "..."
                },
                {
                    "ar": "فوسخو",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ".كلذ",
                    "id": "..."
                },
                {
                    "ar": "ادع",
                    "id": "..."
                },
                {
                    "ar": "اميف",
                    "id": "..."
                },
                {
                    "ar": "رارسإلا",
                    "id": "..."
                },
                {
                    "ar": "نسيو",
                    "id": "..."
                },
                {
                    "ar": ".",
                    "id": "..."
                },
                {
                    "ar": "طقف",
                    "id": "..."
                },
                {
                    "ar": "درفنملاو",
                    "id": "..."
                },
                {
                    "ar": "مامإلل",
                    "id": "..."
                },
                {
                    "ar": "ةبسنلاب",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ":اهنم",
                    "id": "..."
                },
                {
                    "ar": "ثيداحأ",
                    "id": "..."
                },
                {
                    "ar": "كلذ",
                    "id": "..."
                },
                {
                    "ar": "ىلع",
                    "id": "..."
                },
                {
                    "ar": "لد",
                    "id": "..."
                }
            ]
        ]
    },
    {
        "type": "paragraph",
        "lines": [
            [
                {
                    "ar": ")",
                    "id": "..."
                },
                {
                    "ar": "۰",
                    "id": "..."
                }
            ]
        ]
    }
]
};
