const pagesData = {
    144: [
        {
            type: 'heading',
            lines: [
                [
                    { ar: 'سُنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: 'السُّنَّةُ:', id: 'سُنَّه اَدَالَهْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'هِيَ', id: 'إِيَا' },
                    { ar: 'مَا', id: 'أَفَا٢ يَڠْ' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْإِنْسَانِ', id: 'مَانُوسِيَا' },
                    { ar: 'فِعْلُهُ', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'غَيْرِ', id: 'بُوكَنْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْحَتْمِ،', id: 'وَاجِبْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يُثَابُ', id: 'دِيبَرِي فَاهَالَا' }
                ],
                [
                    { ar: 'الْمُسْلِمُ', id: 'سَأَوْرَڠْ مُسْلِمْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'فِعْلِهِ', id: 'مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يُعَاقَبُ', id: 'دِيهُوكُومْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهِ.', id: 'مَنِيڠْڮَلْكَنّيَا.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَرْكَانٌ', id: 'رُوكُون٢' },
                    { ar: 'وَشُرُوطٌ', id: 'دَانْ شَرَط٢' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'بُدَّ', id: 'بُولَيْه تِيدَاكْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'فِعْلِهَا', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْإِلْزَامِ', id: 'كَوَاجِبَنْ' }
                ],
                [
                    { ar: 'أَوْ', id: 'أَتَوْ' },
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'كَيْ', id: 'أَڮَرْ' },
                    { ar: 'تَصِحَّ', id: 'سَهْ' },
                    { ar: 'الصَّلَاةُ؛', id: 'صَلَاةْ؛' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'ذَكَرْنَاهَا', id: 'كَامِي تَلَاهْ مَثَبُوتْكَنّيَا' },
                    { ar: 'فِيمَا', id: 'فَدَا أَفَا يَڠْ' },
                    { ar: 'سَبَقَ.', id: 'تَلَاهْ لَالُو.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'سُنَنٌ', id: 'سُنَّه٢' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَڠْ يَڠْ صَلَاةْ' },
                    { ar: 'فِعْلُهَا،', id: 'مڠرجاكنيَا،' },
                    { ar: 'وَلَكِنْ', id: 'دَانْ تَتَافِي' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' }
                ],
                [
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يَزْدَادُ', id: 'بَرْتَامْبَاهْ' },
                    { ar: 'ثَوَابُ', id: 'فَاهَالَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'بِفِعْلِهَا', id: 'دڠَنْ مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'عِقَابَ', id: 'هُوكُومَنْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهَا.', id: 'مَنِيڠْڮَلْكَنّيَا.' },
                    { ar: 'وَهَذِهِ', id: 'دَانْ اِينِي' }
                ],
                [
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'كَثِيرَةٌ،', id: 'بَاڽَاكْ،' },
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'تَنْقَسِمُ', id: 'تَرْبَاڮِي' },
                    { ar: 'فِي', id: 'دَالَمْ' },
                    { ar: 'مَجْمُوعِهَا', id: 'كُومْفُولَنّيَا' },
                    { ar: 'إِلَى :', id: 'كَفَدَا :' },
                    { ar: 'سُنَنٍ', id: 'سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ،' }
                ],
                [
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'أَثْنَائِهَا،', id: 'تڠَهْ-تڠَهْيَا،' },
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'عَقِبَهَا.', id: 'سَتَلَاهْيَا.' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '( أ )', id: '(A)' },
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ:', id: 'صَلَاةْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'تَزِيدُ', id: 'لَبِيهْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'الْأُمُورِ', id: 'فَرْكَارَا٢' },
                    { ar: 'الثَّلَاثَةِ', id: 'يَڠْ تِيقَا' },
                    { ar: 'التَّالِيَةِ:', id: 'بَرِيكُوتْ اِينِي:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الْأَوَّلُ', id: 'فَرْتَامَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْأَذَانُ :', id: 'أَذَانْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'تَعْرِيفُهُ', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'دَلِيلِهِ', id: 'دَلِيلْيَا' },
                    { ar: 'وَشُرُوطِهِ', id: 'دَانْ شَرَط٢يَا' },
                    { ar: 'وَمَا', id: 'دَانْ أَفَا يَڠْ' },
                    { ar: 'يَتَعَلَّقُ', id: 'بَرْكَائِيْتَنْ' },
                    { ar: 'بِذَلِكَ .', id: 'دڠَنْ حَالْ اِيتُو.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الثَّانِي', id: 'كَدُوَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْإِقَامَةُ :', id: 'إِقَامَةْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'تَعْرِيفُهَا', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'شُرُوطِهَا', id: 'شَرَط٢يَا' },
                    { ar: 'وَالْفَرْقُ', id: 'دَانْ فَرْبَيدَاءَنْ' },
                    { ar: 'بَيْنَهَا', id: 'دِي أَنْتَارَايَا' },
                    { ar: 'وَبَيْنَ', id: 'دَانْ دِي أَنْتَارَا' },
                    { ar: 'الْأَذَانِ.', id: 'أَذَانْ.' }
                ]
            ]
        }
    ],
    145: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الثَّالِثُ', id: 'كَتِيقَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'اتِّخَاذُ', id: 'مڠَمْبِيلْ' },
                    { ar: 'سُتْرَةٍ', id: 'سُتْرَةْ' },
                    { ar: 'أَمَامَهُ:', id: 'دِي دَفَانّيَا:' },
                    { ar: 'تَحُولُ', id: 'يَڠْ مڠْهَالَاڠِي' },
                    { ar: 'بَيْنَهُ', id: 'دِي أَنْتَارَايَا' },
                    { ar: 'وَبَيْنَ', id: 'دَانْ دِي أَنْتَارَا' },
                    { ar: 'الْمَارِّينَ،', id: 'أَوْرَڠْ٢ يَڠْ لِيوَاتْ،' },
                    { ar: 'كَجِدَارٍ،', id: 'سَفَرْتِي دِيْنْدِيڠْ،' }
                ],
                [
                    { ar: 'وَعَمُودٍ،', id: 'دَانْ تِيَاڠْ،' },
                    { ar: 'وَعَصاً،', id: 'دَانْ تُوڠْكَتْ،' },
                    { ar: 'أَوْ', id: 'أَتَوْ' },
                    { ar: 'كَأَنْ', id: 'سَأَوْلَاهْ٢' },
                    { ar: 'يَبْسُطَ', id: 'اِيَا مَمْبَنْتَاڠْكَنْ' },
                    { ar: 'أَمَامَهُ', id: 'دِي دَفَانّيَا' },
                    { ar: 'مُصَلَّى', id: 'تَمْفَتْ صَلَاةْ' },
                    { ar: 'كَسَجَّادَةٍ', id: 'سَفَرْتِي سَجَادَةْ' },
                    { ar: 'وَنَحْوِهَا.', id: 'دَانْ سَسَامَانْيَا.' },
                    { ar: 'فَإِنْ', id: 'مَكَا جِيكَا' },
                    { ar: 'لَمْ', id: 'تِيدَاكْ' },
                    { ar: 'يَجِدْ', id: 'اِيَا مَنَمُوكَنْ' }
                ],
                [
                    { ar: 'خَطَّ', id: 'اِيَا مَمْبُوَاتْ ڮَارِيسْ' },
                    { ar: 'خَطّاً.', id: 'سُوَاتُو ڮَارِيسْ.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَتْكَنْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اِمَامْ بُخَارِي' },
                    { ar: '(٤٧٢)؛', id: '(٤٧٢)؛' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ اِمَامْ مُسْلِمْ' },
                    { ar: '(٥٠١)،', id: '(٥٠١)،' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'ابْنِ', id: 'اِبْنُ' },
                    { ar: 'عُمَرَ', id: 'عُمَرْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوڮَا رِضَا' },
                    { ar: 'اللَّهُ', id: 'اَللّٰهْ' }
                ],
                [
                    { ar: 'عَنْهُمَا:', id: 'كَفَدَا كَدُوَايَا:' },
                    { ar: 'أَنَّ', id: 'بَهْوَاسَانّيَا' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللَّهِ', id: 'اَللّٰهْ' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'اَدَالَهْ بَلِيَوْ' },
                    { ar: 'إِذَا', id: 'كَتِيكَا' },
                    { ar: 'خَرَجَ', id: 'كَلُوَرْ' },
                    { ar: 'يَوْمَ', id: 'فَدَا هَارِي' },
                    { ar: 'العِيدِ', id: 'عِيْدْ' },
                    { ar: 'أَمَرَ', id: 'اِيَا مَمَرِينْتَاهْكَنْ' },
                    { ar: 'بِالْحَرْبَةِ،', id: 'دڠَنْ تُومْبَاكْ،' },
                    { ar: 'فَتُوضَعُ', id: 'مَكَا دِيلَتَاكّكَنْ' }
                ],
                [
                    { ar: 'بَيْنَ', id: 'دِي أَنْتَارَا' },
                    { ar: 'يَدَيْهِ،', id: 'دِي دَفَانّيَا،' },
                    { ar: 'فَيُصَلِّي', id: 'مَكَا بَلِيَوْ صَلَاةْ' },
                    { ar: 'إِلَيها', id: 'مڠْهَادَفْيَا' },
                    { ar: 'وَالنَّاسُ', id: 'دَانْ مَأْمُومْ' },
                    { ar: 'وَرَاءَهُ،', id: 'دِي بَلَاكَاڠْيَا،' },
                    { ar: 'وَكَانَ', id: 'دَانْ اَدَالَهْ بَلِيَوْ' },
                    { ar: 'يَفْعَلُ', id: 'مڠرجاكنيَا' },
                    { ar: 'ذَلِكَ', id: 'هَالْ اِيتُو' },
                    { ar: 'فِي', id: 'دَالَمْ' },
                    { ar: 'السَّفَرِ.', id: 'بَفَرْڮِيَانْ.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[الْحَرْبَةُ:', id: '[تُومْبَاكْ:' },
                    { ar: 'رُمْحٌ', id: 'تُومْبَاكْ' },
                    { ar: 'قَصِيرٌ', id: 'يَڠْ فَيْنْدَيْكْ' },
                    { ar: 'عَرِيضُ', id: 'يَڠْ لَيْبَارْ' },
                    { ar: 'النَّصْلِ.', id: 'مَاتَانْيَا.' },
                    { ar: 'بَيْنَ', id: 'دِي أَنْتَارَا' },
                    { ar: 'يَدَيْهِ:', id: 'كَدُوَا تَڠَانّيَا:' },
                    { ar: 'قُدَّامَهُ].', id: 'دِي دَفَانّيَا].' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالْأَفْضَلُ', id: 'دَانْ يَڠْ لَبِيهْ اُوتَامَا' },
                    { ar: 'أَنْ', id: 'بَهْوَا' },
                    { ar: 'تَكُونَ', id: 'اَدَ' },
                    { ar: 'السُّتْرَةُ', id: 'سُتْرَةْ' },
                    { ar: 'قَرِيبَةً', id: 'دَكَتْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'مَوْضِعِ', id: 'تَمْفَتْ' },
                    { ar: 'سُجُودِهِ،', id: 'سُجُودْيَا،' },
                    { ar: 'فَقَدْ', id: 'مَكَا سُوڠْڮُوه' },
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَتْكَنْ' }
                ],
                [
                    { ar: 'الْبُخَارِيُّ', id: 'اِمَامْ بُخَارِي' },
                    { ar: '(٤٧٤)؛', id: '(٤٧٤)؛' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ اِمَامْ مُسْلِمْ' },
                    { ar: '(٥٠٨)،', id: '(٥٠٨)،' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'سَهْلِ', id: 'سَهْلْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'سَعْدٍ', id: 'سَعْدْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوڮَا رِضَا' },
                    { ar: 'اللَّهُ', id: 'اَللّٰهْ' },
                    { ar: 'عَنْهُ', id: 'كَفَدَانْيَا' }
                ],
                [
                    { ar: 'قَالَ:', id: 'اِيَا بَرْكَاتَا:' },
                    { ar: 'كَانَ', id: 'اَدَالَهْ' },
                    { ar: 'بَيْنَ', id: 'دِي أَنْتَارَا' },
                    { ar: 'مُصَلَّى', id: 'تَمْفَتْ صَلَاةْ' },
                    { ar: 'رَسُولِ', id: 'رَسُولْ' },
                    { ar: 'اللَهِ', id: 'اَللّٰهْ' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'وَبَيْنَ', id: 'دَانْ دِي أَنْتَارَا' },
                    { ar: 'الْجِدَارِ', id: 'دِيْنْدِيڠْ' },
                    { ar: 'مَمَرُّ', id: 'تَمْفَتْ لِيوَاتْ' },
                    { ar: 'الشَّاةِ.', id: 'كَامْبِيڠْ.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[مُصَلَّى:', id: '[تَمْفَتْ صَلَاةْ:' },
                    { ar: 'مَوْضِعُ', id: 'تَمْفَتْ' },
                    { ar: 'السُّجُودِ.', id: 'سُجُودْ.' },
                    { ar: 'مَمَرُّ', id: 'تَمْفَتْ لِيوَاتْ' },
                    { ar: 'الشَّاةِ:', id: 'كَامْبِيڠْ:' },
                    { ar: 'سَعَةُ', id: 'كَلُوَاسَانْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'تَمُرُّ', id: 'بِيْسَا لِيوَاتْ' },
                    { ar: 'مِنْهُ', id: 'دَارِيْنْيَا' },
                    { ar: 'الشَّاةُ].', id: 'كَامْبِيڠْ].' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '(ب)', id: '(ب)' },
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'أَثْنَاءَ', id: 'دِي تڠَهْ٢' },
                    { ar: 'الصَّلَاةِ:', id: 'صَلَاةْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'تَنْقَسِمُ', id: 'تَرْبَاڮِي' },
                    { ar: 'إِلَى', id: 'كَفَدَا' },
                    { ar: 'قِسْمَيْنِ:', id: 'دُوَا بَاڮِيَانْ:' },
                    { ar: 'أَبْعَاضٍ،', id: 'أَبْعَاضْ،' },
                    { ar: 'وَهَيْئَاتٍ.', id: 'دَانْ هَيْئَاتْ.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '(فَالْأَبْعَاضُ)', id: 'مَكَا أَبْعَاضْ اِيْتُو' },
                    { ar: 'كُلُّ', id: 'سَتِيَافْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'يُجْبَرُ', id: 'دِيتَمْبَلْ' },
                    { ar: 'تَرْكُهُ', id: 'مَنِيڠْڮَلْكَنّيَا' },
                    { ar: 'بِسُجُودِ', id: 'دڠَنْ سُجُودْ' },
                    { ar: 'السَّهْوِ', id: 'سَهْوِي' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'آخِرِ', id: 'أَخِيرْ' },
                    { ar: 'الصَّلَاةِ.', id: 'صَلَاةْ.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '(وَالْهَيْئَاتُ)', id: 'دَانْ هَيْئَاتْ اِيْتُو' },
                    { ar: 'كُلُّ', id: 'سَتِيَافْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يُجْبَرُ', id: 'دِيتَمْبَلْ' },
                    { ar: 'تَرْكُهُ', id: 'مَنِيڠْڮَلْكَنّيَا' },
                    { ar: 'بِسُجُودِ', id: 'دڠَنْ سُجُودْ' },
                    { ar: 'السَّهْوِ.', id: 'سَهْوِي.' },
                    { ar: 'وَسَنَشْرَحُ', id: 'دَانْ كَامِي أَكَنْ مَنْجَلَاسْكَنْ' },
                    { ar: 'سُجُودَ', id: 'سُجُودْ' },
                    { ar: 'السَّهْوِ', id: 'سَهْوِي' }
                ],
                [
                    { ar: 'وَمَا', id: 'دَانْ أَفَا يَڠْ' },
                    { ar: 'يَتَعَلَّقُ', id: 'بَرْكَائِيْتَنْ' },
                    { ar: 'بِهِ', id: 'دڠَنّيَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَبْحَاثٍ', id: 'فَمْبَاهَاسَنْ' },
                    { ar: 'آخِرَ', id: 'دِي أَخِيرْ' },
                    { ar: 'الْكَلَامِ', id: 'فَمْبِيچَارَاءَنْ' },
                    { ar: 'عَنْ', id: 'تَنْتَاڠْ' },
                    { ar: 'أَعْمَالِ', id: 'أَمَال٢' },
                    { ar: 'الصَّلَاةِ.', id: 'صَلَاةْ.' }
                ],
                [
                    { ar: 'وَنَبْدَأُ', id: 'دَانْ كَامِي مُولَاي' },
                    { ar: 'بِتَعْدَادِ', id: 'دڠَنْ مڽَبُوتْكَنْ' },
                    { ar: 'أَبْعَاضِ', id: 'أَبْعَاضْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'أَوَّلاً،', id: 'فَرْتَامَا،' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'هَيْئَاتِهَا', id: 'هَيْئَاتْيَا' },
                    { ar: 'ثَانِياً.', id: 'كَدُوَا.' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: 'الْأَبْعَاضُ:', id: 'أَبْعَاضْ:' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١', id: '١' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّشَهُّدُ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَوَّلُ:', id: 'أَوَّلْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُقْصَدُ', id: 'دَانْ دِيمَكْسُودْكَنْ' },
                    { ar: 'بِهِ', id: 'دڠَنّيَا' },
                    { ar: 'التَّشَهُّدُ', id: 'تَشَهُدْ' },
                    { ar: 'فِي', id: 'دَالَمْ' },
                    { ar: 'الْجُلُوسِ', id: 'دُودُوكْ' },
                    { ar: 'الَّذِي', id: 'يَڠْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَعْقُبُهُ', id: 'مڠِيكُوتِييَا' },
                    { ar: 'سَلَامٌ،', id: 'سَلَامْ،' },
                    { ar: 'وَهُوَ', id: 'دَانْ اِيَا' },
                    { ar: 'الْجُلُوسُ', id: 'دُودُوكْ' }
                ]
            ]
        }
    ],
        146: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الَّذِي', id: 'يَڠْ' },
                    { ar: 'يَكُونُ', id: 'أَدَا' },
                    { ar: 'عَلَى', id: 'فَادَا' },
                    { ar: 'رَأْسِ', id: 'فَڠْهُوجُوڠْ' },
                    { ar: 'رَكْعَتَيْنِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُرْ' },
                    { ar: 'وَالْعَصْرِ', id: 'دَانْ عَصَرْ' },
                    { ar: 'وَالْمَغْرِبِ', id: 'دَانْ مَغْرِبْ' },
                    { ar: 'وَالْعِشَاءِ', id: 'دَانْ عِشَاءْ' }
                ],
                [
                    { ar: 'فَيُسَنُّ', id: 'مَاكَا دِيسُنَّهْكَانْ' },
                    { ar: 'التَّشَهُّدُ', id: 'تَشَهُدْ' },
                    { ar: 'فِيهِ.', id: 'دِي دَالَمْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'جَاءَ', id: 'تَلَاهْ دَاتَڠْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'الْمُسِيءِ', id: 'أَوْرَاڠْ يَڠْ بُورُوكْ' },
                    { ar: 'صَلَاتَهُ', id: 'صَلَاةْنْيَا' },
                    { ar: 'عِنْدَ', id: 'رِيوَايَاتْ' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٨٦٠)', id: '(٨٦٠)' },
                    { ar: '«فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'جَلَسْتَ', id: 'كَامُو دُودُوكْ' }
                ],
                [
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'وَسَطِ', id: 'تَڠَاهْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'فَاطْمَئِنَّ', id: 'مَاكَا طُمَأْنِينَةْلَاهْ' },
                    { ar: 'وَافْتَرِشْ', id: 'دَانْ دُودُوكْ إِفْتِرَاشْلَاهْ' },
                    { ar: 'فَخِذَكَ', id: 'فَاهَامُو' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'تَشَهَّدْ».', id: 'بَرْتَشَهُدْلَاهْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالدَّلِيلُ', id: 'دَانْ أَدَافُونْ دَلِيلْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'سُنَّةٌ', id: 'سُنَّةْ' },
                    { ar: 'وَلَيْسَ', id: 'دَانْ بُوكَانْ' },
                    { ar: 'بِفَرْضٍ؛', id: 'فَرْضُ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(١١٧٣)', id: '(١١٧٣)' }
                ],
                [
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٥٧٠)', id: '(٥٧٠)' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'رَسُولَ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'قَامَ', id: 'بَرْدِيرِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُرْ' },
                    { ar: 'وَعَلَيْهِ', id: 'دَانْ أَتَاسْنْيَا' },
                    { ar: 'جُلُوسٌ', id: 'دُودُوكْ' }
                ],
                [
                    { ar: 'فَلَمَّا', id: 'مَاكَا تَتْكَالَا' },
                    { ar: 'أَتَمَّ', id: 'إِيَا مَنْيَمْفُورْنَكَاانْ' },
                    { ar: 'صَلَاتَهُ', id: 'صَلَاةْنْيَا' },
                    { ar: 'سَجَدَ', id: 'إِيَا سُجُودْ' },
                    { ar: 'سَجْدَتَيْنِ.', id: 'دُوَ كَالِي سُجُودْ' },
                    { ar: '(أَيْ', id: 'يَكْنِي' },
                    { ar: 'لِلسَّهْوِ', id: 'كَرَنَا لُوفَا' },
                    { ar: 'تَعْوِيضاً', id: 'سَبَاگَايْ گَانْتِي' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَوَّلِ', id: 'يَڠْ فَرْتَامَا' }
                ],
                [
                    { ar: 'الَّذِي', id: 'يَڠْ' },
                    { ar: 'تَرَكَهُ', id: 'إِيَا مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'بِتَرْكِ', id: 'دڠَنْ مَنِيڠْگَلْكَانْ' },
                    { ar: 'الْجُلُوسِ', id: 'دُودُوكْ' },
                    { ar: 'لَهُ،', id: 'بَاگِينْيَا' },
                    { ar: 'فَلَوْ', id: 'مَاكَا سَأَنْدَايْنْيَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَالَاهْ' },
                    { ar: 'رُكْناً', id: 'رُكُونْ' },
                    { ar: 'لَاضْطُرَّ', id: 'نِسْچَايَا إِيَا تَرْفَكْسَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الْإِتْيَانِ', id: 'مَنْدَاتَاڠْكَانْ' },
                    { ar: 'بِهِ،', id: 'دڠَانْنْيَا' }
                ],
                [
                    { ar: 'وَلَمْ', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يَنْجَبِرْ', id: 'تَرْتَامْبَالْ' },
                    { ar: 'تَرْكُهُ', id: 'مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'بِسُجُودِ', id: 'دڠَنْ سُجُودْ' },
                    { ar: 'السَّهْوِ).', id: 'سَهْوِي' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٢', id: '٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الصَّلَاةُ', id: 'مَمْبَاچَا شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'عَقِبَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَوَّلِ:', id: 'يَڠْ فَرْتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'هِيَ', id: 'إِيَا' },
                    { ar: 'أَيْضاً', id: 'جُوگَا' },
                    { ar: 'سُنَّةٌ', id: 'سُنَّةْ' },
                    { ar: 'يُجْبَرُ', id: 'دِيتَامْبَالْ' },
                    { ar: 'تَرْكُهَا', id: 'مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'بِالسُّجُودِ.', id: 'دڠَنْ سُجُودْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٣', id: '٣' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْجُلُوسُ', id: 'دُودُوكْ' },
                    { ar: 'لِلتَّشَهُّدِ', id: 'أُونْتُوكْ تَشَهُدْ' },
                    { ar: 'الْأَوَّلِ:', id: 'يَڠْ فَرْتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'أَيْ', id: 'يَكْنِي' },
                    { ar: 'فَهِيَ', id: 'مَاكَا إِيَا' },
                    { ar: 'إِذاً', id: 'كَالَاوْ بَگِيتُو' },
                    { ar: 'ثَلَاثُ', id: 'تِيگَا' },
                    { ar: 'سُنَنٍ', id: 'سُنَّةْ٢' },
                    { ar: 'مُسْتَقِلَّةٍ:', id: 'يَڠْ بَرْدِيرِي سَنْدِيرِي' },
                    { ar: 'سُنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'الْجُلُوسِ،', id: 'دُودُوكْ' },
                    { ar: 'وَسُنَّةُ', id: 'دَانْ سُنَّةْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'فِيهِ،', id: 'دِي دَالَمْنْيَا' }
                ],
                [
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'سُنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'الصَّلَاةِ', id: 'بَرْشَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٤', id: '٤' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الصَّلَاةُ', id: 'مَمْبَاچَا شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'آلِ', id: 'كَلُوَارْگَا' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَخِيرِ', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'الَّذِي', id: 'يَڠْ' }
                ],
                [
                    { ar: 'هُوَ', id: 'إِيَا أَدَالَاهْ' },
                    { ar: 'رُكْنٌ:', id: 'رُكُونْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'أَيْ', id: 'يَكْنِي' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'أَدَاءِ', id: 'مَنُونَايْكَانْ' },
                    { ar: 'رُكْنِ', id: 'رُكُونْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجَلْسَةِ', id: 'دُودُوكْ' },
                    { ar: 'الْأَخِيرَةِ،', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'وَرُكْنِ', id: 'دَانْ رُكُونْ' },
                    { ar: 'الصَّلَاةِ', id: 'شَلَاوَاتْ' }
                ],
                [
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ،', id: 'ﷺ' },
                    { ar: 'الصَّلَاةُ', id: 'بَرْشَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'آلِ', id: 'كَلُوَارْگَا' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ،', id: 'ﷺ' },
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ بَرْلَالُو' },
                    { ar: 'مَعَكَ', id: 'بَرْسَمَامُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الصِّيغَةِ', id: 'رِدَاكْسِي' }
                ],
                [
                    { ar: 'الْكَامِلَةِ', id: 'يَڠْ سَمْفُورْنَا' },
                    { ar: 'لِلصَّلَاةِ', id: 'أُونْتُوكْ شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٥', id: '٥' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْقُنُوتُ', id: 'قُنُوتْ' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'الِاعْتِدَالِ', id: 'إِعْتِدَالْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الثَّانِيَةِ', id: 'يَڠْ كَدُوَ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ،', id: 'فَجَرْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'آخِرِ', id: 'أَخِيرْ' },
                    { ar: 'رَكْعَةٍ', id: 'رَكَاعَاتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْوِتْرِ', id: 'وِتِرْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'النِّصْفِ', id: 'سَفَارُوهْ' },
                    { ar: 'الثَّانِي', id: 'يَڠْ كَدُوَ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'رَمَضَانَ،', id: 'رَمَضَانْ' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' }
                ],
                [
                    { ar: 'اعْتِدَالِ', id: 'إِعْتِدَالْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْأَخِيرَةِ', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَيِّ', id: 'سَتِيَافْ' },
                    { ar: 'صَلَاةٍ', id: 'صَلَاةْ' },
                    { ar: 'بِالنِّسْبَةِ', id: 'دڠَنْ نِسْبَتْ' },
                    { ar: 'لِقُنُوتِ', id: 'أُونْتُوكْ قُنُوتْ' },
                    { ar: 'النَّازِلَةِ:', id: 'نَازِلَةْ' }
                ]
            ]
        }
    ],
    147: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَحْمَدُ', id: 'أَحْمَدْ' },
                    { ar: 'وَغَيْرُهُ،', id: 'دَانْ سَلَائِنْنْيَا' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَنَسٍ', id: 'أَنَسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«مَا زَالَ', id: 'سَنَانْتِيَاسَا' }
                ],
                [
                    { ar: 'رَسُولُ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْنُتُ', id: 'إِيَا بَرْقُنُوتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُحْ' },
                    { ar: 'حَتَّى', id: 'سَهِيڠْگَا' },
                    { ar: 'فَارَقَ', id: 'إِيَا بَرْفِيسَاهْ' },
                    { ar: 'الدُّنْيَا».', id: 'دُونِيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٩٥٦)؛', id: '(٩٥٦)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٦٧٧)،', id: '(٦٧٧)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَنَسٍ', id: 'أَنَسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ،', id: 'دَارِينْيَا' }
                ],
                [
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْگُوهْ' },
                    { ar: 'سُئِلَ:', id: 'إِيَا دِيتَانْيَا' },
                    { ar: 'أَقَنَتَ', id: 'أَفَاكَاهْ بَرْقُنُوتْ' },
                    { ar: 'النَّبِيُّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'الصُّبْحَ؟', id: 'صُبُحْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'نَعَمْ،', id: 'يَا' },
                    { ar: 'فَقِيلَ', id: 'مَاكَا دِيكَاتَاكَانْ' },
                    { ar: 'لَهُ:', id: 'بَاگِينْيَا' }
                ],
                [
                    { ar: 'أَوَقَنَتَ', id: 'أَفَاكَاهْ إِيَا بَرْقُنُوتْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الرُّكُوعِ؟', id: 'رُكُوعْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوعْ' },
                    { ar: 'يَسِيراً.', id: 'سَدِيكِيتْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[يُنْظَرُ', id: 'دِيلِيهَاتْ' },
                    { ar: 'الْبَيْهَقِيُّ', id: 'اَلْبَيْهَقِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُحْ' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'قُنُوتِ', id: 'قُنُوتْ' },
                    { ar: 'الْوِتْرِ].', id: 'وِتِرْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَتُؤَدَّى', id: 'دَانْ دِيتُونَايْكَانْ' },
                    { ar: 'سُنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'الْقُنُوتِ', id: 'قُنُوتْ' },
                    { ar: 'بِأَنْ', id: 'دڠَنْ بَهْوَ' },
                    { ar: 'يُثْنِيَ', id: 'إِيَا مَمُوجِي' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'تَعَالَى', id: 'مَهَا تِيڠْگِي' },
                    { ar: 'وَيَدْعُوَهُ', id: 'دَانْ إِيَا بَرْدُعَاءْ كَفَادَانْيَا' }
                ],
                [
                    { ar: 'بِأَيِّ', id: 'دڠَنْ سَتِيَافْ' },
                    { ar: 'لَفْظٍ', id: 'لَفَظْ' },
                    { ar: 'شَاءَ،', id: 'إِيَا كَهَنْدَاكِي' },
                    { ar: 'كَأَنْ', id: 'سَفَرْتِي بَهْوَ' },
                    { ar: 'يَقُولَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' },
                    { ar: 'اغْفِرْ', id: 'أَمْفُونِيلَاهْ' },
                    { ar: 'لِي', id: 'بَاگِيكُو' },
                    { ar: 'يَا غَفُورُ».', id: 'وَهَايْ يَڠْ مَهَا فڠَامْفُونْ' }
                ],
                [
                    { ar: 'وَلَكِنَّ', id: 'دَانْ تَتَافِي' },
                    { ar: 'الْكَمَالَ', id: 'كَسَمْفُورْنَاءَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'أَدَائِهَا', id: 'مَنُونَايْكَانْنْيَا' },
                    { ar: 'يَكُونُ', id: 'أَدَا' },
                    { ar: 'بِالْتِزَامِ', id: 'دڠَنْ مَنَتَافِي' },
                    { ar: 'الدُّعَاءِ', id: 'دُعَاءْ' },
                    { ar: 'الْوَارِدِ', id: 'يَڠْ دَاتَڠْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'رَسُولِ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' }
                ],
                [
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'ذَلِكَ.', id: 'إِيتُو' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(١٤٢٥)', id: '(١٤٢٥)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'الْحَسَنِ', id: 'اَلْحَسَنْ' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'عَلِيٍّ', id: 'عَلِي' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمَا', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'عَلَّمَنِي', id: 'إِيَا تَلَاهْ مڠَاجَارِيكُو' },
                    { ar: 'رَسُولُ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَلِمَاتٍ', id: 'كَلِمَاتْ٢' },
                    { ar: 'أَقُولُهُنَّ', id: 'أَكُو مڠُچَافْكَانْنْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْوِتْرِ:', id: 'وِتِرْ' }
                ],
                [
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' },
                    { ar: 'اهْدِنِي', id: 'بَرِيلَاهْ فَتُونْجُوكْ كَفَادَاكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'هَدَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي فَتُونْجُوكْ' },
                    { ar: 'وَعَافِنِي', id: 'دَانْ بَرِيلَاهْ عَافِيَةْ كَفَادَاكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'عَافَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي عَافِيَةْ' }
                ],
                [
                    { ar: 'وَتَوَلَّنِي', id: 'دَانْ فَلِيهَارَالَاهْ أَكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'تَوَلَّيْتَ،', id: 'أڠْكَاوْ فَلِيهَارَا' },
                    { ar: 'وَبَارِكْ', id: 'دَانْ بَرِيلَاهْ بَرْكَاهْ' },
                    { ar: 'لِي', id: 'بَاگِيكُو' },
                    { ar: 'فِيمَا', id: 'دِي دَالَمْ أَفَا يَڠْ' },
                    { ar: 'أَعْطَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي' }
                ],
                [
                    { ar: 'وَقِنِي', id: 'دَانْ جَاگَالَاهْ أَكُو' },
                    { ar: 'شَرَّ', id: 'كَبُورُوكَانْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'قَضَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ تَتَافْكَانْ' },
                    { ar: 'إِنَّكَ', id: 'سَسُوڠْگُوهْنْيَا أڠْكَاوْ' },
                    { ar: 'تَقْضِي', id: 'أڠْكَاوْ مَنَتَافْكَانْ' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يُقْضَى', id: 'دِيتَتَافْكَانْ' },
                    { ar: 'عَلَيْكَ،', id: 'أَتَاسْمُو' }
                ],
                [
                    { ar: 'وَإِنَّهُ', id: 'دَانْ سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَذِلُّ', id: 'مَنْجَادِي هِينَا' },
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'وَالَيْتَ،', id: 'أڠْكَاوْ كَاسِيهِي' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يَعِزُّ', id: 'مَنْجَادِي مُلِيَا' },
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'عَادَيْتَ،', id: 'أڠْكَاوْ مُوسُوهِي' }
                ],
                [
                    { ar: 'تَبَارَكْتَ', id: 'مَهَا سُچِي أڠْكَاوْ' },
                    { ar: 'رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'وَتَعَالَيْتَ»', id: 'دَانْ مَهَا تِيڠْگِي أڠْكَاوْ' },
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'لِلْإِمَامِ', id: 'بَاگِي إِمَامْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَأْتِيَ', id: 'إِيَا مَنْدَاتَاڠْكَانْ' },
                    { ar: 'بِهِ', id: 'دڠَانْنْيَا' },
                    { ar: 'بِصِيغَةِ', id: 'دڠَنْ بَنْتُوكْ' },
                    { ar: 'الْجَمْعِ.', id: 'جَمَاعْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'قَالَ', id: 'تَلَاهْ بَرْكَاتَا' },
                    { ar: 'التِّرْمِذِيُّ', id: 'اَلتِّرْمِذِي' },
                    { ar: '(٤٦٤):', id: '(٤٦٤)' },
                    { ar: 'هَذَا', id: 'إِنِي' },
                    { ar: 'حَدِيثٌ', id: 'حَدِيثْ' },
                    { ar: 'حَسَنٌ.', id: 'يَڠْ حَسَنْ' },
                    { ar: 'وَقَالَ:', id: 'دَانْ إِيَا بَرْكَاتَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'نَعْرِفُ', id: 'كَامِي مڠَتَاهُويْ' }
                ],
                [
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْقُنُوتِ', id: 'قُنُوتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْوِتْرِ', id: 'وِتِرْ' },
                    { ar: 'شَيْئاً', id: 'سَسُوَاتُو' },
                    { ar: 'أَحْسَنَ', id: 'يَڠْ لَبِيهْ بَائِيكْ' },
                    { ar: 'مِنْهُ.', id: 'دَارِينْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَعِنْدَ', id: 'دَانْ دِي سِيسِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(١٤٢٨)', id: '(١٤٢٨)' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'أُبَيَّ', id: 'أُبَيّ' },
                    { ar: 'بْنَ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'كَعْبٍ', id: 'كَعَبْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' }
                ],
                [
                    { ar: 'أَمَّهُمْ', id: 'إِيَا مڠِيمَامِي مَرِكَ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'يَعْنِي', id: 'يَكْنِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'رَمَضَانَ', id: 'رَمَضَانْ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَكَانَ', id: 'دَانْ أَدَالَاهْ إِيَا' },
                    { ar: 'يَقْنُتُ', id: 'إِيَا بَرْقُنُوتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'النِّصْفِ', id: 'سَفَارُوهْ' },
                    { ar: 'الْأَخِيرِ', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'رَمَضَانَ.', id: 'رَمَضَانْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْحَاكِمُ', id: 'اَلْحَاكِمْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' }
                ],
                [
                    { ar: 'كَانَ', id: 'أَدَالَاهْ إِيَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'رَفَعَ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ', id: 'كَفَالَانْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوعْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُحْ' }
                ],
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الثَّانِيَةِ،', id: 'يَڠْ كَدُوَ' },
                    { ar: 'رَفَعَ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'يَدَيْهِ', id: 'كَدُوَ تَاڠَانْنْيَا' },
                    { ar: 'يَدْعُو', id: 'إِيَا بَرْدُعَاءْ' },
                    { ar: 'بِهَذَا', id: 'دڠَنْ إِنِي' },
                    { ar: 'الدُّعَاءِ:', id: 'دُعَاءْ' },
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' }
                ],
                [
                    { ar: 'اهْدِنِي', id: 'بَرِيلَاهْ فَتُونْجُوكْ كَفَادَاكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'هَدَيْتَ...».', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي فَتُونْجُوكْ' }
                ]
            ]
        }
    ],
    148: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَاسْتَحَبَّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'الْعُلَمَاءُ', id: 'عُلَمَاءْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يُزَادَ', id: 'دِيتَامْبَاهْ' },
                    { ar: 'فِيهِ:', id: 'دِي دَالَمْنْيَا' },
                    { ar: 'فَلَكَ', id: 'مَاكَا بَاگِيمُو' },
                    { ar: 'الْحَمْدُ', id: 'سَگَالَا فُوجِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'قَضَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ تَتَافْكَانْ' }
                ],
                [
                    { ar: 'نَسْتَغْفِرُكَ', id: 'كَامِي مَمُوهُونْ أَمْفُونْ كَفَادَامُو' },
                    { ar: 'اللَّهُمَّ', id: 'يَا اَلله' },
                    { ar: 'رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'وَنَتُوبُ', id: 'دَانْ كَامِي بَرْتَوْبَاتْ' },
                    { ar: 'إِلَيْكَ،', id: 'كَفَادَامُو' },
                    { ar: 'وَصَلَّى', id: 'دَانْ سَمُوَگَا بَرْشَلَاوَاتْ' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'سَيِّدِنَا', id: 'گُوسْتِي كِيتَا' },
                    { ar: 'مُحَمَّدٍ', id: 'مُحَمَّدْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' }
                ],
                [
                    { ar: 'الْأُمِّيِّ', id: 'يَڠْ أُمِّي' },
                    { ar: 'وَعَلَى', id: 'دَانْ أَتَاسْ' },
                    { ar: 'آلِهِ', id: 'كَلُوَارْگَانْيَا' },
                    { ar: 'وَصَحْبِهِ', id: 'دَانْ صَحَابَاتْنْيَا' },
                    { ar: 'وَسَلَّمَ.', id: 'دَانْ سَمُوَگَا بَرْسَلَامْ' },
                    { ar: 'لِلْأَخْبَارِ', id: 'كَرَنَا بَبَرَافَا خَبَارْ' },
                    { ar: 'الصَّحِيحَةِ', id: 'يَڠْ صَحِيحْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' }
                ],
                [
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'الدُّعَاءِ', id: 'دُعَاءْ' },
                    { ar: 'وَالذِّكْرِ.', id: 'دَانْ ذِكِرْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[مُغْنِي', id: 'مُغْنِي' },
                    { ar: 'الْمُحْتَاجِ', id: 'اَلْمُحْتَاجْ' },
                    { ar: '(١/١٦٦', id: '(١/١٦٦' },
                    { ar: 'ـ', id: '-' },
                    { ar: '١٦٧)].', id: '١٦٧)]' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَرْفَعَ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'يَدَيْهِ', id: 'كَدُوَ تَاڠَانْنْيَا' },
                    { ar: 'أَثْنَاءَ', id: 'دِي فَرْتَڠَاهَانْ' },
                    { ar: 'هَذَا', id: 'إِنِي' },
                    { ar: 'الْقُنُوتِ،', id: 'قُنُوتْ' },
                    { ar: 'وَيَجْعَلَ', id: 'دَانْ إِيَا مَنْجَادِيكَانْ' },
                    { ar: 'بَطْنَهُمَا', id: 'فَرُوتْ كَدُوَانْيَا' },
                    { ar: 'لِجِهَةِ', id: 'فَادَا أَرَاهْ' }
                ],
                [
                    { ar: 'السَّمَاءِ.', id: 'لَاڠِيتْ' }
                ]
            ]
        },
        {
            type: 'heading',
            lines: [
                [
                    { ar: 'الْهَيْئَاتُ:', id: 'بَنْتُوكْ٢ سُنَّةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْگُوهْ' },
                    { ar: 'ذَكَرْنَا', id: 'كَامِي تَلَاهْ مَنْيَبُوتْكَانْ' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'الْهَيْئَاتِ', id: 'بَنْتُوكْ٢ سُنَّةْ' },
                    { ar: 'هِيَ:', id: 'إِيَا أَدَالَاهْ' },
                    { ar: 'سُنَنُ', id: 'سُنَّةْ٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'إِنْ', id: 'جِيكَا' },
                    { ar: 'تَرَكَهَا', id: 'مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' }
                ],
                [
                    { ar: 'لَمْ', id: 'تِيدَاكْ' },
                    { ar: 'يُسَنَّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'جَبْرُهَا', id: 'مَنَامْبَالْنْيَا' },
                    { ar: 'بِسُجُودِ', id: 'دڠَنْ سُجُودْ' },
                    { ar: 'السَّهْوِ،', id: 'سَهْوِي' },
                    { ar: 'بِخِلَافِ', id: 'بَرْبِيدَا دڠَنْ' },
                    { ar: 'الْأَبْعَاضِ.', id: 'أَبْعَاضْ' },
                    { ar: 'وَالْهَيْئَاتُ', id: 'دَانْ أَدَافُونْ بَنْتُوكْ٢ سُنَّةْ' },
                    { ar: 'تَتَلَخَّصُ', id: 'تَرْرِيڠْكَاسْ' }
                ],
                [
                    { ar: 'فِيمَا', id: 'دِي دَالَمْ أَفَا يَڠْ' },
                    { ar: 'يَلِي:', id: 'مڠِيكُوتِي' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١', id: '١' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'رَفْعُ', id: 'مڠَاڠْكَاتْ' },
                    { ar: 'الْيَدَيْنِ', id: 'كَدُوَ تَاڠَانْ' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'تَكْبِيرَةِ', id: 'تَكْبِيرْ' },
                    { ar: 'الْإِحْرَامِ', id: 'إِحْرَامْ' },
                    { ar: 'وَعِنْدَ', id: 'دَانْ كَِتيكَا' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوعْ' },
                    { ar: 'وَالرَّفْعِ', id: 'دَانْ بَاڠُونْ' },
                    { ar: 'مِنْهُ:', id: 'دَارِينْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّةُ', id: 'دَانْ أَدَافُونْ تَاَتَا چَارَا' },
                    { ar: 'أَدَاءِ', id: 'مَنُونَايْكَانْ' },
                    { ar: 'هَذِهِ', id: 'إِنِي' },
                    { ar: 'السُّنَّةِ:', id: 'سُنَّةْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَرْفَعَ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'كَفَّيْهِ', id: 'كَدُوَ تَلَافَاكْ تَاڠَانْنْيَا' },
                    { ar: 'مُسْتَقْبِلاً', id: 'حَالْ مڠْهَادَافْكَانْ' },
                    { ar: 'بِهِمَا', id: 'دڠَنْ كَدُوَانْيَا' },
                    { ar: 'الْقِبْلَةَ،', id: 'قِبْلَةْ' }
                ],
                [
                    { ar: 'مَنْشُورَتَيِ', id: 'حَالْ دِيبَنْتَاڠْكَانْ' },
                    { ar: 'الْأَصَابِعِ،', id: 'جَارِي٢' },
                    { ar: 'مُحَاذِياً', id: 'حَالْ سَجَاجَارْ' },
                    { ar: 'بِإِبْهَامَيْهِ', id: 'دڠَنْ كَدُوَ إِبُو جَارِينْيَا' },
                    { ar: 'لِشَحْمَتَيِ', id: 'تَرْهَادَافْ كَدُوَ چُوفِيڠْ' },
                    { ar: 'الْأُذُنَيْنِ،', id: 'كَدُوَ تَلِيڠَا' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'تَكُونَ', id: 'أَدَا' },
                    { ar: 'كَفَّاهُ', id: 'كَدُوَ تَلَافَاكْ تَاڠَانْنْيَا' }
                ],
                [
                    { ar: 'مَكْشُوفَتَيْنِ.', id: 'حَالْ تَرْبُوكَا كَدُوَانْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٠٥)؛', id: '(٧٠٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٣٩٠)،', id: '(٣٩٠)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'ابْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'عُمَرَ', id: 'عُمَرْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُمَا', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'رَأَيْتُ', id: 'أَكُو تَلَاهْ مَلِيهَاتْ' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'افْتَتَحَ', id: 'إِيَا مَمُولَائِي' },
                    { ar: 'التَّكْبِيرَ', id: 'تَكْبِيرْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ' },
                    { ar: 'فَرَفَعَ', id: 'مَاكَا إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'يَدَيْهِ', id: 'كَدُوَ تَاڠَانْنْيَا' },
                    { ar: 'حِينَ', id: 'كَِتيكَا' }
                ],
                [
                    { ar: 'يُكَبِّرُ،', id: 'إِيَا بَرْتَكْبِيرْ' },
                    { ar: 'حَتَّى', id: 'سَهِيڠْگَا' },
                    { ar: 'يَجْعَلَهُمَا', id: 'إِيَا مَنْجَادِيكَانْ كَدُوَانْيَا' },
                    { ar: 'حَذْوَ', id: 'سَجَاجَارْ' },
                    { ar: 'مِنْكَبَيْهِ،', id: 'كَدُوَ فُونْدَاكْنْيَا' },
                    { ar: 'وَإِذَا', id: 'دَانْ أَفَابِيلَا' },
                    { ar: 'كَبَّرَ', id: 'إِيَا بَرْتَكْبِيرْ' },
                    { ar: 'لِلرُّكُوعِ', id: 'أُونْتُوكْ رُكُوعْ' },
                    { ar: 'فَعَلَ', id: 'إِيَا مَلَاكُوكَانْ' },
                    { ar: 'مِثْلَهُ،', id: 'سَفَرْتِينْيَا' },
                    { ar: 'وَإِذَا', id: 'دَانْ أَفَابِيلَا' }
                ],
                [
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'سَمِعَ', id: 'مَهَا مَنْدڠَارْ' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَمِدَهُ،', id: 'إِيَا مَمُوجِينْيَا' },
                    { ar: 'فَعَلَ', id: 'إِيَا مَلَاكُوكَانْ' },
                    { ar: 'مِثْلَهُ', id: 'سَفَرْتِينْيَا' },
                    { ar: 'وَقَالَ:', id: 'دَانْ إِيَا بَرْكَاتَا' },
                    { ar: 'رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'وَلَكَ', id: 'دَانْ بَاگِيمُو' },
                    { ar: 'الْحَمْدُ،', id: 'سَگَالَا فُوجِي' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يَفْعَلُ', id: 'إِيَا مَلَاكُوكَانْ' }
                ],
                [
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'حِينَ', id: 'كَِتيكَا' },
                    { ar: 'يَسْجُدُ،', id: 'إِيَا سُجُودْ' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'حِينَ', id: 'كَِتيكَا' },
                    { ar: 'يَرْفَعُ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ', id: 'كَفَالَانْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'السُّجُودِ.', id: 'سُجُودْ' }
                ]
            ]
        }
    ],
    149: [
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٢', id: '٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَضْعُ', id: 'مَلَتَاكْكَانْ' },
                    { ar: 'يَدِهِ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'ظَهْرِ', id: 'فُوڠْگُوڠْ' },
                    { ar: 'يَدِهِ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَذَلِكَ', id: 'دَانْ إِيتُو' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْوُقُوفِ:', id: 'بَرْدِيرِي' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّةُ', id: 'دَانْ أَدَافُونْ تَاَتَا چَارَا' },
                    { ar: 'ذَلِكَ:', id: 'إِيتُو' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَضَعَ', id: 'إِيَا مَلَتَاكْكَانْ' },
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'ظَهْرِ', id: 'فُوڠْگُوڠْ' },
                    { ar: 'كَفِّ', id: 'تَلَافَاكْ تَاڠَانْ' },
                    { ar: 'وَرُسْغِ', id: 'دَانْ فَرْگَلَاڠَانْ' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' }
                ],
                [
                    { ar: 'وَيَقْبِضَ', id: 'دَانْ إِيَا مڠْگڠْگَامْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'بِأَصَابِعِ', id: 'دڠَنْ جَارِي٢' },
                    { ar: 'يَدِهِ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' },
                    { ar: 'وَيَكُونَ', id: 'دَانْ أَدَا' },
                    { ar: 'مَحَلُّ', id: 'تَمْفَاتْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'تَحْتَ', id: 'دِي بَاوَاهْ' }
                ],
                [
                    { ar: 'صَدْرِهِ', id: 'دَادَانْيَا' },
                    { ar: 'وَفَوْقَ', id: 'دَانْ دِي أَتَاسْ' },
                    { ar: 'سُرَّتِهِ.', id: 'فُوسَارْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'لِخَبَرِ', id: 'كَرَنَا خَبَارْ' },
                    { ar: 'مُسْلِمٍ', id: 'مُسْلِمْ' },
                    { ar: '(٤٠١)،', id: '(٤٠١)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'وَائِلِ', id: 'وَائِلْ' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'حُجْرٍ', id: 'حُجْر' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' }
                ],
                [
                    { ar: 'رَأَى', id: 'إِيَا تَلَاهْ مَلِيهَاتْ' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'رَفَعَ', id: 'إِيَا تَلَاهْ مڠَاڠْكَاتْ' },
                    { ar: 'يَدَيْهِ', id: 'كَدُوَ تَاڠَانْنْيَا' },
                    { ar: 'حِينَ', id: 'كَِتيكَا' },
                    { ar: 'دَخَلَ', id: 'إِيَا مَاسُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ...', id: 'صَلَاةْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'وَضَعَ', id: 'إِيَا مَلَتَاكْكَانْ' }
                ],
                [
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الْيُسْرَى.', id: 'يَڠْ كِيرِي' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَعِنْدَ', id: 'دَانْ دِي سِيسِي' },
                    { ar: 'النَّسَائِيِّ', id: 'اَلنَّسَائِي' },
                    { ar: '(١٢٦/٢):', id: '(١٢٦/٢)' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'وَضَعَ', id: 'إِيَا مَلَتَاكْكَانْ' },
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'كَفِّهِ', id: 'تَلَافَاكْ تَاڠَانْنْيَا' }
                ],
                [
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَالرُّسْغِ', id: 'دَانْ فَرْگَلَاڠَانْ' },
                    { ar: 'وَالسَّاعِدِ.', id: 'دَانْ لڠَانْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٣', id: '٣' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'النَّظَرُ', id: 'مَلِيهَاتْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'مَوْضِعِ', id: 'تَمْفَاتْ' },
                    { ar: 'السُّجُودِ:', id: 'سُجُودْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَيُكْرَهُ', id: 'مَاكَا دِيمَكْرُوهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَتَوَزَّعَ', id: 'تَرْبَاگِي' },
                    { ar: 'نَظَرُهُ', id: 'فَانْدَاڠَانْنْيَا' },
                    { ar: 'فِيمَا', id: 'دِي دَالَمْ أَفَا يَڠْ' },
                    { ar: 'حَوْلَهُ،', id: 'سَكِيتَارْنْيَا' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَنْظُرَ', id: 'إِيَا مَلِيهَاتْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' }
                ],
                [
                    { ar: 'الْأَعْلَى', id: 'يَڠْ أَتَاسْ' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'شَيْءٍ', id: 'سَسُوَاتُو' },
                    { ar: 'أَمَامَهُ', id: 'دِي دَفَانْنْيَا' },
                    { ar: 'حَتَّى', id: 'سَهِيڠْگَا' },
                    { ar: 'وَلَوْ', id: 'دَانْ وَالَاوْفُونْ' },
                    { ar: 'كَانَ', id: 'أَدَا' },
                    { ar: 'الْكَعْبَةَ؛', id: 'كَعْبَةْ' },
                    { ar: 'بَلْ', id: 'بَاهْكَانْ' }
                ],
                [
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَجْعَلَ', id: 'إِيَا مَنْجَادِيكَانْ' },
                    { ar: 'نَظَرَهُ', id: 'فَانْدَاڠَانْنْيَا' },
                    { ar: 'الدَّائِمَ', id: 'يَڠْ تَرُوسْ مَنَرُوسْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'مَوْضِعِ', id: 'تَمْفَاتْ' },
                    { ar: 'سُجُودِهِ،', id: 'سُجُودْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَچُوَالِي' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'التَّشَهُّدِ،', id: 'تَشَهُدْ' }
                ],
                [
                    { ar: 'فَلْيَجْعَلْ', id: 'مَاكَا هَنْدَاكْلَاهْ إِيَا مَنْجَادِيكَانْ' },
                    { ar: 'نَظَرَهُ', id: 'فَانْدَاڠَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'سَبَّابَتِهِ', id: 'تَلُونْجُوكْنْيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'يُشِيرُ', id: 'إِيَا بَرِشَارَاتْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'التَّشَهُّدِ.', id: 'تَشَهُدْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'دَلِيلُ', id: 'دَلِيلْ' },
                    { ar: 'ذَلِكَ:', id: 'إِيتُو' },
                    { ar: 'اتِّبَاعُ', id: 'مڠِيكُوتِي' },
                    { ar: 'فِعْلِ', id: 'فَرْبُوَاتَانْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٤', id: '٤' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'افْتِتَاحُ', id: 'فَمْبُوكَاءَانْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّكْبِيرِ', id: 'تَكْبِيرْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'التَّوَجُّهِ:', id: 'تَوَجُّهْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَلَفْظُهُ،', id: 'دَانْ لَفَظْنْيَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٧٧١)،', id: '(٧٧١)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'عَلِيٍّ', id: 'عَلِي' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'عَنْ', id: 'دَارِي' }
                ],
                [
                    { ar: 'رَسُولِ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ:', id: 'ﷺ' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'كَانَ', id: 'أَدَالَاهْ إِيَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'قَامَ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«وَجَّهْتُ', id: 'أَكُو مڠْهَادَافْكَانْ' }
                ],
                [
                    { ar: 'وَجْهِيَ', id: 'وَجَاهْكُو' },
                    { ar: 'لِلَّذِي', id: 'بَاگِي ذَاتْ يَڠْ' },
                    { ar: 'فَطَرَ', id: 'مَنْچِفْتَاكَانْ' },
                    { ar: 'السَّمَوَاتِ', id: 'بَبَرَافَا لَاڠِيتْ' },
                    { ar: 'وَالْأَرْضَ', id: 'دَانْ بُومِي' },
                    { ar: 'حَنِيفاً', id: 'حَالْ لُورُوسْ' },
                    { ar: 'وَمَا', id: 'دَانْ تِيدَاكْلَاهْ' },
                    { ar: 'أَنَا', id: 'أَكُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُشْرِكِينَ،', id: 'أَوْرَاڠْ٢ مُشْرِكْ' }
                ],
                [
                    { ar: 'إِنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'صَلَاتِي', id: 'صَلَاةْكُو' },
                    { ar: 'وَنُسُكِي', id: 'دَانْ إِبَادَاهْكُو' },
                    { ar: 'وَمَحْيَايَ', id: 'دَانْ هِيدُوفْكُو' },
                    { ar: 'وَمَمَاتِي', id: 'دَانْ مَاتِيكُو' },
                    { ar: 'لِلَّهِ', id: 'بَاگِي اَلله' },
                    { ar: 'رَبِّ', id: 'تُوهَانْ' },
                    { ar: 'الْعَالَمِينَ،', id: 'عَالَمْ سَمَسْتَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ أَدَا' }
                ],
                [
                    { ar: 'شَرِيكَ', id: 'سَكُوتُو' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'وَبِذَلِكَ', id: 'دَانْ دڠَنْ إِيتُو' },
                    { ar: 'أُمِرْتُ', id: 'أَكُو دِيفَرِينْتَاهْ' },
                    { ar: 'وَأَنَا', id: 'دَانْ أَكُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُسْلِمِينَ».', id: 'أَوْرَاڠْ٢ مُسْلِمْ' }
                ]
            ]
        }
    ],
    150: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[وَجَّهْتُ', id: 'أَكُو مڠْهَادَافْكَانْ' },
                    { ar: 'وَجْهِيَ:', id: 'وَجَاهْكُو' },
                    { ar: 'قَصَدْتُ', id: 'أَكُو مَنْيڠَاجَا' },
                    { ar: 'بِعِبَادَتِي.', id: 'دڠَنْ إِبَادَاهْكُو' },
                    { ar: 'فَطَرَ:', id: 'مَنْچِفْتَاكَانْ' },
                    { ar: 'ابْتَدَأَ', id: 'إِيَا مَمُولَائِي' },
                    { ar: 'خَلْقَهَا.', id: 'فَنْچِفْتَاءَانْنْيَا' },
                    { ar: 'حَنِيفاً:', id: 'حَالْ لُورُوسْ' },
                    { ar: 'مَائِلاً', id: 'حَالْ چُونْدُوڠْ' }
                ],
                [
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الدِّينِ', id: 'أَگَامَا' },
                    { ar: 'الْحَقِّ.', id: 'يَڠْ حَقْ' },
                    { ar: 'نُسُكِي:', id: 'إِبَادَاهْكُو' },
                    { ar: 'عِبَادَتِي', id: 'إِبَادَاهْكُو' },
                    { ar: 'وَمَا', id: 'دَانْ أَفَا يَڠْ' },
                    { ar: 'أَتَقَرَّبُ', id: 'أَكُو مَنْدَكَاتْكَانْ دِيرِي' },
                    { ar: 'بِهِ', id: 'دڠَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'تَعَالَى].', id: 'مَهَا لُوهُورْ]' }
                ]
            ]
        },
        {
            type: 'heading',
            lines: [
                [
                    { ar: 'مَكَانُ', id: 'تَمْفَاتْ' },
                    { ar: 'اسْتِحْبَابِ', id: 'كَسُنَّهَانْ' },
                    { ar: 'التَّوَجُّهِ:', id: 'تَوَجُّهْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'تُسْتَحَبُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'قِرَاءَةُ', id: 'بَاچَاءَانْ' },
                    { ar: 'التَّوَجُّهِ', id: 'تَوَجُّهْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'افْتِتَاحِ', id: 'فَمْبُوكَاءَانْ' },
                    { ar: 'الْمَفْرُوضَةِ', id: 'يَڠْ دِيفَرْضُوكَانْ' },
                    { ar: 'وَالنَّافِلَةِ،', id: 'دَانْ يَڠْ سُنَّةْ' },
                    { ar: 'لِلْمُنْفَرِدِ', id: 'بَاگِي أَوْرَاڠْ يَڠْ سَنْدِيرِيَانْ' }
                ],
                [
                    { ar: 'وَلِلْإِمَامِ', id: 'دَانْ بَاگِي إِمَامْ' },
                    { ar: 'وَالْمَأْمُومِ،', id: 'دَانْ مَأْمُومْ' },
                    { ar: 'بِشَرْطِ', id: 'دڠَنْ شَرَاتْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَبْدَأَ', id: 'إِيَا مَمُولَائِي' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'الْفَاتِحَةِ', id: 'اَلْفَاتِحَةْ' },
                    { ar: 'بَعْدُ،', id: 'سَتَلَاهْنْيَا' },
                    { ar: 'فَإِنْ', id: 'مَاكَا جِيكَا' },
                    { ar: 'بَدَأَ', id: 'إِيَا مَمُولَائِي' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' }
                ],
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْگُوهْ' },
                    { ar: 'عَلِمْتَ', id: 'أڠْكَاوْ تَلَاهْ مڠَتَاهُويِي' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'الْبَسْمَلَةَ', id: 'بَسْمَلَةْ' },
                    { ar: 'جُزْءٌ', id: 'بَاگِيَانْ' },
                    { ar: 'مِنْهَا', id: 'دَارِينْيَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'بِالتَّعَوُّذِ،', id: 'دڠَنْ تَعَوُّذْ' },
                    { ar: 'فَاتَتْ', id: 'لُوفُوتْ' },
                    { ar: 'سُنِّيَّةُ', id: 'كَسُنَّهَانْ' },
                    { ar: 'قِرَاءَةِ', id: 'بَاچَاءَانْ' }
                ],
                [
                    { ar: 'التَّوَجُّهِ،', id: 'تَوَجُّهْ' },
                    { ar: 'فَلَا', id: 'مَاكَا تِيدَاكْ' },
                    { ar: 'يَنْبَغِي', id: 'فَاتُوتْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَعُودَ', id: 'إِيَا كَمْبَالِي' },
                    { ar: 'إِلَيْهِ', id: 'كَفَادَانْيَا' },
                    { ar: 'وَلَوْ', id: 'دَانْ وَالَاوْفُونْ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'نَاسِياً.', id: 'حَالْ لُوفَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'تُسْتَحَبُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'قِرَاءَةُ', id: 'بَاچَاءَانْ' },
                    { ar: 'التَّوَجُّهِ', id: 'تَوَجُّهْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْجِنَازَةِ،', id: 'جَنَازَةْ' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَرِيضَةِ', id: 'يَڠْ فَرْضُو' }
                ],
                [
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'ضَاقَ', id: 'سَمْفِيتْ' },
                    { ar: 'وَقْتُهَا،', id: 'وَكْتُونْيَا' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'خَشِيَ', id: 'إِيَا خَوَاتِيرْ' },
                    { ar: 'إِنِ', id: 'جِيكَا' },
                    { ar: 'اشْتَغَلَ', id: 'إِيَا سِيبُوكْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'التَّوَجُّهِ', id: 'تَوَجُّهْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَخْرُجَ', id: 'كَلُوَارْ' },
                    { ar: 'الْوَقْتُ.', id: 'وَكْتُو' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٥', id: '٥' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الِاسْتِعَاذَةُ', id: 'إِسْتِعَاذَةْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّوَجُّهِ:', id: 'تَوَجُّهْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهِيَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقُولَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'أَعُوذُ', id: 'أَكُو بَرْلِينْدُوڠْ' },
                    { ar: 'بِاللهِ', id: 'دڠَنْ اَلله' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الشَّيْطَانِ', id: 'شَيْطَانْ' },
                    { ar: 'الرَّجِيمِ.', id: 'يَڠْ تَرْكُوتُوكْ' },
                    { ar: 'يَبْدَأُ', id: 'إِيَا مَمُولَائِي' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'قِرَاءَةَ', id: 'بَاچَاءَانْ' }
                ],
                [
                    { ar: 'الْفَاتِحَةِ،', id: 'اَلْفَاتِحَةْ' },
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'شَرَعَ', id: 'إِيَا مَمُولَائِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'قِرَاءَةِ', id: 'بَاچَاءَانْ' },
                    { ar: 'الْفَاتِحَةِ', id: 'اَلْفَاتِحَةْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَسْتَعِيذَ،', id: 'إِيَا مَمُوهُونْ فَرْلِينْدُوڠَانْ' },
                    { ar: 'فَاتَتِ', id: 'لُوفُوتْ' },
                    { ar: 'الِاسْتِعَاذَةُ', id: 'إِسْتِعَاذَةْ' }
                ],
                [
                    { ar: 'وَكُرِهَ', id: 'دَانْ دِيمَكْرُوهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَعُودَ', id: 'إِيَا كَمْبَالِي' },
                    { ar: 'إِلَيْهَا.', id: 'كَفَادَانْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'لِقَوْلِهِ', id: 'كَرَنَا فِرْمَانْنْيَا' },
                    { ar: 'سُبْحَانَهُ:', id: 'مَهَا سُچِي دِيَا' },
                    { ar: '﴿فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'قَرَأْتَ', id: 'أڠْكَاوْ مَمْبَاچَا' },
                    { ar: 'الْقُرْآنَ', id: 'اَلْقُرْآنْ' },
                    { ar: 'فَاسْتَعِذْ', id: 'مَاكَا مُوهُونْلَاهْ فَرْلِينْدُوڠَانْ' },
                    { ar: 'بِاللَّهِ', id: 'كَفَادَا اَلله' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الشَّيْطَانِ', id: 'شَيْطَانْ' }
                ],
                [
                    { ar: 'الرَّجِيمِ﴾', id: 'يَڠْ تَرْكُوتُوكْ' },
                    { ar: '(سُورَةُ', id: 'سُورَةْ' },
                    { ar: 'النَّحْلِ:', id: 'اَلنَّحْل' },
                    { ar: 'الْآيَةُ', id: 'أَيَاتْ' },
                    { ar: '٩٨).', id: '٩٨)' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٦', id: '٦' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْجَهْرُ', id: 'مڠَرَاسْكَانْ' },
                    { ar: 'بِالْقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'مَوْضِعِهِ', id: 'تَمْفَاتْنْيَا' },
                    { ar: 'وَالْإِسْرَارُ', id: 'دَانْ مَمَلَانْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'مَوْضِعِهِ:', id: 'تَمْفَاتْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالْمَوَاضِعُ', id: 'دَانْ أَدَافُونْ تَمْفَاتْ٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'فِيهَا', id: 'دِي دَالَمْنْيَا' },
                    { ar: 'الْجَهْرُ', id: 'مڠَرَاسْكَانْ' },
                    { ar: 'بِالْقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'هِيَ:', id: 'إِيَا أَدَالَاهْ' },
                    { ar: 'رَكْعَتَا', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ،', id: 'فَجَرْ' },
                    { ar: 'وَالرَّكْعَتَانِ', id: 'دَانْ دُوَ رَكَاعَاتْ' }
                ],
                [
                    { ar: 'الْأُولَيَانِ', id: 'يَڠْ فَرْتَامَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمَغْرِبِ', id: 'مَغْرِبْ' },
                    { ar: 'وَالْعِشَاءِ،', id: 'دَانْ عِشَاءْ' },
                    { ar: 'وَصَلَاةُ', id: 'دَانْ صَلَاةْ' },
                    { ar: 'الْجُمُعَةِ،', id: 'جُمْعَةْ' },
                    { ar: 'وَالْعِيدَيْنِ،', id: 'دَانْ دُوَ هَارِي رَايَا' },
                    { ar: 'وَخُسُوفُ', id: 'دَانْ گَرْهَانَا' },
                    { ar: 'الْقَمَرِ،', id: 'بُولَانْ' },
                    { ar: 'وَصَلَاةُ', id: 'دَانْ صَلَاةْ' }
                ],
                [
                    { ar: 'الِاسْتِسْقَاءِ،', id: 'إِسْتِسْقَاءْ' },
                    { ar: 'وَالتَّرَاوِيحُ،', id: 'دَانْ تَرَاوِيحْ' },
                    { ar: 'وَوِتْرُ', id: 'دَانْ وِتِرْ' },
                    { ar: 'رَمَضَانَ،', id: 'رَمَضَانْ' },
                    { ar: 'كُلُّ', id: 'تِيَافْ٢' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'بِالنِّسْبَةِ', id: 'دڠَنْ دِينِسْبَاتْكَانْ' },
                    { ar: 'لِلْإِمَامِ', id: 'بَاگِي إِمَامْ' },
                    { ar: 'وَالْمُنْفَرِدِ', id: 'دَانْ يَڠْ سَنْدِيرِيَانْ' },
                    { ar: 'فَقَطْ.', id: 'سَاجَا' },
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' }
                ],
                [
                    { ar: 'الْإِسْرَارُ', id: 'مَمَلَانْكَانْ' },
                    { ar: 'فِيمَا', id: 'فَادَا أَفَا يَڠْ' },
                    { ar: 'عَدَا', id: 'سَلَائِينْ' },
                    { ar: 'ذَلِكَ.', id: 'إِيتُو' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'دَلَّ', id: 'تَلَاهْ مَنُونْجُوكْكَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'أَحَادِيثُ', id: 'بَبَرَافَا حَدِيثْ' },
                    { ar: 'مِنْهَا:', id: 'سَبَاگِيَانْ دَارِينْيَا' }
                ]
            ]
        }
    ],
    151: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٥)؛', id: '(٧٣٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٦٣)،', id: '(٤٦٣)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'جُبَيْرِ', id: 'جُبَيْرْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'مُطْعِمٍ', id: 'مُطْعِمْ' }
                ],
                [
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'الْمَغْرِبَ', id: 'مَغْرِبْ' },
                    { ar: 'بِالطُّورِ.', id: 'دڠَنْ سُورَةْ اَلطُّورْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٣)؛', id: '(٧٣٣)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٦٤)،', id: '(٤٦٤)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'الْبَرَاءِ', id: 'اَلْبَرَاءْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ:', id: 'إِيَا مَمْبَاچَا' },
                    { ar: '﴿وَالتِّينِ', id: 'وَالتِّينِ' },
                    { ar: 'وَالزَّيْتُونِ﴾', id: 'وَالزَّيْتُونِ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْعِشَاءِ،', id: 'عِشَاءْ' }
                ],
                [
                    { ar: 'وَمَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'أَحَداً', id: 'سَسَأَوْرَاڠْ' },
                    { ar: 'أَحْسَنَ', id: 'يَڠْ لَبِيهْ بَاگُوسْ' },
                    { ar: 'صَوْتاً', id: 'سُوَارَانْيَا' },
                    { ar: 'مِنْهُ،', id: 'دَارِينْيَا' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'قِرَاءَةً.', id: 'بَاچَاءَانْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٩)؛', id: '(٧٣٩)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٤٩)،', id: '(٤٤٩)' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'ابْنِ', id: 'إِبْنُ' }
                ],
                [
                    { ar: 'عَبَّاسٍ', id: 'عَبَّاسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'فِي', id: 'فَادَا' },
                    { ar: 'حُضُورِ', id: 'كَحَادِيرَانْ' },
                    { ar: 'الْجِنِّ', id: 'جِنْ' },
                    { ar: 'وَاسْتِمَاعِهِمُ', id: 'دَانْ مَنْدڠَارْنْيَا مَرَكَ' },
                    { ar: 'الْقُرْآنَ', id: 'اَلْقُرْآنْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' }
                ],
                [
                    { ar: 'وَفِيهِ:', id: 'دَانْ دِي دَالَمْنْيَا' },
                    { ar: 'وَهُوَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'يُصَلِّي', id: 'إِيَا صَلَاةْ' },
                    { ar: 'بِأَصْحَابِهِ', id: 'دڠَنْ صَحَابَاتْنْيَا' },
                    { ar: 'صَلَاةَ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ،', id: 'فَجَرْ' },
                    { ar: 'فَلَمَّا', id: 'مَاكَا تَتْكَالَا' },
                    { ar: 'سَمِعُوا', id: 'مَرَكَ مَنْدڠَارْ' },
                    { ar: 'الْقُرْآنَ', id: 'اَلْقُرْآنْ' },
                    { ar: 'اسْتَمَعُوا', id: 'مَرَكَ مَنْدڠَارْكَانْ' },
                    { ar: 'لَهُ.', id: 'كَفَادَانْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٤٥)؛', id: '(٧٤٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٥١)،', id: '(٤٥١)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'قَتَادَةَ', id: 'قَتَادَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'بِأُمِّ', id: 'دڠَنْ أُمُّ' },
                    { ar: 'الْكِتَابِ', id: 'اَلْكِتَابْ' },
                    { ar: 'وَسُورَةٍ', id: 'دَانْ سُورَةْ' },
                    { ar: 'مَعَهَا،', id: 'بَسَرْتَانْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَتَيْنِ', id: 'دُوَ رَكَاعَاتْ' }
                ],
                [
                    { ar: 'الْأُولَيَيْنِ', id: 'يَڠْ فَرْتَامَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُورْ' },
                    { ar: 'وَصَلَاةِ', id: 'دَانْ صَلَاةْ' },
                    { ar: 'الْعَصْرِ.', id: 'عَصَرْ' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'رِوَايَةٍ:', id: 'سَاطُو رِوَايَاتْ' },
                    { ar: 'وَهَكَذَا', id: 'دَانْ سَفَرْتِي إِنِيلَاهْ' },
                    { ar: 'يَفْعَلُ', id: 'إِيَا مَلَاكُوكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'الصُّبْحِ.', id: 'صُبُوحْ' },
                    { ar: 'مَعَ', id: 'بَسَرْتَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'سَبَقَ', id: 'تَلَاهْ تَرْدَاهُولُو' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَحَادِيثِ', id: 'حَدِيثْ٢' },
                    { ar: 'الْجَهْرِ', id: 'مڠَرَاسْكَانْ' },
                    { ar: 'بِالْقِرَاءَةِ.', id: 'دڠَنْ بَاچَاءَانْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٨٢٣', id: '(٨٢٣' },
                    { ar: 'وَ٨٢٤)؛', id: 'دَانْ ٨٢٤)' },
                    { ar: 'وَالنَّسَائِيُّ', id: 'دَانْ اَلنَّسَائِي' },
                    { ar: '(١٤١/٢)', id: '(١٤١/٢)' },
                    { ar: 'وَغَيْرُهُمَا،', id: 'دَانْ سَلَائِينْ كَدُوَانْيَا' }
                ],
                [
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'عُبَادَةَ', id: 'عُبَادَةْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'الصَّامِتِ', id: 'اَلصَّامِتْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كُنَّا', id: 'أَدَالَاهْ كَامِي' },
                    { ar: 'خَلْفَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'رَسُولِ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ', id: 'فَجَرْ' },
                    { ar: 'فَثَقُلَتْ', id: 'مَاكَا مَنْجَادِي بَرَاتْ' },
                    { ar: 'عَلَيْهِ', id: 'أَتَاسْنْيَا' },
                    { ar: 'الْقِرَاءَةُ،', id: 'بَاچَاءَانْ' },
                    { ar: 'فَلَمَّا', id: 'مَاكَا تَتْكَالَا' },
                    { ar: 'انْصَرَفَ', id: 'إِيَا سَلَسَايْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«لَعَلَّكُمْ', id: 'مُونْگكِينْ كَالِيَانْ' },
                    { ar: 'تَقْرَءُونَ', id: 'كَالِيَانْ مَمْبَاچَا' }
                ],
                [
                    { ar: 'خَلْفَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'إِمَامِكُمْ»', id: 'إِمَامْ كَالِيَانْ»' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'قُلْنَا', id: 'كَامِي بَرْكَاتَا' },
                    { ar: 'يَا', id: 'وَاهَايْ' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللهِ،', id: 'اَلله' },
                    { ar: 'إِي', id: 'إِيَا' },
                    { ar: 'وَاللهِ،', id: 'دَمِي اَلله' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«لَا', id: '«جَاڠَانْلَاهْ' },
                    { ar: 'تَفْعَلُوا', id: 'كَالِيَانْ مَلَاكُوكَانْ' }
                ],
                [
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'بِأُمِّ', id: 'دڠَنْ أُمُّ' },
                    { ar: 'الْقُرْآنِ،', id: 'اَلْقُرْآنْ' },
                    { ar: 'فَإِنَّهُ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ سَاهْ' },
                    { ar: 'صَلَاةَ', id: 'صَلَاةْ' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ' },
                    { ar: 'لَمْ', id: 'يَڠْ بَلُومْ' },
                    { ar: 'يَقْرَأْ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'بِهَا».', id: 'دڠَانْنْيَا»' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'رِوَايَةٍ:', id: 'سَاطُو رِوَايَاتْ' },
                    { ar: '«فَلَا', id: '«مَاكَا جَاڠَانْلَاهْ' },
                    { ar: 'تَقْرَءُوا', id: 'كَالِيَانْ مَمْبَاچَا' }
                ],
                [
                    { ar: 'بِشَيْءٍ', id: 'دڠَنْ سَسُوَاتُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْقُرْآنِ', id: 'اَلْقُرْآنْ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'جَهَرْتُ', id: 'أَكُو مڠَرَاسْكَانْ' },
                    { ar: 'بِهِ', id: 'دڠَانْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'بِأُمِّ', id: 'دڠَنْ أُمُّ' },
                    { ar: 'الْقُرْآنِ».', id: 'اَلْقُرْآنْ»' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'حَالِ', id: 'حَالْ' },
                    { ar: 'عَدَمِ', id: 'تِيدَاكْ أَدَانْيَا' },
                    { ar: 'سَمَاعِهِ', id: 'مَنْدڠَارْنْيَا دِيَا (مَأْمُومْ) كَفَادَا' }
                ],
                [
                    { ar: 'الْإِمَامَ', id: 'إِمَامْ' },
                    { ar: 'تُعْتَبَرُ', id: 'دِيَاڠْگَافْ' },
                    { ar: 'الصَّلَاةُ', id: 'صَلَاةْ' },
                    { ar: 'كَأَنَّهَا', id: 'سَأَكَانْ٢ إِيَا' },
                    { ar: 'سِرِّيَّةٌ', id: 'فَلَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'حَقِّهِ.', id: 'حَقْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَهَذِهِ', id: 'مَاكَا أَدَافُونْ إِنِي' },
                    { ar: 'الْأَحَادِيثُ', id: 'حَدِيثْ٢' },
                    { ar: 'تَدُلُّ', id: 'مَنُونْجُوكْكَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'يَجْهَرُ', id: 'إِيَا مڠَرَاسْكَانْ' },
                    { ar: 'بِقِرَاءَتِهِ', id: 'دڠَنْ بَاچَاءَانْنْيَا' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'يَسْمَعُهَا', id: 'مَنْدڠَارْنْيَا' }
                ],
                [
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَضَرَ.', id: 'حَاضِيرْ' }
                ]
            ]
        }
    ],
    152: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَدَلَّ', id: 'دَانْ تَلَاهْ مَنُونْجُوكْكَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'السِّرِّ', id: 'فَلَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'غَيْرِ', id: 'سَلَائِينْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'ذُكِرَ،', id: 'تَلَاهْ دِيتُوتُورْكَانْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧١٣)،', id: '(٧١٣)' },
                    { ar: 'عَنْ', id: 'دَارِي' }
                ],
                [
                    { ar: 'خَبَّابٍ', id: 'خَبَّابْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ،', id: 'دَارِينْيَا' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْگُوهْ' },
                    { ar: 'سَأَلَهُ', id: 'تَلَاهْ بَرْتَانْيَا كَفَادَانْيَا' },
                    { ar: 'سَائِلٌ:', id: 'أَوْرَاڠْ يَڠْ بَرْتَانْيَا' },
                    { ar: 'أَكَانَ', id: 'أَفَكَاهْ أَدَا' },
                    { ar: 'رَسُولُ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'الظُّهْرِ', id: 'ظُهُورْ' },
                    { ar: 'وَالْعَصْرِ؟', id: 'دَانْ عَصَرْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'نَعَمْ،', id: 'إِيَا' },
                    { ar: 'قُلْنَا:', id: 'كَامِي بَرْكَاتَا' },
                    { ar: 'بِمَ', id: 'دڠَنْ أَفَا' },
                    { ar: 'كُنْتُمْ', id: 'أَدَالَاهْ كَالِيَانْ' },
                    { ar: 'تَعْرِفُونَ', id: 'كَالِيَانْ مڠَتَاهُويِي' },
                    { ar: 'ذَلِكَ؟', id: 'إِيتُو' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'بِاضْطِرَابِ', id: 'دڠَنْ بَرْگَرَأَكْنْيَا' }
                ],
                [
                    { ar: 'لِحْيَتِهِ.', id: 'جَڠْگُوتْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٨)؛', id: '(٧٣٨)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٣٩٦)،', id: '(٣٩٦)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'كُلِّ', id: 'تِيَافْ٢' },
                    { ar: 'صَلَاةٍ', id: 'صَلَاةْ' },
                    { ar: 'يَقْرَأُ،', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فَمَا', id: 'مَاكَا أَدَافُونْ يَڠْ' },
                    { ar: 'أَسْمَعَنَا', id: 'إِيَا مَمْفَرْدڠَارْكَانْ كَفَادَا كَامِي' },
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'أَسْمَعْنَاكُمْ', id: 'كَامِي مَمْفَرْدڠَارْكَانْ كَفَادَا كَالِيَانْ' }
                ],
                [
                    { ar: 'وَمَا', id: 'دَانْ أَدَافُونْ يَڠْ' },
                    { ar: 'أَخْفَى', id: 'إِيَا سَمْبُونْيِيكَانْ' },
                    { ar: 'عَنَّا', id: 'دَارِي كَامِي' },
                    { ar: 'أَخْفَيْنَا', id: 'كَامِي سَمْبُونْيِيكَانْ' },
                    { ar: 'عَنْكُمْ.', id: 'دَارِي كَالِيَانْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَلَمْ', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يَنْقُلِ', id: 'مَنُوكِيلْ' },
                    { ar: 'الصَّحَابَةُ', id: 'صَحَابَاتْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمْ', id: 'دَارِي مَرَكَ' },
                    { ar: 'الْجَهْرَ', id: 'مڠَرَاسْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'غَيْرِ', id: 'سَلَائِينْ' },
                    { ar: 'تِلْكَ', id: 'إِيتُو' },
                    { ar: 'الْمَوَاضِعِ.', id: 'تَمْفَاتْ٢' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَسَتَأْتِي', id: 'دَانْ أَكَانْ دَاتَاڠْ' },
                    { ar: 'أَدِلَّةُ', id: 'دَلِيلْ٢' },
                    { ar: 'الصَّلَوَاتِ', id: 'صَلَاةْ٢' },
                    { ar: 'الْخَاصَّةِ', id: 'خُصُوصْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'مَوَاضِعِهَا.', id: 'تَمْفَاتْ٢نْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُتَوَسَّطُ', id: 'دَانْ دِيتڠَاهِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'النَّفْلِ', id: 'سُنَّةْ' },
                    { ar: 'الْمُطْلَقِ', id: 'مُطْلَقْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'اللَّيْلِ', id: 'مَالَمْ' },
                    { ar: 'بَيْنَ', id: 'دِي أَنْتَارَا' },
                    { ar: 'السِّرِّ', id: 'فَلَانْ' },
                    { ar: 'وَالْجَهْرِ،', id: 'دَانْ كَرَاسْ' },
                    { ar: 'قَالَ', id: 'تَلَاهْ بَرْفِرْمَانْ' },
                    { ar: 'تَعَالَى:', id: 'مَهَا لُوهُورْ' }
                ],
                [
                    { ar: '﴿وَلَا', id: 'دَانْ جَاڠَانْلَاهْ' },
                    { ar: 'تَجْهَرْ', id: 'أڠْكَاوْ كَرَاسْكَانْ' },
                    { ar: 'بِصَلَاتِكَ', id: 'دڠَنْ صَلَاةْمُو' },
                    { ar: 'وَلَا', id: 'دَانْ جَاڠَانْلَاهْ' },
                    { ar: 'تُخَافِتْ', id: 'أڠْكَاوْ فَلَانْكَانْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'وَابْتَغِ', id: 'دَانْ چَارِيلَاهْ' },
                    { ar: 'بَيْنَ', id: 'دِي أَنْتَارَا' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'سَبِيلاً﴾', id: 'سَبُوَاهْ جَالَانْ' }
                ],
                [
                    { ar: '(سُورَةُ', id: 'سُورَةْ' },
                    { ar: 'الْإِسْرَاءِ:', id: 'اَلْإِسْرَاءْ' },
                    { ar: 'الْآيَةُ', id: 'أَيَاتْ' },
                    { ar: '١١٠).', id: '١١٠)' },
                    { ar: 'وَالْمُرَادُ', id: 'دَانْ أَدَافُونْ يَڠْ دِيمَكْسُودْ' },
                    { ar: 'صَلَاةُ', id: 'صَلَاةْ' },
                    { ar: 'اللَّيْلِ.', id: 'مَالَمْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٧', id: '٧' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّأْمِينُ', id: 'مَمْبَاچَا أَمِينْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'انْتِهَاءِ', id: 'سَلَسَايْ' },
                    { ar: 'الْفَاتِحَةِ:', id: 'اَلْفَاتِحَةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهُوَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يُتْبِعَ', id: 'إِيَا مڠِيرِيڠْكَانْ' },
                    { ar: 'قَوْلَهُ', id: 'فِرْمَانْنْيَا' },
                    { ar: 'تَعَالَى:', id: 'مَهَا لُوهُورْ' },
                    { ar: '﴿وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'الضَّالِّينَ﴾', id: 'أَوْرَاڠْ٢ يَڠْ تَرْسَسَاتْ' },
                    { ar: 'بِكَلِمَةِ', id: 'دڠَنْ كَلِمَاتْ' },
                    { ar: '«آمِينَ».', id: '«آمِينْ»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالتَّأْمِينُ', id: 'دَانْ أَدَافُونْ مَمْبَاچَا أَمِينْ' },
                    { ar: 'سُنَّةٌ', id: 'سُنَّةْ' },
                    { ar: 'لِكُلِّ', id: 'بَاگِي تِيَافْ٢' },
                    { ar: 'مُصَلٍّ', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'كُلِّ', id: 'تِيَافْ٢' },
                    { ar: 'صَلَاةٍ،', id: 'صَلَاةْ' },
                    { ar: 'يَجْهَرُ', id: 'إِيَا مڠَرَاسْكَانْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجَهْرِيَّةِ،', id: 'صَلَاةْ يَڠْ كَرَاسْ' }
                ],
                [
                    { ar: 'وَيُسِرُّ', id: 'دَانْ مَمَلَانْكَانْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'السِّرِّيَّةِ،', id: 'صَلَاةْ يَڠْ فَلَانْ' },
                    { ar: 'وَيَجْهَرُ', id: 'دَانْ مڠَرَاسْكَانْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'الْمَأْمُومُ', id: 'مَأْمُومْ' },
                    { ar: 'تَبَعاً', id: 'كَرَنَا إِيكُوتْ' },
                    { ar: 'لِلْإِمَامِ.', id: 'كَفَادَا إِمَامْ' },
                    { ar: 'وَمَعْنَى', id: 'دَانْ مَكْنَا' },
                    { ar: 'آمِينَ:', id: 'آمِينْ' }
                ],
                [
                    { ar: 'اسْتَجِبْ', id: 'كَابُولْكَانْلَاهْ' },
                    { ar: 'يَا', id: 'وَاهَايْ' },
                    { ar: 'رَبِّ.', id: 'تُوهَانْكُو' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٤٨)؛', id: '(٧٤٨)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤١٠)،', id: '(٤١٠)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'قَالَ', id: 'تَلَاهْ بَرْكَاتَا' },
                    { ar: 'أَحَدُكُمْ', id: 'سَالَاهْ سَاتُو دَارِي كَالِيَانْ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'رِوَايَةٍ', id: 'سَاطُو رِوَايَاتْ' }
                ],
                [
                    { ar: 'عِنْدَ', id: 'دِي سِيسِي' },
                    { ar: 'مُسْلِمٍ:', id: 'مُسْلِمْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'آمِينَ،', id: 'آمِينْ' },
                    { ar: 'وَقَالَتِ', id: 'دَانْ تَلَاهْ بَرْكَاتَا' },
                    { ar: 'الْمَلَائِكَةُ', id: 'مَلَائِكَةْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'السَّمَاءِ:', id: 'لَاڠِيتْ' },
                    { ar: 'آمِينَ،', id: 'آمِينْ' },
                    { ar: 'فَوَافَقَتْ', id: 'مَاكَا مَنْچُوَچُوكِي' }
                ],
                [
                    { ar: 'إِحْدَاهُمَا', id: 'سَالَاهْ سَاتُو دَارِي كَدُوَانْيَا' },
                    { ar: 'الْأُخْرَى،', id: 'يَڠْ لَائِينْ' },
                    { ar: 'غُفِرَ', id: 'دِيَامْفُونِي' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'تَقَدَّمَ', id: 'تَلَاهْ تَرْدَاهُولُو' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'ذَنْبِهِ».', id: 'دُوسَانْيَا»' }
                ]
            ]
        }
    ],
    153: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٤٧)؛', id: '(٧٤٧)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤١٠)،', id: '(٤١٠)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'أَمَّنَ', id: 'مَمْبَاچَا أَمِينْ' },
                    { ar: 'الإِمَامُ', id: 'إِمَامْ' },
                    { ar: 'فَأَمِّنُوا،', id: 'مَاكَا بَاچَالَاهْ أَمِينْ أَوْلَيهْ كَالِيَانْ' },
                    { ar: 'فَإِنَّ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا' },
                    { ar: 'مَنْ', id: 'بَارَاڠْسِيَافَا' },
                    { ar: 'وَافَقَ', id: 'تَلَاهْ مَنْچُوَچُوكِي' },
                    { ar: 'تَأْمِينُهُ', id: 'بَاچَاءَانْ أَمِينْنْيَا' },
                    { ar: 'تَأْمِينَ', id: 'بَاچَاءَانْ أَمِينْ' }
                ],
                [
                    { ar: 'المَلَائِكَةِ', id: 'مَلَائِكَةْ' },
                    { ar: 'غُفِرَ', id: 'دِيَامْفُونِي' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'تَقَدَّمَ', id: 'تَلَاهْ تَرْدَاهُولُو' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'ذَنْبِهِ».', id: 'دُوسَانْيَا»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٩٣٤)،', id: '(٩٣٤)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'تَلَا:', id: 'إِيَا مَمْبَاچَا' },
                    { ar: '﴿غَيْرِ', id: 'بُوكَانْ' },
                    { ar: 'المَغْضُوبِ', id: 'يَڠْ دِيمُورْكَائِي' },
                    { ar: 'عَلَيْهِمْ', id: 'أَتَاسْ مَرَكَ' },
                    { ar: 'وَلَا', id: 'دَانْ بُوكَانْ' },
                    { ar: 'الضَّالِّينَ﴾', id: 'أَوْرَاڠْ٢ يَڠْ تَرْسَسَاتْ' }
                ],
                [
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'آمِينَ،', id: 'آمِينْ' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' },
                    { ar: 'يَسْمَعَ', id: 'مَنْدڠَارْ' },
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'يَلِيهِ', id: 'أَدَا دِي دَكَاتْنْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الصَّفِّ', id: 'بَارِيسَانْ' },
                    { ar: 'الأَوَّلِ.', id: 'يَڠْ فَرْتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَزَادَ', id: 'دَانْ تَلَاهْ مَنَامْبَاهِي' },
                    { ar: 'ابْنُ', id: 'إِبْنُ' },
                    { ar: 'مَاجَهْ', id: 'مَاجَهْ' },
                    { ar: '(٨٥٣):', id: '(٨٥٣)' },
                    { ar: 'فَيَرْتَجُّ', id: 'مَاكَا بَرْگَمُورُوهْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'المَسْجِدُ.', id: 'مَسْجِدْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٨', id: '٨' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'قِرَاءَةُ', id: 'بَاچَاءَانْ' },
                    { ar: 'شَيْءٍ', id: 'سَسُوَاتُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْقُرْآنِ', id: 'اَلْقُرْآنْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'الْفَاتِحَةِ:', id: 'اَلْفَاتِحَةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَتَتَحَقَّقُ', id: 'دَانْ مَنْجَادِي نْيَاتَا' },
                    { ar: 'السُّنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'سُورَةٍ', id: 'سَاتُو سُورَةْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْقُرْآنِ', id: 'اَلْقُرْآنْ' },
                    { ar: 'مَهْمَا', id: 'بَتَافَافُونْ' },
                    { ar: 'قَصُرَتْ،', id: 'إِيَا فَنْدَكْ' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'ثَلَاثِ', id: 'تِيگَا' },
                    { ar: 'آيَاتٍ', id: 'أَيَاتْ٢' }
                ],
                [
                    { ar: 'مُتَوَالِيَاتٍ.', id: 'يَڠْ بَرْتُورُوتْ٢' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَمَكَانُ', id: 'دَانْ أَدَافُونْ تَمْفَاتْ' },
                    { ar: 'اسْتِحْبَابِهَا', id: 'كَسُنَّهَانْنْيَا' },
                    { ar: 'الرَّكْعَتَانِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'الْأُولَيَانِ', id: 'يَڠْ فَرْتَامَا' },
                    { ar: 'فَقَطْ', id: 'سَاجَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'كُلِّ', id: 'تِيَافْ٢' },
                    { ar: 'صَلَاةٍ،', id: 'صَلَاةْ' },
                    { ar: 'بِالنِّسْبَةِ', id: 'دڠَنْ دِينِسْبَاتْكَانْ' },
                    { ar: 'لِلْإِمَامِ،', id: 'بَاگِي إِمَامْ' }
                ],
                [
                    { ar: 'وَالْمُنْفَرِدِ', id: 'دَانْ يَڠْ سَنْدِيرِيَانْ' },
                    { ar: 'مُطْلَقاً.', id: 'سَچَارَا مُطْلَقْ' },
                    { ar: 'وَبِالنِّسْبَةِ', id: 'دَانْ دِينِسْبَاتْكَانْ' },
                    { ar: 'لِلْمُقْتَدِي', id: 'بَاگِي مَأْمُومْ' },
                    { ar: 'أَيْضاً', id: 'جُوغَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'السِّرِّيَّةِ،', id: 'سِرِّيَّةْ' }
                ],
                [
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'حَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'يَكُونُ', id: 'إِيَا أَدَا' },
                    { ar: 'بَعِيداً', id: 'جَاوُهْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَسْمَعُ', id: 'إِيَا مَنْدڠَارْ' },
                    { ar: 'قِرَاءَةَ', id: 'بَاچَاءَانْ' },
                    { ar: 'الْإِمَامِ.', id: 'إِمَامْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقْرَأَ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُوحْ' },
                    { ar: 'وَالظُّهْرِ', id: 'دَانْ ظُهُورْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'طِوَالِ', id: 'يَڠْ فَانْجَاڠْ٢' },
                    { ar: 'الْمُفَصَّلِ،', id: 'سُورَةْ٢ مُفَصَّلْ' },
                    { ar: 'كَالْحُجُرَاتِ،', id: 'سَفَرْتِي اَلْحُجُرَاتْ' }
                ],
                [
                    { ar: 'وَالرَّحْمَنِ،', id: 'دَانْ اَلرَّحْمَن' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'الْعَصْرِ', id: 'عَصَرْ' },
                    { ar: 'وَالْعِشَاءِ،', id: 'دَانْ عِشَاءْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَوَاسِطِهِ،', id: 'يَڠْ تڠَاهْ٢نْيَا' },
                    { ar: 'كَالشَّمْسِ', id: 'سَفَرْتِي اَلشَّمْسْ' },
                    { ar: 'وَضُحَاهَا،', id: 'وَضُحَاهَا' }
                ],
                [
                    { ar: 'وَاللَّيْلِ', id: 'دَانْ اَللَّيْل' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'يَغْشَى،', id: 'مَنُوتُوفِي' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'الْمَغْرِبِ', id: 'مَغْرِبْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'قِصَارِهِ،', id: 'يَڠْ فَنْدَكْ٢نْيَا' },
                    { ar: 'كَقُلْ', id: 'سَفَرْتِي قُلْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'أَحَدٌ.', id: 'يَڠْ مَهَا أَسَا' }
                ],
                [
                    { ar: 'لِحَدِيثِ', id: 'كَرَنَا حَدِيثْ' },
                    { ar: 'النَّسَائِيِّ', id: 'اَلنَّسَائِي' },
                    { ar: '(١٦٧/٢)،', id: '(١٦٧/٢)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'سُلَيْمَانَ', id: 'سُلَيْمَانْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'يَسَارٍ،', id: 'يَسَارْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' }
                ],
                [
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'مَا', id: 'تِيدَاكْلَاهْ' },
                    { ar: 'صَلَّيْتُ', id: 'أَكُو صَلَاةْ' },
                    { ar: 'وَرَاءَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'أَحَدٍ', id: 'سَسَأَوْرَاڠْ' },
                    { ar: 'أَشْبَهَ', id: 'يَڠْ لَبِيهْ مَنْيَرُوفَائِي' },
                    { ar: 'صَلَاةً', id: 'صَلَاةْنْيَا' }
                ],
                [
                    { ar: 'بِرَسُولِ', id: 'دڠَنْ رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'فُلَانٍ،', id: 'فُلَانْ' },
                    { ar: 'فَصَلَّيْنَا', id: 'مَاكَا كَامِي صَلَاةْ' },
                    { ar: 'وَرَاءَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'الْإِنْسَانِ،', id: 'مَانُوسِيَا' }
                ],
                [
                    { ar: 'وَكَانَ', id: 'دَانْ إِيَا أَدَا' },
                    { ar: 'يُطِيلُ', id: 'إِيَا مَمَانْجَاڠْكَانْ' },
                    { ar: 'الْأُولَيَيْنِ', id: 'دُوَ رَكَاعَاتْ فَرْتَامَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُورْ' },
                    { ar: 'وَيُخَفِّفُ', id: 'دَانْ مَرِيڠَانْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْأُخْرَيَيْنِ،', id: 'دُوَ رَكَاعَاتْ يَڠْ لَائِينْ' }
                ],
                [
                    { ar: 'وَيُخَفِّفُ', id: 'دَانْ مَرِيڠَانْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْعَصْرِ،', id: 'عَصَرْ' },
                    { ar: 'وَيَقْرَأُ', id: 'دَانْ مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْمَغْرِبِ', id: 'مَغْرِبْ' },
                    { ar: 'بِقِصَارِ', id: 'دڠَنْ سُورَةْ٢ فَنْدَكْ' },
                    { ar: 'الْمُفَصَّلِ،', id: 'مُفَصَّلْ' }
                ],
                [
                    { ar: 'وَيَقْرَأُ', id: 'دَانْ مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْعِشَاءِ', id: 'عِشَاءْ' },
                    { ar: 'بِالشَّمْسِ', id: 'دڠَنْ اَلشَّمْس' },
                    { ar: 'وَضُحَاهَا', id: 'وَضُحَاهَا' },
                    { ar: 'وَأَشْبَاهِهَا،', id: 'دَانْ يَڠْ مَنْيَرُوفَائِينْيَا' },
                    { ar: 'وَيَقْرَأُ', id: 'دَانْ مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُوحْ' }
                ],
                [
                    { ar: 'بِسُورَتَيْنِ', id: 'دڠَنْ دُوَ سُورَةْ' },
                    { ar: 'طَوِيلَتَيْنِ.', id: 'يَڠْ فَانْجَاڠْ' }
                ]
            ]
        }
    ],
    154: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَيْضاً', id: 'جُوغَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقْرَأَ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صُبْحِ', id: 'صُبُوحْ' },
                    { ar: 'الْجُمُعَةِ:', id: 'جُمْعَةْ' },
                    { ar: '﴿الٓمٓ', id: 'الٓمٓ' },
                    { ar: 'تَنزِيلَ﴾', id: 'تَنْزِيلَ' },
                    { ar: 'السَّجْدَةَ', id: 'اَلسَّجْدَة' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْأُولَى،', id: 'فَرْتَامَا' },
                    { ar: 'وَ﴿هَلْ', id: 'دَانْ ﴿هَلْ' },
                    { ar: 'أَتَى﴾', id: 'أَتَى﴾' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الثَّانِيَةِ.', id: 'كَدُوَ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٨٥١)؛', id: '(٨٥١)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٨٨٠)،', id: '(٨٨٠)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' }
                ],
                [
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'النَّبِيُّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجُمُعَةِ،', id: 'جُمْعَةْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ:', id: 'فَجَرْ' }
                ],
                [
                    { ar: '﴿الٓمٓ', id: 'الٓمٓ' },
                    { ar: 'تَنزِيلَ﴾', id: 'تَنْزِيلَ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'السَّجْدَةَ', id: 'اَلسَّجْدَة' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَ﴿هَلْ', id: 'دَانْ ﴿هَلْ' },
                    { ar: 'أَتَى', id: 'أَتَى' },
                    { ar: 'عَلَى', id: 'عَلَى' },
                    { ar: 'الإِنسَانِ﴾.', id: 'الإِنسَانِ﴾' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'تَطْوِيلُ', id: 'مَمَانْجَاڠْكَانْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْأُولَى', id: 'فَرْتَامَا' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الثَّانِيَةِ', id: 'كَدُوَ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'جَمِيعِ', id: 'سَلُورُوهْ' },
                    { ar: 'الصَّلَوَاتِ،', id: 'صَلَاةْ٢' }
                ],
                [
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٢٥)؛', id: '(٧٢٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٥١):', id: '(٤٥١)' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'النَّبِيُّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: '...', id: '...' },
                    { ar: 'يُطَوِّلُ', id: 'إِيَا مَمَانْجَاڠْكَانْ' }
                ],
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْأُولَى', id: 'فَرْتَامَا' },
                    { ar: 'وَيُقَصِّرُ', id: 'دَانْ إِيَا مَمَنْدَكْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الثَّانِيَةِ.', id: 'كَدُوَ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٩', id: '٩' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّكْبِيرُ', id: 'تَكْبِيرْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'الِانْتِقَالَاتِ:', id: 'فِينْدَاهْ٢' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'عَرَفْنَا', id: 'كَامِي تَلَاهْ مڠَتَاهُويِي' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'تَكْبِيرَةَ', id: 'تَكْبِيرْ' },
                    { ar: 'الْإِحْرَامِ', id: 'إِحْرَامْ' },
                    { ar: 'بِالصَّلَاةِ', id: 'دڠَنْ صَلَاةْ' },
                    { ar: 'رُكْنٌ', id: 'رُكُونْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'تَصِحُّ', id: 'سَاهْ' },
                    { ar: 'الصَّلَاةُ', id: 'صَلَاةْ' },
                    { ar: 'بِدُونِهِ.', id: 'تَانْفَانْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'دَخَلْتَ', id: 'أڠْكَاوْ مَاسُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'وَكَبَّرْتَ', id: 'دَانْ أڠْكَاوْ تَكْبِيرْ' },
                    { ar: 'تَكْبِيرَةَ', id: 'تَكْبِيرْ' },
                    { ar: 'الْإِحْرَامِ،', id: 'إِحْرَامْ' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'لَكَ', id: 'بَاگِيمُو' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'تُكَبِّرَ', id: 'أڠْكَاوْ تَكْبِيرْ' }
                ],
                [
                    { ar: 'مِثْلَهَا', id: 'سَفَرْتِينْيَا' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'كُلِّ', id: 'تِيَافْ٢' },
                    { ar: 'انْتِقَالٍ', id: 'فِينْدَاهْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الِانْتِقَالَاتِ،', id: 'فِينْدَاهْ٢' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'عَدَا', id: 'سَلَائِينْ' },
                    { ar: 'الرَّفْعَ', id: 'بَاڠُونْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوكْ' },
                    { ar: 'فَيُسَنُّ', id: 'مَاكَا دِيسُنَّهْكَانْ' },
                    { ar: 'بَدَلاً', id: 'سَبَاگَايْ گَانْتِي' }
                ],
                [
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'التَّكْبِيرِ', id: 'تَكْبِيرْ' },
                    { ar: 'قَوْلُ:', id: 'أُچَافَانْ' },
                    { ar: 'سَمِعَ', id: 'تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَمِدَهُ،', id: 'مَمُوجِينْيَا' },
                    { ar: 'رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'لَكَ', id: 'بَاگِي-مُو' },
                    { ar: 'الْحَمْدُ؛', id: 'سَگَالَا فُوجِي' },
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' }
                ],
                [
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٥٦)؛', id: '(٧٥٦)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٣٩٢)،', id: '(٣٩٢)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'قَامَ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَقُومُ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'وَيُكَبِّرُ', id: 'دَانْ إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَرْكَعُ،', id: 'إِيَا رُكُوكْ' }
                ],
                [
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يَقُولُ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«سَمِعَ', id: 'تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَمِدَهُ»', id: 'مَمُوجِينْيَا»' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يُقِيمُ', id: 'إِيَا مَنْدِيرِيكَانْ' },
                    { ar: 'صُلْبَهُ', id: 'فُوڠْگُوڠْنْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوكْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يَقُولُ', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'وَهُوَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'قَائِمٌ:', id: 'أَوْرَاڠْ يَڠْ بَرْدِيرِي' },
                    { ar: '«رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'وَلَكَ', id: 'دَانْ بَاگِي-مُو' },
                    { ar: 'الْحَمْدُ»', id: 'سَگَالَا فُوجِي»' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَهْوِي', id: 'إِيَا تُرُونْ' },
                    { ar: 'لِلسُّجُودِ،', id: 'أُونْتُوكْ سُجُودْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' }
                ],
                [
                    { ar: 'يَرْفَعُ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ،', id: 'كَفَالَانْيَا' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَسْجُدُ،', id: 'إِيَا سُجُودْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَرْفَعُ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ،', id: 'كَفَالَانْيَا' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يَفْعَلُ', id: 'إِيَا مَلَاكُوكَانْ' }
                ],
                [
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'كُلِّهَا', id: 'سَلُورُوهْنْيَا' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' },
                    { ar: 'يَقْضِيَهَا،', id: 'إِيَا مَمَنُوهِينْيَا' },
                    { ar: 'وَيُكَبِّرُ', id: 'دَانْ إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَقُومُ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الثِّنْتَيْنِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' }
                ],
                [
                    { ar: 'الْجُلُوسِ.', id: 'دُودُوكْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٠', id: '١٠' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّسْبِيحُ', id: 'تَسْبِيحْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوكْ' },
                    { ar: 'وَالسُّجُودِ:', id: 'دَانْ سُجُودْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّةُ', id: 'دَانْ أَدَافُونْ تَتَا چَارَا' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقُولَ', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'اسْتَقَرَّ', id: 'إِيَا مَنَتَافْ' },
                    { ar: 'رَاكِعاً:', id: 'حَالْ رُكُوكْ' },
                    { ar: 'سُبْحَانَ', id: 'مَهَا سُچِي' },
                    { ar: 'رَبِّيَ', id: 'تُوهَانْكُو' },
                    { ar: 'الْعَظِيمِ', id: 'يَڠْ مَهَا أَگُوڠْ' }
                ]
            ]
        }
    ],
    155: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَبِحَمْدِهِ', id: 'دَانْ دڠَنْ مَمُوجِينْيَا' },
                    { ar: '(ثَلَاثَ', id: '(تِيگَا' },
                    { ar: 'مَرَّاتٍ).', id: 'كَالِي).' },
                    { ar: 'وَأَنْ', id: 'دَانْ بَهْوَ' },
                    { ar: 'يَقُولَ', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'اسْتَقَرَّ', id: 'إِيَا مَنَتَافْ' },
                    { ar: 'سَاجِداً:', id: 'حَالْ سُجُودْ' },
                    { ar: 'سُبْحَانَ', id: 'مَهَا سُچِي' },
                    { ar: 'رَبِّيَ', id: 'تُوهَانْكُو' },
                    { ar: 'الْأَعْلَى', id: 'يَڠْ مَهَا لُوهُورْ' }
                ],
                [
                    { ar: 'وَبِحَمْدِهِ', id: 'دَانْ دڠَنْ مَمُوجِينْيَا' },
                    { ar: '(ثَلَاثَ', id: '(تِيگَا' },
                    { ar: 'مَرَّاتٍ).', id: 'كَالِي).' },
                    { ar: 'وَهَذَا', id: 'دَانْ أَدَافُونْ إِنِي' },
                    { ar: 'أَدْنَى', id: 'يَڠْ فَالِيڠْ رَنْدَاهْ' },
                    { ar: 'دَرَجَاتِ', id: 'دَرَجَاتْ' },
                    { ar: 'الْكَمَالِ،', id: 'كَسَمْفُورْنَاءَانْ' },
                    { ar: 'فَإِنْ', id: 'مَاكَا جِيكَا' },
                    { ar: 'زَادَ', id: 'إِيَا مَنَامْبَاهِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الثَّلَاثِ', id: 'تِيگَا' }
                ],
                [
                    { ar: 'كَانَ', id: 'أَدَايَا إِيَا' },
                    { ar: 'أَفْضَلَ.', id: 'لَبِيهْ أُتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[انْظُرِ', id: '[لِيهَاتْلَاهْ أَوْلَيهْمُو' },
                    { ar: 'الرُّكُوعَ', id: 'رُكُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْأَرْكَانِ].', id: 'رُكُونْ٢]' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١١', id: '١١' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَضْعُ', id: 'مَلَتَأَكْكَانْ' },
                    { ar: 'الْيَدَيْنِ', id: 'دُوَ تَاڠَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَوَّلِ', id: 'أَوَالْنْيَا' },
                    { ar: 'الْفَخِذَيْنِ', id: 'دُوَ فَاهَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'جِلْسَتَيِ', id: 'دُوَ دُودُوكْ' },
                    { ar: 'التَّشَهُّدِ:', id: 'تَشَهُّدْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّتُهُ', id: 'دَانْ أَدَافُونْ تَتَا چَارَانْيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَبْسُطَ', id: 'إِيَا مڠْهَامْفَارْكَانْ' },
                    { ar: 'الْيُسْرَى،', id: 'تَاڠَانْ كِيرِي' },
                    { ar: 'مَعَ', id: 'بَسَرْتَا' },
                    { ar: 'ضَمِّ', id: 'مڠُومْفُولْكَانْ' },
                    { ar: 'الْأَصَابِعِ', id: 'جَارِي٢' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'بَعْضِهَا،', id: 'سَبَاگِيَانْنْيَا' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'تَكُونُ', id: 'إِيَا أَدَا' }
                ],
                [
                    { ar: 'رُءُوسُ', id: 'كَفَالَا٢' },
                    { ar: 'الْأَصَابِعِ', id: 'جَارِي٢' },
                    { ar: 'مُسَامِتَةً', id: 'لُورُوسْ' },
                    { ar: 'لِأَوَّلِ', id: 'كَفَادَا فَرْمُولَاءَانْ' },
                    { ar: 'الرُّكْبَةِ،', id: 'لُوتُوتْ' },
                    { ar: 'وَيَقْبِضَ', id: 'دَانْ إِيَا مڠْگَڠْگَامْ' },
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'الْأُصْبُعَ', id: 'جَارِي' },
                    { ar: 'الْمُسَبِّحَةَ،', id: 'يَڠْ بَرْتَسْبِيحْ' }
                ],
                [
                    { ar: 'وَهِيَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُسَمَّى', id: 'دِينَامَاكَانْ' },
                    { ar: 'السَّبَّابَةَ،', id: 'تَلُونْجُوكْ' },
                    { ar: 'فَإِنَّهُ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'يَمُدُّهَا', id: 'إِيَا مَمَانْجَاڠْكَانْنْيَا' },
                    { ar: 'مُنْخَفِضَةً', id: 'مَنُونْدُوكْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'أَوَّلِ', id: 'أَوَالْنْيَا' },
                    { ar: 'التَّشَهُّدِ،', id: 'تَشَهُّدْ' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' }
                ],
                [
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'وَصَلَ', id: 'إِيَا تَلَاهْ سَامْفَايْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'قَوْلِهِ:', id: 'أُچَافَانْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'اللهُ،', id: 'اَلله' },
                    { ar: 'أَشَارَ', id: 'إِيَا بَرِشَارَاتْ' },
                    { ar: 'بِهَا،', id: 'دڠَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'التَّوْحِيدِ', id: 'تَوْحِيدْ' },
                    { ar: 'وَرَفَعَهَا.', id: 'دَانْ مڠَاڠْكَاتْنْيَا' }
                ],
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'تَبْقَى', id: 'إِيَا تَتَافْ' },
                    { ar: 'مَرْفُوعَةً', id: 'دِيَاڠْكَاتْ' },
                    { ar: 'دُونَ', id: 'تَانْفَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يُحَرِّكَهَا', id: 'إِيَا مڠْگَرَأَكْكَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'آخِرِ', id: 'أَخِيرْ' },
                    { ar: 'الصَّلَاةِ.', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٥٨٠)', id: '(٥٨٠)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'ابْنِ', id: 'إِبْنُ' },
                    { ar: 'عُمَرَ', id: 'عُمَرْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمَا', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'ـ', id: '-' }
                ],
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صِفَةِ', id: 'صِفَاتْ' },
                    { ar: 'جُلُوسِهِ', id: 'دُودُوكْنْيَا' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'جَلَسَ', id: 'إِيَا دُودُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ' }
                ],
                [
                    { ar: 'وَضَعَ', id: 'إِيَا مَلَتَأَكْكَانْ' },
                    { ar: 'كَفَّهُ', id: 'تَلَافَاكْ تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'فَخِذِهِ', id: 'فَاهَانْيَا' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' },
                    { ar: 'وَقَبَضَ', id: 'دَانْ إِيَا مڠْگَڠْگَامْ' },
                    { ar: 'أَصَابِعَهُ', id: 'جَارِي٢نْيَا' },
                    { ar: 'كُلَّهَا،', id: 'سَلُورُوهْنْيَا' }
                ],
                [
                    { ar: 'وَأَشَارَ', id: 'دَانْ إِيَا بَرِشَارَاتْ' },
                    { ar: 'بِإِصْبَعِهِ', id: 'دڠَنْ جَارِينْيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تَلِي', id: 'مڠِيرِيڠِي' },
                    { ar: 'الْإِبْهَامَ،', id: 'إِبُو جَارِي' },
                    { ar: 'وَوَضَعَ', id: 'دَانْ إِيَا مَلَتَأَكْكَانْ' },
                    { ar: 'كَفَّهُ', id: 'تَلَافَاكْ تَاڠَانْنْيَا' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'فَخِذِهِ', id: 'فَاهَانْيَا' },
                    { ar: 'الْيُسْرَى.', id: 'يَڠْ كِيرِي' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٢', id: '١٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّوَرُّكُ', id: 'دُودُوكْ تَوَرُّكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجَلْسَةِ', id: 'دُودُوكْ' },
                    { ar: 'الْأَخِيرَةِ', id: 'تَرَاخِيرْ' },
                    { ar: 'وَالِافْتِرَاشُ', id: 'دَانْ دُودُوكْ اِفْتِرَاشْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'غَيْرِهَا:', id: 'سَلَائِينْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'التَّوَرُّكُ:', id: 'أَدَافُونْ تَوَرُّكْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَجْلِسَ', id: 'دُودُوكْ' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'وَرِكِهِ', id: 'فِينْگُولْنْيَا' },
                    { ar: 'الْأَيْسَرِ،', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَأَنْ', id: 'دَانْ بَهْوَ' },
                    { ar: 'يَنْصِبَ', id: 'إِيَا مَنَگَأَكْكَانْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' }
                ],
                [
                    { ar: 'وَيُخْرِجَ', id: 'دَانْ إِيَا مڠَلُوَارْكَانْ' },
                    { ar: 'الرِّجْلَ', id: 'كَاكِي' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'تَحْتِهَا.', id: 'بَوَاهْنْيَا' },
                    { ar: 'وَالْوَرِكُ:', id: 'دَانْ أَدَافُونْ فِينْگُولْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'الْفَخِذُ.', id: 'فَاهَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالِافْتِرَاشُ:', id: 'دَانْ أَدَافُونْ اِفْتِرَاشْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَجْلِسَ', id: 'دُودُوكْ' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'كَعْبِ', id: 'مَاتَا كَاكِي' },
                    { ar: 'رِجْلِهِ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' }
                ],
                [
                    { ar: 'وَيَنْصِبَ', id: 'دَانْ مَنَگَأَكْكَانْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'رُءُوسِ', id: 'كَفَالَا٢' },
                    { ar: 'أَصَابِعِهَا.', id: 'جَارِي٢نْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٩٤)', id: '(٧٩٤)' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'حُمَيْدٍ', id: 'حُمَيْدْ' },
                    { ar: 'السَّاعِدِيِّ', id: 'اَلسَّاعِدِي' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'أَنَا', id: 'أَكُو' },
                    { ar: 'كُنْتُ', id: 'أَدَالَاهْ أَكُو' },
                    { ar: 'أَحْفَظَكُمْ', id: 'يَڠْ فَالِيڠْ حَفَالْ دِي أَنْتَارَا كَالِيَانْ' },
                    { ar: 'لِصَلَاةِ', id: 'بَاگِي صَلَاةْ' },
                    { ar: 'رَسُولِ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ...', id: 'ﷺ...' }
                ],
                [
                    { ar: 'وَفِيهِ:', id: 'دَانْ دِي دَالَمْنْيَا' },
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'جَلَسَ', id: 'إِيَا دُودُوكْ' }
                ]
            ]
        }
    ]
};
