const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new159 = `,
    159: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الْمُلْكُ', id: 'كَرَاجَاءَانْ' },
                    { ar: 'وَلَهُ', id: 'دَانْ بَاگِينْيَا' },
                    { ar: 'الْحَمْدُ،', id: 'سَگَالَا فُوجِي' },
                    { ar: 'وَهُوَ', id: 'دَانْ دِيَا' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' },
                    { ar: 'شَيْءٍ', id: 'سَسُوَاتُو' },
                    { ar: 'قَدِيرٌ.', id: 'يَڠْ مَهَا كُوَاسَا' },
                    { ar: 'غُفِرَتْ', id: 'دِيأَمْفُونِي' },
                    { ar: 'خَطَايَاهُ', id: 'كَسَالَاهَان٢نْيَا' }
                ],
                [
                    { ar: 'وَإِنْ', id: 'دَانْ مَسْكِيفُونْ' },
                    { ar: 'كَانَتْ', id: 'أَدَا إِيَا' },
                    { ar: 'مِثْلَ', id: 'سَمِيسَالْ' },
                    { ar: 'زَبَدِ', id: 'بُويِيهْ' },
                    { ar: 'الْبَحْرِ».', id: 'لَاوُتْ»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[خَطَايَاهُ:', id: '[كَسَالَاهَان٢نْيَا' },
                    { ar: 'الذُّنُوبُ', id: 'دَوْسَا٢' },
                    { ar: 'الصَّغِيرَةُ.', id: 'يَڠْ كَچِيلْ' },
                    { ar: 'زَبَدِ', id: 'بُويِيهْ' },
                    { ar: 'الْبَحْرِ:', id: 'لَاوُتْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'يَعْلُو', id: 'مَنِيڠْگِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'وَجْهِ', id: 'فَرْمُوكَاءَانْ' },
                    { ar: 'مَائِهِ', id: 'آيِرْنْيَا' }
                ],
                [
                    { ar: 'عِنْدَ', id: 'دِي سِيسِي' },
                    { ar: 'هَيَجَانِهِ', id: 'بَرْگَوْلَاكْنْيَا إِيَا' },
                    { ar: 'وَتَمَوُّجِهِ،', id: 'دَانْ بَرَوْمْبَاكْنْيَا إِيَا' },
                    { ar: 'وَالْمُرَادُ:', id: 'دَانْ أَدَافُونْ يَڠْ دِيمَاكْسُودْ' },
                    { ar: 'مَهْمَا', id: 'بَاگَيْمَانَافُونْ' },
                    { ar: 'كَانَتْ', id: 'أَدَا إِيَا' },
                    { ar: 'كَثِيرَةً].', id: 'يَڠْ بَانْيَاكْ]' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'التِّرْمِذِيُّ', id: 'تِرْمِذِي' },
                    { ar: '(٣٤٧٠)', id: '(٣٤٧٠)' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«مَنْ', id: 'بَارَاڠْسِيَافَا' },
                    { ar: 'قَالَ', id: 'إِيَا تَلَاهْ بَرْكَاتَا' },
                    { ar: 'دُبُرَ', id: 'دِي أَخِيرْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' }
                ],
                [
                    { ar: 'الْفَجْرِ', id: 'سُبُوهْ' },
                    { ar: 'وَهُوَ', id: 'دَانْ إِيَا' },
                    { ar: 'ثَانٍ', id: 'يَڠْ مَلِيفَاتْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَتَكَلَّمَ:', id: 'إِيَا بَرْبِچَارَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ أَدَا' },
                    { ar: 'إِلَهَ', id: 'تُوهَانْ' },
                    { ar: 'إِلَّا', id: 'سَلَائِينْ' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'وَحْدَهُ', id: 'سَنْدِيرِي إِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ أَدَا' }
                ],
                [
                    { ar: 'شَرِيكَ', id: 'سَكُوتُو' },
                    { ar: 'لَهُ،', id: 'بَاگِينْيَا' },
                    { ar: 'لَهُ', id: 'مِيلِيكْنْيَا' },
                    { ar: 'الْمُلْكُ', id: 'كَرَاجَاءَانْ' },
                    { ar: 'وَلَهُ', id: 'دَانْ بَاگِينْيَا' },
                    { ar: 'الْحَمْدُ', id: 'سَگَالَا فُوجِي' },
                    { ar: 'يُحْيِي', id: 'مڠْهِيدُوفْكَانْ إِيَا' },
                    { ar: 'وَيُمِيتُ', id: 'دَانْ مَمَاتِيكَانْ إِيَا' },
                    { ar: 'وَهُوَ', id: 'دَانْ دِيَا' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' },
                    { ar: 'شَيْءٍ', id: 'سَسُوَاتُو' }
                ],
                [
                    { ar: 'قَدِيرٌ؛', id: 'يَڠْ مَهَا كُوَاسَا' },
                    { ar: 'عَشْرَ', id: 'سَفُولُوهْ' },
                    { ar: 'مَرَّاتٍ،', id: 'كَالِي' },
                    { ar: 'كُتِبَ', id: 'دِيچَاتَاتْ' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'عَشْرُ', id: 'سَفُولُوهْ' },
                    { ar: 'حَسَنَاتٍ،', id: 'كَبَايِيكَان٢' },
                    { ar: 'وَمُحِيَ', id: 'دَانْ دِيهَافُوسْ' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'عَشْرُ', id: 'سَفُولُوهْ' },
                    { ar: 'سَيِّئَاتٍ،', id: 'كَبُرُوكَان٢' }
                ],
                [
                    { ar: 'وَرُفِعَ', id: 'دَانْ دِيأَڠْكَاتْ' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'عَشْرُ', id: 'سَفُولُوهْ' },
                    { ar: 'دَرَجَاتٍ،', id: 'دَرَاجَات٢' },
                    { ar: 'وَكَانَ', id: 'دَانْ أَدَا إِيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'يَوْمِهِ', id: 'هَارِينْيَا' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'كُلِّهِ', id: 'سَلُورُوهْنْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'حِرْزٍ', id: 'فَنْجَاگَاءَانْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' }
                ],
                [
                    { ar: 'مَكْرُوهٍ', id: 'يَڠْ دِيبَنْچِي' },
                    { ar: 'وَحُرِسَ', id: 'دَانْ دِيجَاگَا إِيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الشَّيْطَانِ».', id: 'شَيْطَانْ»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(١٥٢٢)،', id: '(١٥٢٢)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'مُعَاذِ', id: 'مُعَاذْ' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'جَبَلٍ', id: 'جَبَلْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' }
                ],
                [
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'أَخَذَ', id: 'إِيَا تَلَاهْ مَمَگَاڠْ' },
                    { ar: 'بِيَدِهِ', id: 'دڠَنْ تَاڠَانْنْيَا' },
                    { ar: 'وَقَالَ:', id: 'دَانْ إِيَا بَرْكَاتَا' },
                    { ar: '«يَا', id: 'وَهَايْ' },
                    { ar: 'مُعَاذُ،', id: 'مُعَاذْ' },
                    { ar: 'وَاللَّهِ', id: 'دَمِي اَلله' },
                    { ar: 'إِنِّي', id: 'سَسُوڠْگُوهْنْيَا أَكُو' },
                    { ar: 'لَأُحِبُّكَ،', id: 'سُوڠْگُوهْ أَكُو مَنْچِينْتَائِيمُو' },
                    { ar: 'فَقَالَ:', id: 'مَاكَا إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'أُوصِيكَ', id: 'أَكُو بَرْوَاسِيَاتْ كَفَادَامُو' },
                    { ar: 'يَا', id: 'وَهَايْ' },
                    { ar: 'مُعَاذُ', id: 'مُعَاذْ' },
                    { ar: 'لَا', id: 'جَاڠَانْلَاهْ' },
                    { ar: 'تَدَعَنَّ', id: 'أڠْكَاوْ بَنَارْ٢ مَنِيڠْگَالْكَانْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'دُبُرِ', id: 'أَخِيرْ' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' },
                    { ar: 'صَلَاةٍ', id: 'صَلَاةْ' },
                    { ar: 'تَقُولُ:', id: 'أڠْكَاوْ بَرْكَاتَا' },
                    { ar: 'اللَّهُمَّ', id: 'يَا اَلله' }
                ],
                [
                    { ar: 'أَعِنِّي', id: 'تَوْلَوْڠْلَاهْ أَكُو' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'ذِكْرِكَ', id: 'مڠِيڠَاتْمُو' },
                    { ar: 'وَشُكْرِكَ', id: 'دَانْ مَنْشُكُورِيمُو' },
                    { ar: 'وَحُسْنِ', id: 'دَانْ بَايِيكْنْيَا' },
                    { ar: 'عِبَادَتِكَ».', id: 'عِبَادَةْ فَادَامُو»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهُنَاكَ', id: 'دَانْ دِي سَانَا' },
                    { ar: 'أَدْعِيَةٌ', id: 'دُعَاء٢' },
                    { ar: 'وَأَذْكَارٌ', id: 'دَانْ ذِكِير٢' },
                    { ar: 'كَثِيرَةٌ', id: 'يَڠْ بَانْيَاكْ' },
                    { ar: 'وَرَدَتْ', id: 'تَلَاهْ دَاتَاڠْ إِيَا' },
                    { ar: 'عَقِبَ', id: 'سَهَابِيسْ' },
                    { ar: 'الصَّلَوَاتِ', id: 'صَلَاة٢' },
                    { ar: 'عَامَّةً،', id: 'حَالْ عُمُومْ' },
                    { ar: 'وَعَقِبَ', id: 'دَانْ سَهَابِيسْ' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' }
                ],
                [
                    { ar: 'صَلَاةٍ', id: 'صَلَاةْ' },
                    { ar: 'خَاصَّةً،', id: 'حَالْ خُصُوصْ' },
                    { ar: 'تُعْرَفُ', id: 'دِيكَتَاهُويِي إِيَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'كُتُبِ', id: 'كِتَاب٢' },
                    { ar: 'السُّنَّةِ', id: 'سُنَّهْ' },
                    { ar: 'وَكُتُبِ', id: 'دَانْ كِتَاب٢' },
                    { ar: 'الْأَذْكَارِ.', id: 'ذِكِيرْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٢', id: '٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَنْتَقِلَ', id: 'إِيَا بَرْفِينْدَاهْ' },
                    { ar: 'لِلنَّفْلِ', id: 'أُونْتُوكْ سُنَّهْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'مَوْضِعِ', id: 'تَمْفَاتْ' },
                    { ar: 'فَرْضِهِ،', id: 'فَرْضُونْيَا' },
                    { ar: 'لِتَكْثُرَ', id: 'سُفَايَا مَنْجَادِي بَانْيَاكْ' },
                    { ar: 'مَوَاضِعُ', id: 'تَمْفَات٢' },
                    { ar: 'السُّجُودِ،', id: 'سُجُودْ' }
                ],
                [
                    { ar: 'فَإِنَّهَا', id: 'مَاكَا سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'تَشْهَدُ', id: 'إِيَا مَنْجَادِي سَاكْسِي' },
                    { ar: 'لَهُ:', id: 'بَاگِينْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالْأَفْضَلُ', id: 'دَانْ أَدَافُونْ يَڠْ لَبِيهْ أُتَامَا' },
                    { ar: 'إِنْ', id: 'جِيكَا' },
                    { ar: 'صَلَّى', id: 'إِيَا صَلَاةْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْمَسْجِدِ', id: 'مَسْجِدْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَنْتَقِلَ', id: 'إِيَا بَرْفِينْدَاهْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'بَيْتِهِ،', id: 'رُومَاهْنْيَا' },
                    { ar: 'وَدَلِيلُ', id: 'دَانْ دَلِيلْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' }
                ],
                [
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا إِيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'بُخَارِي' },
                    { ar: '(٦٩٨)؛', id: '(٦٩٨)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٧٨١)،', id: '(٧٨١)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«فَصَلُّوا', id: 'مَاكَا صَلَاةْلَاهْ كَالِيَانْ' }
                ],
                [
                    { ar: 'أَيُّهَا', id: 'وَهَايْ' },
                    { ar: 'النَّاسُ', id: 'مَانُوسِيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'بُيُوتِكُمْ،', id: 'رُومَاه٢ كَالِيَانْ' },
                    { ar: 'فَإِنَّ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا' },
                    { ar: 'أَفْضَلَ', id: 'فَالِيڠْ أُتَامَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'صَلَاةُ', id: 'صَلَاةْ' },
                    { ar: 'الْمَرْءِ', id: 'سَسَأَوْرَاڠْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'بَيْتِهِ', id: 'رُومَاهْنْيَا' }
                ],
                [
                    { ar: 'إِلَّا', id: 'كَچُوَالِي' },
                    { ar: 'الْمَكْتُوبَةَ».', id: 'صَلَاةْ مَكْتُوبَةْ»' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new159);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 159 to data.js');
