const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new156 = `,
    156: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَتَيْنِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'جَلَسَ', id: 'إِيَا دُودُوكْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'رِجْلِهِ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَنَصَبَ', id: 'دَانْ إِيَا مَنَگَأَكْكَانْ' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' },
                    { ar: 'وَإِذَا', id: 'دَانْ أَفَابِيلَا' },
                    { ar: 'جَلَسَ', id: 'إِيَا دُودُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْآخِرَةِ', id: 'تَرَاخِيرْ' },
                    { ar: 'قَدَّمَ', id: 'إِيَا مَنْدَاهُولُوكَانْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَنَصَبَ', id: 'دَانْ إِيَا مَنَگَأَكْكَانْ' },
                    { ar: 'الْأُخْرَى،', id: 'يَڠْ لَائِينْ' },
                    { ar: 'وَقَعَدَ', id: 'دَانْ إِيَا دُودُوكْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'مَقْعَدَتِهِ.', id: 'تَمْفَاتْ دُودُوكْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[قَدَّمَ', id: '[إِيَا مَنْدَاهُولُوكَانْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُسْرَى:', id: 'يَڠْ كِيرِي' },
                    { ar: 'أَيْ', id: 'يَائِيتُو' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'تَحْتِ', id: 'بَوَاهْ' },
                    { ar: 'رِجْلِهِ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'مَنْصُوبَةً].', id: 'حَالْ دِيتَگَأَكْكَانْ]' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَعِنْدَ', id: 'دَانْ دِي سِيسِي' },
                    { ar: 'مُسْلِمٍ', id: 'مُسْلِمْ' },
                    { ar: '(٥٧٩)،', id: '(٥٧٩)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'عَبْدِاللَّهِ', id: 'عَبْدُ الله' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'الزُّبَيْرِ', id: 'زُبَيْرْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمَا:', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' }
                ],
                [
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'قَعَدَ', id: 'إِيَا دُودُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'جَعَلَ', id: 'إِيَا مَنْجَادِيكَانْ' },
                    { ar: 'قَدَمَهُ', id: 'تَلَافَاكْ كَاكِينْيَا' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'بَيْنَ', id: 'دِي أَنْتَارَا' },
                    { ar: 'فَخِذِهِ', id: 'فَاهَانْيَا' },
                    { ar: 'وَسَاقِهِ،', id: 'دَانْ بَتِيسْنْيَا' }
                ],
                [
                    { ar: 'وَفَرَشَ', id: 'دَانْ إِيَا مڠْهَامْفَارْكَانْ' },
                    { ar: 'قَدَمَهُ', id: 'تَلَافَاكْ كَاكِينْيَا' },
                    { ar: 'الْيُمْنَى.', id: 'يَڠْ كَانَانْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٣', id: '١٣' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الصَّلَوَاتُ', id: 'صَلَوَاتْ' },
                    { ar: 'الْإِبْرَاهِيمِيَّةُ', id: 'إِبْرَاهِيمِيَّةْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'الدُّعَاءُ', id: 'دُعَاءْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُّدْ' },
                    { ar: 'الْأَخِيرِ:', id: 'تَرَاخِيرْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'عَرَفْتَ', id: 'أڠْكَاوْ تَلَاهْ مڠَتَاهُويِي' },
                    { ar: 'فِيمَا', id: 'دِي دَالَمْ أَفَا يَڠْ' },
                    { ar: 'مَضَى', id: 'تَلَاهْ بَرْلَالُو' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'الصَّلَاةَ', id: 'صَلَوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'رُكْنٌ', id: 'رُكُونْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'جِلْسَةِ', id: 'دُودُوكْ' }
                ],
                [
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُّدْ' },
                    { ar: 'الْأَخِيرَةِ،', id: 'تَرَاخِيرْ' },
                    { ar: 'وَيَتَأَدَّى', id: 'دَانْ تَرْتُونَايْكَانْ' },
                    { ar: 'الرُّكْنُ', id: 'رُكُونْ' },
                    { ar: 'بِأَيِّ', id: 'دڠَنْ مَانَا سَاجَا' },
                    { ar: 'صِيغَةٍ', id: 'صِيغَةْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'أَمَّا', id: 'أَدَافُونْ' },
                    { ar: 'اخْتِيَارُ', id: 'مَمِيلِيهْ' },
                    { ar: 'الصَّلَوَاتِ', id: 'صَلَوَاتْ' },
                    { ar: 'الْإِبْرَاهِيمِيَّةِ', id: 'إِبْرَاهِيمِيَّةْ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْگُوهْ' },
                    { ar: 'مَضَى', id: 'تَلَاهْ بَرْلَالُو' },
                    { ar: 'ذِكْرُ', id: 'سَبُوتَانْ' },
                    { ar: 'نَصِّهَا', id: 'تَكْسْنْيَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'فَسُنَّةٌ.', id: 'مَاكَا إِيَا سُنَّهْ' }
                ],
                [
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'أَتَمَّهَا', id: 'إِيَا مَنْيَمْفُورْنَامَانْنْيَا' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَسْتَعِيذَ', id: 'إِيَا مَمُوهُونْ فَرْلِينْدُوڠَانْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'عَذَابِ', id: 'سِكْسَا' },
                    { ar: 'الْقَبْرِ،', id: 'كُبُورْ' },
                    { ar: 'وَمِنْ', id: 'دَانْ دَارِي' },
                    { ar: 'عَذَابِ', id: 'سِكْسَا' },
                    { ar: 'النَّارِ،', id: 'نَرَاكَا' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'مِنْ', id: 'دَارِي' }
                ],
                [
                    { ar: 'عَذَابِ', id: 'سِكْسَا' },
                    { ar: 'النَّارِ،', id: 'نَرَاكَا' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَدْعُوَ', id: 'إِيَا بَرْدُعَاءْ' },
                    { ar: 'لِنَفْسِهِ', id: 'بَاگِي دِيرِينْيَا' },
                    { ar: 'بِمَا', id: 'دڠَنْ أَفَا يَڠْ' },
                    { ar: 'شَاءَ؛', id: 'إِيَا كَهَنْدَاكِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يُطِيلَ', id: 'إِيَا مَمَانْجَاڠْكَانْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'قَدْرَ', id: 'أُكُورَانْ' }
                ],
                [
                    { ar: 'قِرَاءَةِ', id: 'بَچَاءَانْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُّدْ' },
                    { ar: 'وَالصَّلَاةِ', id: 'دَانْ صَلَوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٥٥٨)', id: '(٥٥٨)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'قَالَ', id: 'تَلَاهْ بَرْكَاتَا' }
                ],
                [
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ:', id: 'ﷺ' },
                    { ar: '«إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'فَرَغَ', id: 'تَلَاهْ سَلَسَايْ' },
                    { ar: 'أَحَدُكُمْ', id: 'سَالَاهْ سَأَوْرَاڠْ دَارِي كَالِيَانْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُّدْ' },
                    { ar: 'الْأَخِيرِ', id: 'تَرَاخِيرْ' },
                    { ar: 'فَلْيَتَعَوَّذْ', id: 'مَاكَا مَمُوهُونْ فَرْلِينْدُوڠَانْلَاهْ إِيَا' },
                    { ar: 'بِاللَّهِ', id: 'كَفَادَا اَلله' },
                    { ar: 'مِنْ', id: 'دَارِي' }
                ],
                [
                    { ar: 'أَرْبَعٍ:', id: 'أمْفَاتْ فَرْكَارَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'عَذَابِ', id: 'سِكْسَا' },
                    { ar: 'جَهَنَّمَ،', id: 'جَهَنَّمْ' },
                    { ar: 'وَمِنْ', id: 'دَانْ دَارِي' },
                    { ar: 'عَذَابِ', id: 'سِكْسَا' },
                    { ar: 'الْقَبْرِ،', id: 'كُبُورْ' },
                    { ar: 'وَمِنْ', id: 'دَانْ دَارِي' },
                    { ar: 'فِتْنَةِ', id: 'فِتْنَةْ' },
                    { ar: 'الْمَحْيَا', id: 'كَهِيدُوفَانْ' },
                    { ar: 'وَالْمَمَاتِ،', id: 'دَانْ كَمَاتِيَانْ' }
                ],
                [
                    { ar: 'وَمِنْ', id: 'دَانْ دَارِي' },
                    { ar: 'شَرِّ', id: 'كَبُرُوكَانْ' },
                    { ar: 'الْمَسِيحِ', id: 'مَسِيحْ' },
                    { ar: 'الدَّجَّالِ».', id: 'دَجَّالْ»' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٤', id: '١٤' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّسْلِيمَةُ', id: 'سَلَامْ' },
                    { ar: 'الثَّانِيَةُ:', id: 'كَدُوَ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ذَكَرْنَا', id: 'كَامِي تَلَاهْ مَنْيَبُوتْكَانْ' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'التَّسْلِيمَةَ', id: 'سَلَامْ' },
                    { ar: 'الْأُولَى', id: 'فَرْتَامَا' },
                    { ar: 'رُكْنٌ،', id: 'رُكُونْ' },
                    { ar: 'وَهِيَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تَكُونُ', id: 'إِيَا أَدَا' },
                    { ar: 'مَعَ', id: 'بَسَرْتَا' },
                    { ar: 'الِالْتِفَاتِ', id: 'مَنَوْلَيهْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' }
                ],
                [
                    { ar: 'جِهَةِ', id: 'أَرَاهْ' },
                    { ar: 'الْيَمِينِ.', id: 'كَانَانْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new156);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 156 to data.js');
