const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new154 = `,
    154: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَيْضاً', id: 'جُوغَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقْرَأَ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صُبْحِ', id: 'صُبُوحْ' },
                    { ar: 'الْجُمُعَةِ:', id: 'جُمْعَةْ' },
                    { ar: '﴿الٓمٓ', id: 'الٓمٓ' },
                    { ar: 'تَنزِيلَ﴾', id: 'تَنْزِيلَ' },
                    { ar: 'السَّجْدَةَ', id: 'اَلسَّجْدَة' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْأُولَى،', id: 'فَرْتَامَا' },
                    { ar: 'وَ﴿هَلْ', id: 'دَانْ ﴿هَلْ' },
                    { ar: 'أَتَى﴾', id: 'أَتَى﴾' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الثَّانِيَةِ.', id: 'كَدُوَ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٨٥١)؛', id: '(٨٥١)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٨٨٠)،', id: '(٨٨٠)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' }
                ],
                [
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'النَّبِيُّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجُمُعَةِ،', id: 'جُمْعَةْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ:', id: 'فَجَرْ' }
                ],
                [
                    { ar: '﴿الٓمٓ', id: 'الٓمٓ' },
                    { ar: 'تَنزِيلَ﴾', id: 'تَنْزِيلَ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'السَّجْدَةَ', id: 'اَلسَّجْدَة' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَ﴿هَلْ', id: 'دَانْ ﴿هَلْ' },
                    { ar: 'أَتَى', id: 'أَتَى' },
                    { ar: 'عَلَى', id: 'عَلَى' },
                    { ar: 'الإِنسَانِ﴾.', id: 'الإِنسَانِ﴾' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'تَطْوِيلُ', id: 'مَمَانْجَاڠْكَانْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْأُولَى', id: 'فَرْتَامَا' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الثَّانِيَةِ', id: 'كَدُوَ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'جَمِيعِ', id: 'سَلُورُوهْ' },
                    { ar: 'الصَّلَوَاتِ،', id: 'صَلَاةْ٢' }
                ],
                [
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٢٥)؛', id: '(٧٢٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٥١):', id: '(٤٥١)' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'النَّبِيُّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: '...', id: '...' },
                    { ar: 'يُطَوِّلُ', id: 'إِيَا مَمَانْجَاڠْكَانْ' }
                ],
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْأُولَى', id: 'فَرْتَامَا' },
                    { ar: 'وَيُقَصِّرُ', id: 'دَانْ إِيَا مَمَنْدَكْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الثَّانِيَةِ.', id: 'كَدُوَ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٩', id: '٩' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّكْبِيرُ', id: 'تَكْبِيرْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'الِانْتِقَالَاتِ:', id: 'فِينْدَاهْ٢' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'عَرَفْنَا', id: 'كَامِي تَلَاهْ مڠَتَاهُويِي' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'تَكْبِيرَةَ', id: 'تَكْبِيرْ' },
                    { ar: 'الْإِحْرَامِ', id: 'إِحْرَامْ' },
                    { ar: 'بِالصَّلَاةِ', id: 'دڠَنْ صَلَاةْ' },
                    { ar: 'رُكْنٌ', id: 'رُكُونْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'تَصِحُّ', id: 'سَاهْ' },
                    { ar: 'الصَّلَاةُ', id: 'صَلَاةْ' },
                    { ar: 'بِدُونِهِ.', id: 'تَانْفَانْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'دَخَلْتَ', id: 'أڠْكَاوْ مَاسُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'وَكَبَّرْتَ', id: 'دَانْ أڠْكَاوْ تَكْبِيرْ' },
                    { ar: 'تَكْبِيرَةَ', id: 'تَكْبِيرْ' },
                    { ar: 'الْإِحْرَامِ،', id: 'إِحْرَامْ' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'لَكَ', id: 'بَاگِيمُو' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'تُكَبِّرَ', id: 'أڠْكَاوْ تَكْبِيرْ' }
                ],
                [
                    { ar: 'مِثْلَهَا', id: 'سَفَرْتِينْيَا' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'كُلِّ', id: 'تِيَافْ٢' },
                    { ar: 'انْتِقَالٍ', id: 'فِينْدَاهْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الِانْتِقَالَاتِ،', id: 'فِينْدَاهْ٢' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'عَدَا', id: 'سَلَائِينْ' },
                    { ar: 'الرَّفْعَ', id: 'بَاڠُونْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوكْ' },
                    { ar: 'فَيُسَنُّ', id: 'مَاكَا دِيسُنَّهْكَانْ' },
                    { ar: 'بَدَلاً', id: 'سَبَاگَايْ گَانْتِي' }
                ],
                [
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'التَّكْبِيرِ', id: 'تَكْبِيرْ' },
                    { ar: 'قَوْلُ:', id: 'أُچَافَانْ' },
                    { ar: 'سَمِعَ', id: 'تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَمِدَهُ،', id: 'مَمُوجِينْيَا' },
                    { ar: 'رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'لَكَ', id: 'بَاگِي-مُو' },
                    { ar: 'الْحَمْدُ؛', id: 'سَگَالَا فُوجِي' },
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' }
                ],
                [
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٥٦)؛', id: '(٧٥٦)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٣٩٢)،', id: '(٣٩٢)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'قَامَ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَقُومُ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'وَيُكَبِّرُ', id: 'دَانْ إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَرْكَعُ،', id: 'إِيَا رُكُوكْ' }
                ],
                [
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يَقُولُ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«سَمِعَ', id: 'تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَمِدَهُ»', id: 'مَمُوجِينْيَا»' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يُقِيمُ', id: 'إِيَا مَنْدِيرِيكَانْ' },
                    { ar: 'صُلْبَهُ', id: 'فُوڠْگُوڠْنْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوكْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يَقُولُ', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'وَهُوَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'قَائِمٌ:', id: 'أَوْرَاڠْ يَڠْ بَرْدِيرِي' },
                    { ar: '«رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'وَلَكَ', id: 'دَانْ بَاگِي-مُو' },
                    { ar: 'الْحَمْدُ»', id: 'سَگَالَا فُوجِي»' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَهْوِي', id: 'إِيَا تُرُونْ' },
                    { ar: 'لِلسُّجُودِ،', id: 'أُونْتُوكْ سُجُودْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' }
                ],
                [
                    { ar: 'يَرْفَعُ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ،', id: 'كَفَالَانْيَا' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَسْجُدُ،', id: 'إِيَا سُجُودْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يُكَبِّرُ', id: 'إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَرْفَعُ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ،', id: 'كَفَالَانْيَا' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'يَفْعَلُ', id: 'إِيَا مَلَاكُوكَانْ' }
                ],
                [
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'كُلِّهَا', id: 'سَلُورُوهْنْيَا' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' },
                    { ar: 'يَقْضِيَهَا،', id: 'إِيَا مَمَنُوهِينْيَا' },
                    { ar: 'وَيُكَبِّرُ', id: 'دَانْ إِيَا تَكْبِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَقُومُ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الثِّنْتَيْنِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' }
                ],
                [
                    { ar: 'الْجُلُوسِ.', id: 'دُودُوكْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٠', id: '١٠' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّسْبِيحُ', id: 'تَسْبِيحْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوكْ' },
                    { ar: 'وَالسُّجُودِ:', id: 'دَانْ سُجُودْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّةُ', id: 'دَانْ أَدَافُونْ تَتَا چَارَا' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقُولَ', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'اسْتَقَرَّ', id: 'إِيَا مَنَتَافْ' },
                    { ar: 'رَاكِعاً:', id: 'حَالْ رُكُوكْ' },
                    { ar: 'سُبْحَانَ', id: 'مَهَا سُچِي' },
                    { ar: 'رَبِّيَ', id: 'تُوهَانْكُو' },
                    { ar: 'الْعَظِيمِ', id: 'يَڠْ مَهَا أَگُوڠْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new154);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 154 to data.js');
