const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new157 = `,
    157: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'فَعَلَهَا', id: 'إِيَا تَلَاهْ مَلَاكُوكَانْنْيَا' },
                    { ar: 'فَقَدِ', id: 'مَاكَا سُوڠْگُوهْ' },
                    { ar: 'انْتَهَتْ', id: 'تَلَاهْ سَلَسَايْ' },
                    { ar: 'أَرْكَانُ', id: 'رُكُون٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'وَوَاجِبَاتُهَا،', id: 'دَانْ كَوَاجِبَان٢نْيَا' },
                    { ar: 'إِلَّا', id: 'هَانْيَا سَاجَا' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' }
                ],
                [
                    { ar: 'يُضِيفَ', id: 'إِيَا مَنَامْبَاهْكَانْ' },
                    { ar: 'إِلَيْهَا', id: 'كَفَادَانْيَا' },
                    { ar: 'تَسْلِيمَةً', id: 'سَلَامْ' },
                    { ar: 'أُخْرَى،', id: 'يَڠْ لَائِينْ' },
                    { ar: 'مُلْتَفِتاً', id: 'حَالْ مَنَوْلَيهْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'جِهَةِ', id: 'أَرَاهْ' },
                    { ar: 'الْيَسَارِ.', id: 'كِيرِي' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٥٨٢)', id: '(٥٨٢)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'سَعْدٍ', id: 'سَعْدْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كُنْتُ', id: 'أَدَالَاهْ أَكُو' },
                    { ar: 'أَرَى', id: 'أَكُو مَلِيهَاتْ' }
                ],
                [
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يُسَلِّمُ', id: 'إِيَا بَرْسَلَامْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'يَمِينِهِ', id: 'كَانَانْنْيَا' },
                    { ar: 'وَعَنْ', id: 'دَانْ دَارِي' },
                    { ar: 'يَسَارِهِ', id: 'كِيرِينْيَا' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' },
                    { ar: 'أَرَى', id: 'أَكُو مَلِيهَاتْ' },
                    { ar: 'بَيَاضَ', id: 'فُوتِيهْنْيَا' },
                    { ar: 'خَدِّهِ.', id: 'فِيفِينْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٩٩٦)', id: '(٩٩٦)' },
                    { ar: 'وَغَيْرُهُ،', id: 'دَانْ سَلَائِينْنْيَا' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'ابْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'مَسْعُودٍ', id: 'مَسْعُودْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' }
                ],
                [
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'يُسَلِّمُ', id: 'إِيَا بَرْسَلَامْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'يَمِينِهِ', id: 'كَانَانْنْيَا' },
                    { ar: 'وَعَنْ', id: 'دَانْ دَارِي' },
                    { ar: 'شِمَالِهِ', id: 'كِيرِينْيَا' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' },
                    { ar: 'يُرَى', id: 'دِيلِيهَاتْ' },
                    { ar: 'بَيَاضُ', id: 'فُوتِيهْنْيَا' },
                    { ar: 'خَدِّهِ:', id: 'فِيفِينْيَا' }
                ],
                [
                    { ar: '«السَّلَامُ', id: 'كَسَلَامَاتَانْ' },
                    { ar: 'عَلَيْكُمْ', id: 'أَتَاسْ كَالِيَانْ' },
                    { ar: 'وَرَحْمَةُ', id: 'دَانْ رَحْمَةْ' },
                    { ar: 'اللَّهِ،', id: 'اَلله' },
                    { ar: 'السَّلَامُ', id: 'كَسَلَامَاتَانْ' },
                    { ar: 'عَلَيْكُمْ', id: 'أَتَاسْ كَالِيَانْ' },
                    { ar: 'وَرَحْمَةُ', id: 'دَانْ رَحْمَةْ' },
                    { ar: 'اللَّهِ».', id: 'اَلله' },
                    { ar: 'قَالَ', id: 'تَلَاهْ بَرْكَاتَا' }
                ],
                [
                    { ar: 'التِّرْمِذِيُّ:', id: 'تِرْمِذِي' },
                    { ar: 'حَدِيثُ', id: 'حَدِيثْ' },
                    { ar: 'ابْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'مَسْعُودٍ', id: 'مَسْعُودْ' },
                    { ar: 'حَدِيثٌ', id: 'حَدِيثْ' },
                    { ar: 'حَسَنٌ', id: 'يَڠْ حَسَنْ' },
                    { ar: 'صَحِيحٌ.', id: 'يَڠْ صَحِيحْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٥', id: '١٥' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْتِزَامُ', id: 'مَنَتَافْكَانْ' },
                    { ar: 'الْخُشُوعِ', id: 'خُشُوعْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'سَائِرِ', id: 'سَلُورُوهْ' },
                    { ar: 'الصَّلَاةِ:', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'مَعْنَى', id: 'مَعْنَى' },
                    { ar: 'الْخُشُوعِ:', id: 'خُشُوعْ' },
                    { ar: 'الْخُشُوعُ', id: 'أَدَافُونْ خُشُوعْ' },
                    { ar: 'يَقَظَةُ', id: 'بَاڠُونْنْيَا' },
                    { ar: 'الْقَلْبِ', id: 'هَاتِي' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'يُرَدِّدُهُ', id: 'مڠُولَاڠْنْيَا إِيَا' },
                    { ar: 'اللِّسَانُ', id: 'لِسَانْ' },
                    { ar: 'مِنَ', id: 'دَارِي' }
                ],
                [
                    { ar: 'الْقِرَاءَاتِ', id: 'بَچَاءَان٢' },
                    { ar: 'وَالْأَذْكَارِ', id: 'دَانْ ذِكِير٢' },
                    { ar: 'وَالْأَدْعِيَةِ؛', id: 'دَانْ دُعَاء٢' },
                    { ar: 'بِأَنْ', id: 'دڠَنْ بَهْوَ' },
                    { ar: 'يَتَدَبَّرَ', id: 'إِيَا مَرَنُوڠِي' },
                    { ar: 'كُلَّ', id: 'سَتِيَافْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'وَيَتَفَاعَلَ', id: 'دَانْ إِيَا بَرِئِنْتَرَكْسِي' },
                    { ar: 'مَعَ', id: 'بَسَرْتَا' },
                    { ar: 'مَعَانِيهِ،', id: 'مَعْنَى٢نْيَا' }
                ],
                [
                    { ar: 'وَيَشْعُرَ', id: 'دَانْ إِيَا مَرَاسَا' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'يُنَاجِي', id: 'إِيَا بَرْمُنَاجَاتْ' },
                    { ar: 'رَبَّهُ', id: 'تُوهَانْنْيَا' },
                    { ar: 'سُبْحَانَهُ', id: 'مَهَا سُچِي إِيَا' },
                    { ar: 'وَتَعَالَى.', id: 'دَانْ مَهَا تِيڠْگِي إِيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالصَّحِيحُ', id: 'دَانْ أَدَافُونْ يَڠْ صَحِيحْ' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'الْخُشُوعَ', id: 'خُشُوعْ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'بِهَذَا', id: 'دڠَنْ إِنِي' },
                    { ar: 'الْمَعْنَى', id: 'مَعْنَى' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'جُزْءٍ', id: 'بَاگِيَانْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَجْزَاءِ', id: 'بَاگِيَان٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' }
                ],
                [
                    { ar: 'أَمْرٌ', id: 'سُوَاتُو فَرْكَارَا' },
                    { ar: 'لَا بُدَّ', id: 'تِيدَاكْ بُولَيهْ تِيدَاكْ' },
                    { ar: 'مِنْهُ؛', id: 'دَارِينْيَا' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'كَانَتِ', id: 'أَدَا إِيَا' },
                    { ar: 'الْغَفْلَةُ', id: 'كَلَالَايَانْ' },
                    { ar: 'مُطْبِقَةً', id: 'حَالْ مَنُوتُوفِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'صَلَاتِهِ', id: 'صَلَاةْنْيَا' },
                    { ar: 'كُلِّهَا', id: 'سَلُورُوهْنْيَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَوَّلِهَا', id: 'أَوَالْنْيَا' }
                ],
                [
                    { ar: 'إِلَى', id: 'سَامْفَايْ' },
                    { ar: 'آخِرِهَا،', id: 'أَخِيرْنْيَا' },
                    { ar: 'كَانَتْ', id: 'أَدَا إِيَا' },
                    { ar: 'صَلَاةً', id: 'صَلَاةْ' },
                    { ar: 'بَاطِلَةً.', id: 'يَڠْ بَاتَالْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'أَمَّا', id: 'أَدَافُونْ' },
                    { ar: 'اسْتِمْرَارُ', id: 'كَلَاڠْسُوڠَانْ' },
                    { ar: 'الْخُشُوعِ', id: 'خُشُوعْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'سَائِرِ', id: 'سَلُورُوهْ' },
                    { ar: 'أَجْزَاءِ', id: 'بَاگِيَان٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'فَهُوَ', id: 'مَاكَا إِيَا' },
                    { ar: 'سُنَّةٌ', id: 'سُنَّهْ' },
                    { ar: 'مُكَمِّلَةٌ.', id: 'يَڠْ مَنْيَمْفُورْنَاكَانْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٢٢٨)،', id: '(٢٢٨)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'عُثْمَانَ', id: 'عُثْمَانْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدَڠَارْ' }
                ],
                [
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقُولُ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«مَا', id: 'تِيدَاكْلَاهْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'امْرِئٍ', id: 'سَسَأَوْرَاڠْ' },
                    { ar: 'مُسْلِمٍ', id: 'مُسْلِمْ' },
                    { ar: 'تَحْضُرُهُ', id: 'مڠْهَادِيرِينْيَا إِيَا' },
                    { ar: 'صَلَاةٌ', id: 'صَلَاةْ' },
                    { ar: 'مَكْتُوبَةٌ،', id: 'يَڠْ دِيوَاجِبْكَانْ' }
                ],
                [
                    { ar: 'فَيُحْسِنُ', id: 'مَاكَا إِيَا مَمْبَاگُوسْكَانْ' },
                    { ar: 'وُضُوءَهَا', id: 'وُضُوءْنْيَا' },
                    { ar: 'وَخُشُوعَهَا', id: 'دَانْ خُشُوعْنْيَا' },
                    { ar: 'وَرُكُوعَهَا،', id: 'دَانْ رُكُوعْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَچُوَالِي' },
                    { ar: 'كَانَتْ', id: 'إِيَا أَدَا' },
                    { ar: 'كَفَّارَةً', id: 'فَنَبُوسْ' },
                    { ar: 'لِمَا', id: 'بَاگِي أَفَا يَڠْ' },
                    { ar: 'قَبْلَهَا', id: 'سَبَلُومْنْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' }
                ],
                [
                    { ar: 'الذُّنُوبِ', id: 'دَوْسَا٢' },
                    { ar: 'مَا', id: 'سَلَاگِي' },
                    { ar: 'لَمْ', id: 'تِيدَاكْ' },
                    { ar: 'يُؤْتِ', id: 'إِيَا مَلَاكُوكَانْ' },
                    { ar: 'كَبِيرَةً،', id: 'دَوْسَا بَسَارْ' },
                    { ar: 'وَذَلِكَ', id: 'دَانْ إِيتُو' },
                    { ar: 'الدَّهْرَ', id: 'مَاسَا' },
                    { ar: 'كُلَّهُ».', id: 'سَلُورُوهْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[يُؤْتِ:', id: '[إِيَا مَلَاكُوكَانْ' },
                    { ar: 'يَعْمَلْ.', id: 'إِيَا مڠَرْجَاكَانْ' },
                    { ar: 'كَبِيرَةً:', id: 'دَوْسَا بَسَارْ' },
                    { ar: 'ذَنْباً', id: 'دَوْسَا' },
                    { ar: 'كَبِيراً', id: 'يَڠْ بَسَارْ' },
                    { ar: 'كَالتَّعَامُلِ', id: 'سَفَرْتِي بَرْتْرَانْسَاكْسِي' },
                    { ar: 'بِالرِّبَا', id: 'دڠَنْ رِبَا' },
                    { ar: 'وَشُرْبِ', id: 'دَانْ مَمِينُومْ' },
                    { ar: 'الْخَمْرِ', id: 'خَمَرْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new157);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 157 to data.js');
