const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new149 = `,
    149: [
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٢', id: '٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَضْعُ', id: 'مَلَتَاكْكَانْ' },
                    { ar: 'يَدِهِ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'ظَهْرِ', id: 'فُوڠْگُوڠْ' },
                    { ar: 'يَدِهِ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَذَلِكَ', id: 'دَانْ إِيتُو' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْوُقُوفِ:', id: 'بَرْدِيرِي' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّةُ', id: 'دَانْ أَدَافُونْ تَاَتَا چَارَا' },
                    { ar: 'ذَلِكَ:', id: 'إِيتُو' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَضَعَ', id: 'إِيَا مَلَتَاكْكَانْ' },
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'ظَهْرِ', id: 'فُوڠْگُوڠْ' },
                    { ar: 'كَفِّ', id: 'تَلَافَاكْ تَاڠَانْ' },
                    { ar: 'وَرُسْغِ', id: 'دَانْ فَرْگَلَاڠَانْ' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' }
                ],
                [
                    { ar: 'وَيَقْبِضَ', id: 'دَانْ إِيَا مڠْگڠْگَامْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'بِأَصَابِعِ', id: 'دڠَنْ جَارِي٢' },
                    { ar: 'يَدِهِ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' },
                    { ar: 'وَيَكُونَ', id: 'دَانْ أَدَا' },
                    { ar: 'مَحَلُّ', id: 'تَمْفَاتْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'تَحْتَ', id: 'دِي بَاوَاهْ' }
                ],
                [
                    { ar: 'صَدْرِهِ', id: 'دَادَانْيَا' },
                    { ar: 'وَفَوْقَ', id: 'دَانْ دِي أَتَاسْ' },
                    { ar: 'سُرَّتِهِ.', id: 'فُوسَارْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'لِخَبَرِ', id: 'كَرَنَا خَبَارْ' },
                    { ar: 'مُسْلِمٍ', id: 'مُسْلِمْ' },
                    { ar: '(٤٠١)،', id: '(٤٠١)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'وَائِلِ', id: 'وَائِلْ' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'حُجْرٍ', id: 'حُجْر' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' }
                ],
                [
                    { ar: 'رَأَى', id: 'إِيَا تَلَاهْ مَلِيهَاتْ' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'رَفَعَ', id: 'إِيَا تَلَاهْ مڠَاڠْكَاتْ' },
                    { ar: 'يَدَيْهِ', id: 'كَدُوَ تَاڠَانْنْيَا' },
                    { ar: 'حِينَ', id: 'كَِتيكَا' },
                    { ar: 'دَخَلَ', id: 'إِيَا مَاسُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ...', id: 'صَلَاةْ' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'وَضَعَ', id: 'إِيَا مَلَتَاكْكَانْ' }
                ],
                [
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الْيُسْرَى.', id: 'يَڠْ كِيرِي' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَعِنْدَ', id: 'دَانْ دِي سِيسِي' },
                    { ar: 'النَّسَائِيِّ', id: 'اَلنَّسَائِي' },
                    { ar: '(١٢٦/٢):', id: '(١٢٦/٢)' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'وَضَعَ', id: 'إِيَا مَلَتَاكْكَانْ' },
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'كَفِّهِ', id: 'تَلَافَاكْ تَاڠَانْنْيَا' }
                ],
                [
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَالرُّسْغِ', id: 'دَانْ فَرْگَلَاڠَانْ' },
                    { ar: 'وَالسَّاعِدِ.', id: 'دَانْ لڠَانْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٣', id: '٣' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'النَّظَرُ', id: 'مَلِيهَاتْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'مَوْضِعِ', id: 'تَمْفَاتْ' },
                    { ar: 'السُّجُودِ:', id: 'سُجُودْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَيُكْرَهُ', id: 'مَاكَا دِيمَكْرُوهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَتَوَزَّعَ', id: 'تَرْبَاگِي' },
                    { ar: 'نَظَرُهُ', id: 'فَانْدَاڠَانْنْيَا' },
                    { ar: 'فِيمَا', id: 'دِي دَالَمْ أَفَا يَڠْ' },
                    { ar: 'حَوْلَهُ،', id: 'سَكِيتَارْنْيَا' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَنْظُرَ', id: 'إِيَا مَلِيهَاتْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' }
                ],
                [
                    { ar: 'الْأَعْلَى', id: 'يَڠْ أَتَاسْ' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'شَيْءٍ', id: 'سَسُوَاتُو' },
                    { ar: 'أَمَامَهُ', id: 'دِي دَفَانْنْيَا' },
                    { ar: 'حَتَّى', id: 'سَهِيڠْگَا' },
                    { ar: 'وَلَوْ', id: 'دَانْ وَالَاوْفُونْ' },
                    { ar: 'كَانَ', id: 'أَدَا' },
                    { ar: 'الْكَعْبَةَ؛', id: 'كَعْبَةْ' },
                    { ar: 'بَلْ', id: 'بَاهْكَانْ' }
                ],
                [
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَجْعَلَ', id: 'إِيَا مَنْجَادِيكَانْ' },
                    { ar: 'نَظَرَهُ', id: 'فَانْدَاڠَانْنْيَا' },
                    { ar: 'الدَّائِمَ', id: 'يَڠْ تَرُوسْ مَنَرُوسْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'مَوْضِعِ', id: 'تَمْفَاتْ' },
                    { ar: 'سُجُودِهِ،', id: 'سُجُودْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَچُوَالِي' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'التَّشَهُّدِ،', id: 'تَشَهُدْ' }
                ],
                [
                    { ar: 'فَلْيَجْعَلْ', id: 'مَاكَا هَنْدَاكْلَاهْ إِيَا مَنْجَادِيكَانْ' },
                    { ar: 'نَظَرَهُ', id: 'فَانْدَاڠَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'سَبَّابَتِهِ', id: 'تَلُونْجُوكْنْيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'يُشِيرُ', id: 'إِيَا بَرِشَارَاتْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'التَّشَهُّدِ.', id: 'تَشَهُدْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'دَلِيلُ', id: 'دَلِيلْ' },
                    { ar: 'ذَلِكَ:', id: 'إِيتُو' },
                    { ar: 'اتِّبَاعُ', id: 'مڠِيكُوتِي' },
                    { ar: 'فِعْلِ', id: 'فَرْبُوَاتَانْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٤', id: '٤' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'افْتِتَاحُ', id: 'فَمْبُوكَاءَانْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّكْبِيرِ', id: 'تَكْبِيرْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'التَّوَجُّهِ:', id: 'تَوَجُّهْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَلَفْظُهُ،', id: 'دَانْ لَفَظْنْيَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٧٧١)،', id: '(٧٧١)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'عَلِيٍّ', id: 'عَلِي' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'عَنْ', id: 'دَارِي' }
                ],
                [
                    { ar: 'رَسُولِ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ:', id: 'ﷺ' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'كَانَ', id: 'أَدَالَاهْ إِيَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'قَامَ', id: 'إِيَا بَرْدِيرِي' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«وَجَّهْتُ', id: 'أَكُو مڠْهَادَافْكَانْ' }
                ],
                [
                    { ar: 'وَجْهِيَ', id: 'وَجَاهْكُو' },
                    { ar: 'لِلَّذِي', id: 'بَاگِي ذَاتْ يَڠْ' },
                    { ar: 'فَطَرَ', id: 'مَنْچِفْتَاكَانْ' },
                    { ar: 'السَّمَوَاتِ', id: 'بَبَرَافَا لَاڠِيتْ' },
                    { ar: 'وَالْأَرْضَ', id: 'دَانْ بُومِي' },
                    { ar: 'حَنِيفاً', id: 'حَالْ لُورُوسْ' },
                    { ar: 'وَمَا', id: 'دَانْ تِيدَاكْلَاهْ' },
                    { ar: 'أَنَا', id: 'أَكُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُشْرِكِينَ،', id: 'أَوْرَاڠْ٢ مُشْرِكْ' }
                ],
                [
                    { ar: 'إِنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'صَلَاتِي', id: 'صَلَاةْكُو' },
                    { ar: 'وَنُسُكِي', id: 'دَانْ إِبَادَاهْكُو' },
                    { ar: 'وَمَحْيَايَ', id: 'دَانْ هِيدُوفْكُو' },
                    { ar: 'وَمَمَاتِي', id: 'دَانْ مَاتِيكُو' },
                    { ar: 'لِلَّهِ', id: 'بَاگِي اَلله' },
                    { ar: 'رَبِّ', id: 'تُوهَانْ' },
                    { ar: 'الْعَالَمِينَ،', id: 'عَالَمْ سَمَسْتَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ أَدَا' }
                ],
                [
                    { ar: 'شَرِيكَ', id: 'سَكُوتُو' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'وَبِذَلِكَ', id: 'دَانْ دڠَنْ إِيتُو' },
                    { ar: 'أُمِرْتُ', id: 'أَكُو دِيفَرِينْتَاهْ' },
                    { ar: 'وَأَنَا', id: 'دَانْ أَكُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُسْلِمِينَ».', id: 'أَوْرَاڠْ٢ مُسْلِمْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new149);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 149 to data.js');
