const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new158 = `,
    158: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَنَحْوِ', id: 'دَانْ سَأُومْفَامَا' },
                    { ar: 'ذَلِكَ.', id: 'إِيتُو' },
                    { ar: 'وَذَلِكَ', id: 'دَانْ إِيتُو' },
                    { ar: 'الدَّهْرَ', id: 'مَاسَا' },
                    { ar: 'كُلَّهُ:', id: 'سَلُورُوهْنْيَا' },
                    { ar: 'أَيْ', id: 'يَائِيتُو' },
                    { ar: 'تَكْفِيرُ', id: 'فڠْهَافُوسَانْ' },
                    { ar: 'الذُّنُوبِ', id: 'دَوْسَا٢' },
                    { ar: 'الصَّغِيرَةِ', id: 'يَڠْ كَچِيلْ' },
                    { ar: 'بِسَبَبِ', id: 'دڠَنْ سَبَابْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' }
                ],
                [
                    { ar: 'مُسْتَمِرٌّ', id: 'تَرُوسْ مَنَرُوسْ' },
                    { ar: 'طَوَالَ', id: 'سَفَانْجَاڠْ' },
                    { ar: 'الْعُمْرِ', id: 'أُمُورْ' },
                    { ar: 'لِتَكَرُّرِ', id: 'كَارَنَا بَرُؤلَاڠْنْيَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'كُلَّ', id: 'سَتِيَافْ' },
                    { ar: 'يَوْمٍ].', id: 'هَارِي]' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَهَذِهِ', id: 'مَاكَا إِنِي' },
                    { ar: 'السُّنَنُ', id: 'كَسُنَّاهَان٢' },
                    { ar: 'كُلُّهَا', id: 'سَمُوَانْيَا' },
                    { ar: 'تُسَمَّى', id: 'دِينَامَاكَانْ' },
                    { ar: 'هَيْئَاتٍ،', id: 'هَيْئَاتْ' },
                    { ar: 'فَلَوْ', id: 'مَاكَا سَأَنْدَايْنْيَا' },
                    { ar: 'تَرَكَ', id: 'مَنِيڠْگَالْكَانْ' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'شَيْئاً', id: 'سَسُوَاتُو' },
                    { ar: 'مِنْهَا', id: 'دَارِينْيَا' }
                ],
                [
                    { ar: 'لَمْ', id: 'تِيدَاكْ' },
                    { ar: 'يُسَنَّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'جَبْرُهُ', id: 'مَنَامْبَالْنْيَا' },
                    { ar: 'بِالسُّجُودِ', id: 'دڠَنْ سُجُودْ' },
                    { ar: 'لِلسَّهْوِ،', id: 'كَارَنَا لُوفَا' },
                    { ar: 'بِخِلَافِ', id: 'دڠَنْ بَرْبَيدَا' },
                    { ar: 'الْقِسْمِ', id: 'فَمْبَاگِيَانْ' },
                    { ar: 'الْأَوَّلِ', id: 'فَرْتَامَا' },
                    { ar: 'وَهُوَ', id: 'دَانْ دِيَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'يُسَمَّى', id: 'دِينَامَاكَانْ' }
                ],
                [
                    { ar: 'أَبْعَاضاً،', id: 'أَبْعَاضْ' },
                    { ar: 'فَإِنَّ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا' },
                    { ar: 'الْمُصَلِّيَ', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'تَرَكَ', id: 'إِيَا مَنِيڠْگَالْكَانْ' },
                    { ar: 'شَيْئاً', id: 'سَسُوَاتُو' },
                    { ar: 'مِنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يُعَوِّضَهُ', id: 'إِيَا مڠْگَانْتِينْيَا' },
                    { ar: 'بِالسُّجُودِ', id: 'دڠَنْ سُجُودْ' }
                ],
                [
                    { ar: 'لِلسَّهْوِ.', id: 'كَارَنَا لُوفَا' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '(ج)', id: '(ج)' },
                    { ar: 'السُّنَنُ', id: 'كَسُنَّاهَان٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَانْ' },
                    { ar: 'عَقِبَ', id: 'سَهَابِيسْ' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' },
                    { ar: 'صَلَاةٍ:', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'عَقِبَ', id: 'سَهَابِيسْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْأُمُورُ', id: 'فَرْكَارَا٢' },
                    { ar: 'التَّالِيَةُ:', id: 'يَڠْ بَرِيكُوتْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١', id: '١' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الِاسْتِغْفَارُ', id: 'إِسْتِغْفَارْ' },
                    { ar: 'وَالذِّكْرُ', id: 'دَانْ ذِكِيرْ' },
                    { ar: 'وَالدُّعَاءُ:', id: 'دَانْ دُعَاءْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٥٩١)،', id: '(٥٩١)' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'انْصَرَفَ', id: 'إِيَا بَرْفَالِيڠْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'صَلَاتِهِ', id: 'صَلَاةْنْيَا' }
                ],
                [
                    { ar: 'اسْتَغْفَرَ', id: 'إِيَا مَمُوهُونْ أَمْفُونْ' },
                    { ar: 'اللَّهَ', id: 'كَفَادَا اَلله' },
                    { ar: 'ثَلَاثاً،', id: 'تِيگَا كَالِي' },
                    { ar: 'وَقَالَ:', id: 'دَانْ إِيَا بَرْكَاتَا' },
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' },
                    { ar: 'أَنْتَ', id: 'أڠْكَاوْ' },
                    { ar: 'السَّلَامُ', id: 'كَسَجَاهْتَرَاءَانْ' },
                    { ar: 'وَمِنْكَ', id: 'دَانْ دَارِيمُو' },
                    { ar: 'السَّلَامُ،', id: 'كَسَجَاهْتَرَاءَانْ' },
                    { ar: 'تَبَارَكْتَ', id: 'مَهَا سُچِي أڠْكَاوْ' }
                ],
                [
                    { ar: 'يَا', id: 'وَهَايْ' },
                    { ar: 'ذَا', id: 'ذَاتْ يَڠْ مَمِيلِيكِي' },
                    { ar: 'الْجَلَالِ', id: 'كَأَگُوڠَانْ' },
                    { ar: 'وَالْإِكْرَامِ».', id: 'دَانْ كَمُولِيَاءَانْ»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ أَدَا' },
                    { ar: 'مَانِعَ', id: 'لَارَاڠَانْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'رَفْعِ', id: 'مڠَاڠْكَاتْ' },
                    { ar: 'الصَّوْتِ', id: 'سُوَارَا' },
                    { ar: 'بِذَلِكَ', id: 'دڠَنْ حَالْ إِيتُو' },
                    { ar: 'لِلْإِمَامِ', id: 'بَاگِي إِمَامْ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'أَرَادَ', id: 'إِيَا مڠْهَنْدَاكِي' },
                    { ar: 'التَّعْلِيمَ،', id: 'فَمْبَلَاجَارَانْ' },
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' }
                ],
                [
                    { ar: 'تَعَلَّمُوا', id: 'مَرَيْكَا تَلَاهْ بَلَاجَارْ' },
                    { ar: 'خَفَضَ،', id: 'إِيَا مَرَنْدَاهْكَانْ' },
                    { ar: 'فَقَدْ', id: 'مَاكَا سُوڠْگُوهْ' },
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'بُخَارِي' },
                    { ar: '(٨٠٥)؛', id: '(٨٠٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٥٨٣)،', id: '(٥٨٣)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'ابْنِ', id: 'أَنَاكْ لَاكِي٢' }
                ],
                [
                    { ar: 'عَبَّاسٍ', id: 'عَبَّاسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمَا', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'أَخْبَرَ:', id: 'إِيَا مڠَابَارْكَانْ' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'رَفْعَ', id: 'مڠَاڠْكَاتْ' },
                    { ar: 'الصَّوْتِ', id: 'سُوَارَا' },
                    { ar: 'بِالذِّكْرِ', id: 'دڠَنْ ذِكِيرْ' },
                    { ar: 'حِينَ', id: 'كَتِيكَا' },
                    { ar: 'يَنْصَرِفُ', id: 'بَرْفَالِيڠْ' },
                    { ar: 'النَّاسُ', id: 'مَانُوسِيَا' }
                ],
                [
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمَكْتُوبَةِ', id: 'صَلَاةْ مَكْتُوبَةْ' },
                    { ar: 'كَانَ', id: 'أَدَا حَالْ إِيتُو' },
                    { ar: 'عَلَى', id: 'فَادَا' },
                    { ar: 'عَهْدِ', id: 'مَاسَا' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٥٩٦)،', id: '(٥٩٦)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'كَعْبِ', id: 'كَعْبْ' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'عُجْرَةَ', id: 'عُجْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' }
                ],
                [
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'قَالَ:', id: 'تَلَاهْ بَرْكَاتَا' },
                    { ar: '«مُعَقِّبَاتٌ', id: 'حَال٢ يَڠْ مڠِيكُوتِي' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَخِيبُ', id: 'رُگِي' },
                    { ar: 'قَائِلُهُنَّ', id: 'أَوْرَاڠْ يَڠْ مڠُوچَافْكَانْنْيَا' },
                    { ar: 'دُبُرَ', id: 'دِي أَخِيرْ' },
                    { ar: 'كُلِّ', id: 'سَتِيَافْ' },
                    { ar: 'صَلَاةٍ', id: 'صَلَاةْ' },
                    { ar: 'مَكْتُوبَةٍ:', id: 'يَڠْ دِيوَاجِبْكَانْ' },
                    { ar: 'ثَلَاثٌ', id: 'تِيگَا' }
                ],
                [
                    { ar: 'وَثَلَاثُونَ', id: 'دَانْ تِيگَا فُولُوهْ' },
                    { ar: 'تَسْبِيحَةً،', id: 'تَسْبِيحْ' },
                    { ar: 'وَثَلَاثٌ', id: 'دَانْ تِيگَا' },
                    { ar: 'وَثَلَاثُونَ', id: 'دَانْ تِيگَا فُولُوهْ' },
                    { ar: 'تَحْمِيدَةً،', id: 'تَحْمِيدْ' },
                    { ar: 'وَثَلَاثٌ', id: 'دَانْ تِيگَا' },
                    { ar: 'وَثَلَاثُونَ', id: 'دَانْ تِيگَا فُولُوهْ' },
                    { ar: 'تَكْبِيرَةً».', id: 'تَكْبِيرْ»' },
                    { ar: 'وَمِنْ', id: 'دَانْ دَارِي' }
                ],
                [
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: '(٥٩٧)', id: '(٥٩٧)' },
                    { ar: '«وَكَبَّرَ', id: 'دَانْ إِيَا بَرْتَكْبِيرْ' },
                    { ar: 'اللَّهَ', id: 'كَفَادَا اَلله' },
                    { ar: 'ثَلَاثاً', id: 'تِيگَا' },
                    { ar: 'وَثَلَاثِينَ،', id: 'دَانْ تِيگَا فُولُوهْ' },
                    { ar: 'فَتِلْكَ', id: 'مَاكَا إِيتُو' }
                ],
                [
                    { ar: 'تِسْعَةٌ', id: 'سَمْبِيلَانْ' },
                    { ar: 'وَتِسْعُونَ،', id: 'دَانْ سَمْبِيلَانْ فُولُوهْ' },
                    { ar: 'وَقَالَ', id: 'دَانْ إِيَا بَرْكَاتَا' },
                    { ar: 'تَمَامَ', id: 'كَسَمْفُورْنَاءَانْ' },
                    { ar: 'الْمِائَةِ:', id: 'سَرَاتُوسْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ أَدَا' },
                    { ar: 'إِلَهَ', id: 'تُوهَانْ' },
                    { ar: 'إِلَّا', id: 'سَلَائِينْ' },
                    { ar: 'اللَّهُ', id: 'اَلله' },
                    { ar: 'وَحْدَهُ', id: 'سَنْدِيرِي إِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ أَدَا' },
                    { ar: 'شَرِيكَ', id: 'سَكُوتُو' },
                    { ar: 'لَهُ،', id: 'بَاگِينْيَا' },
                    { ar: 'لَهُ', id: 'مِيلِيكْنْيَا' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new158);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 158 to data.js');
