const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new155 = `,
    155: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَبِحَمْدِهِ', id: 'دَانْ دڠَنْ مَمُوجِينْيَا' },
                    { ar: '(ثَلَاثَ', id: '(تِيگَا' },
                    { ar: 'مَرَّاتٍ).', id: 'كَالِي).' },
                    { ar: 'وَأَنْ', id: 'دَانْ بَهْوَ' },
                    { ar: 'يَقُولَ', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'اسْتَقَرَّ', id: 'إِيَا مَنَتَافْ' },
                    { ar: 'سَاجِداً:', id: 'حَالْ سُجُودْ' },
                    { ar: 'سُبْحَانَ', id: 'مَهَا سُچِي' },
                    { ar: 'رَبِّيَ', id: 'تُوهَانْكُو' },
                    { ar: 'الْأَعْلَى', id: 'يَڠْ مَهَا لُوهُورْ' }
                ],
                [
                    { ar: 'وَبِحَمْدِهِ', id: 'دَانْ دڠَنْ مَمُوجِينْيَا' },
                    { ar: '(ثَلَاثَ', id: '(تِيگَا' },
                    { ar: 'مَرَّاتٍ).', id: 'كَالِي).' },
                    { ar: 'وَهَذَا', id: 'دَانْ أَدَافُونْ إِنِي' },
                    { ar: 'أَدْنَى', id: 'يَڠْ فَالِيڠْ رَنْدَاهْ' },
                    { ar: 'دَرَجَاتِ', id: 'دَرَجَاتْ' },
                    { ar: 'الْكَمَالِ،', id: 'كَسَمْفُورْنَاءَانْ' },
                    { ar: 'فَإِنْ', id: 'مَاكَا جِيكَا' },
                    { ar: 'زَادَ', id: 'إِيَا مَنَامْبَاهِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'الثَّلَاثِ', id: 'تِيگَا' }
                ],
                [
                    { ar: 'كَانَ', id: 'أَدَايَا إِيَا' },
                    { ar: 'أَفْضَلَ.', id: 'لَبِيهْ أُتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[انْظُرِ', id: '[لِيهَاتْلَاهْ أَوْلَيهْمُو' },
                    { ar: 'الرُّكُوعَ', id: 'رُكُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْأَرْكَانِ].', id: 'رُكُونْ٢]' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١١', id: '١١' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَضْعُ', id: 'مَلَتَأَكْكَانْ' },
                    { ar: 'الْيَدَيْنِ', id: 'دُوَ تَاڠَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَوَّلِ', id: 'أَوَالْنْيَا' },
                    { ar: 'الْفَخِذَيْنِ', id: 'دُوَ فَاهَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'جِلْسَتَيِ', id: 'دُوَ دُودُوكْ' },
                    { ar: 'التَّشَهُّدِ:', id: 'تَشَهُّدْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَكَيْفِيَّتُهُ', id: 'دَانْ أَدَافُونْ تَتَا چَارَانْيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَبْسُطَ', id: 'إِيَا مڠْهَامْفَارْكَانْ' },
                    { ar: 'الْيُسْرَى،', id: 'تَاڠَانْ كِيرِي' },
                    { ar: 'مَعَ', id: 'بَسَرْتَا' },
                    { ar: 'ضَمِّ', id: 'مڠُومْفُولْكَانْ' },
                    { ar: 'الْأَصَابِعِ', id: 'جَارِي٢' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'بَعْضِهَا،', id: 'سَبَاگِيَانْنْيَا' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'تَكُونُ', id: 'إِيَا أَدَا' }
                ],
                [
                    { ar: 'رُءُوسُ', id: 'كَفَالَا٢' },
                    { ar: 'الْأَصَابِعِ', id: 'جَارِي٢' },
                    { ar: 'مُسَامِتَةً', id: 'لُورُوسْ' },
                    { ar: 'لِأَوَّلِ', id: 'كَفَادَا فَرْمُولَاءَانْ' },
                    { ar: 'الرُّكْبَةِ،', id: 'لُوتُوتْ' },
                    { ar: 'وَيَقْبِضَ', id: 'دَانْ إِيَا مڠْگَڠْگَامْ' },
                    { ar: 'يَدَهُ', id: 'تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'الْأُصْبُعَ', id: 'جَارِي' },
                    { ar: 'الْمُسَبِّحَةَ،', id: 'يَڠْ بَرْتَسْبِيحْ' }
                ],
                [
                    { ar: 'وَهِيَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُسَمَّى', id: 'دِينَامَاكَانْ' },
                    { ar: 'السَّبَّابَةَ،', id: 'تَلُونْجُوكْ' },
                    { ar: 'فَإِنَّهُ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'يَمُدُّهَا', id: 'إِيَا مَمَانْجَاڠْكَانْنْيَا' },
                    { ar: 'مُنْخَفِضَةً', id: 'مَنُونْدُوكْ' },
                    { ar: 'عِنْدَ', id: 'كَتِيكَا' },
                    { ar: 'أَوَّلِ', id: 'أَوَالْنْيَا' },
                    { ar: 'التَّشَهُّدِ،', id: 'تَشَهُّدْ' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' }
                ],
                [
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'وَصَلَ', id: 'إِيَا تَلَاهْ سَامْفَايْ' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'قَوْلِهِ:', id: 'أُچَافَانْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'اللهُ،', id: 'اَلله' },
                    { ar: 'أَشَارَ', id: 'إِيَا بَرِشَارَاتْ' },
                    { ar: 'بِهَا،', id: 'دڠَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'التَّوْحِيدِ', id: 'تَوْحِيدْ' },
                    { ar: 'وَرَفَعَهَا.', id: 'دَانْ مڠَاڠْكَاتْنْيَا' }
                ],
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'تَبْقَى', id: 'إِيَا تَتَافْ' },
                    { ar: 'مَرْفُوعَةً', id: 'دِيَاڠْكَاتْ' },
                    { ar: 'دُونَ', id: 'تَانْفَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يُحَرِّكَهَا', id: 'إِيَا مڠْگَرَأَكْكَانْنْيَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'آخِرِ', id: 'أَخِيرْ' },
                    { ar: 'الصَّلَاةِ.', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'مُسْلِمٌ', id: 'مُسْلِمْ' },
                    { ar: '(٥٨٠)', id: '(٥٨٠)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'ابْنِ', id: 'إِبْنُ' },
                    { ar: 'عُمَرَ', id: 'عُمَرْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمَا', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'ـ', id: '-' }
                ],
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صِفَةِ', id: 'صِفَاتْ' },
                    { ar: 'جُلُوسِهِ', id: 'دُودُوكْنْيَا' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'جَلَسَ', id: 'إِيَا دُودُوكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ' }
                ],
                [
                    { ar: 'وَضَعَ', id: 'إِيَا مَلَتَأَكْكَانْ' },
                    { ar: 'كَفَّهُ', id: 'تَلَافَاكْ تَاڠَانْنْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'فَخِذِهِ', id: 'فَاهَانْيَا' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' },
                    { ar: 'وَقَبَضَ', id: 'دَانْ إِيَا مڠْگَڠْگَامْ' },
                    { ar: 'أَصَابِعَهُ', id: 'جَارِي٢نْيَا' },
                    { ar: 'كُلَّهَا،', id: 'سَلُورُوهْنْيَا' }
                ],
                [
                    { ar: 'وَأَشَارَ', id: 'دَانْ إِيَا بَرِشَارَاتْ' },
                    { ar: 'بِإِصْبَعِهِ', id: 'دڠَنْ جَارِينْيَا' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تَلِي', id: 'مڠِيرِيڠِي' },
                    { ar: 'الْإِبْهَامَ،', id: 'إِبُو جَارِي' },
                    { ar: 'وَوَضَعَ', id: 'دَانْ إِيَا مَلَتَأَكْكَانْ' },
                    { ar: 'كَفَّهُ', id: 'تَلَافَاكْ تَاڠَانْنْيَا' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'فَخِذِهِ', id: 'فَاهَانْيَا' },
                    { ar: 'الْيُسْرَى.', id: 'يَڠْ كِيرِي' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '١٢', id: '١٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'التَّوَرُّكُ', id: 'دُودُوكْ تَوَرُّكْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجَلْسَةِ', id: 'دُودُوكْ' },
                    { ar: 'الْأَخِيرَةِ', id: 'تَرَاخِيرْ' },
                    { ar: 'وَالِافْتِرَاشُ', id: 'دَانْ دُودُوكْ اِفْتِرَاشْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'غَيْرِهَا:', id: 'سَلَائِينْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'التَّوَرُّكُ:', id: 'أَدَافُونْ تَوَرُّكْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَجْلِسَ', id: 'دُودُوكْ' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'وَرِكِهِ', id: 'فِينْگُولْنْيَا' },
                    { ar: 'الْأَيْسَرِ،', id: 'يَڠْ كِيرِي' },
                    { ar: 'وَأَنْ', id: 'دَانْ بَهْوَ' },
                    { ar: 'يَنْصِبَ', id: 'إِيَا مَنَگَأَكْكَانْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُمْنَى،', id: 'يَڠْ كَانَانْ' }
                ],
                [
                    { ar: 'وَيُخْرِجَ', id: 'دَانْ إِيَا مڠَلُوَارْكَانْ' },
                    { ar: 'الرِّجْلَ', id: 'كَاكِي' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'تَحْتِهَا.', id: 'بَوَاهْنْيَا' },
                    { ar: 'وَالْوَرِكُ:', id: 'دَانْ أَدَافُونْ فِينْگُولْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'الْفَخِذُ.', id: 'فَاهَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالِافْتِرَاشُ:', id: 'دَانْ أَدَافُونْ اِفْتِرَاشْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَجْلِسَ', id: 'دُودُوكْ' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'كَعْبِ', id: 'مَاتَا كَاكِي' },
                    { ar: 'رِجْلِهِ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُسْرَى', id: 'يَڠْ كِيرِي' }
                ],
                [
                    { ar: 'وَيَنْصِبَ', id: 'دَانْ مَنَگَأَكْكَانْ' },
                    { ar: 'رِجْلَهُ', id: 'كَاكِينْيَا' },
                    { ar: 'الْيُمْنَى', id: 'يَڠْ كَانَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'رُءُوسِ', id: 'كَفَالَا٢' },
                    { ar: 'أَصَابِعِهَا.', id: 'جَارِي٢نْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٩٤)', id: '(٧٩٤)' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'حُمَيْدٍ', id: 'حُمَيْدْ' },
                    { ar: 'السَّاعِدِيِّ', id: 'اَلسَّاعِدِي' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'أَنَا', id: 'أَكُو' },
                    { ar: 'كُنْتُ', id: 'أَدَالَاهْ أَكُو' },
                    { ar: 'أَحْفَظَكُمْ', id: 'يَڠْ فَالِيڠْ حَفَالْ دِي أَنْتَارَا كَالِيَانْ' },
                    { ar: 'لِصَلَاةِ', id: 'بَاگِي صَلَاةْ' },
                    { ar: 'رَسُولِ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ...', id: 'ﷺ...' }
                ],
                [
                    { ar: 'وَفِيهِ:', id: 'دَانْ دِي دَالَمْنْيَا' },
                    { ar: 'فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'جَلَسَ', id: 'إِيَا دُودُوكْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new155);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 155 to data.js');
