const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new151 = `,
    151: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٥)؛', id: '(٧٣٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٦٣)،', id: '(٤٦٣)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'جُبَيْرِ', id: 'جُبَيْرْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'مُطْعِمٍ', id: 'مُطْعِمْ' }
                ],
                [
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'الْمَغْرِبَ', id: 'مَغْرِبْ' },
                    { ar: 'بِالطُّورِ.', id: 'دڠَنْ سُورَةْ اَلطُّورْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٣)؛', id: '(٧٣٣)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٦٤)،', id: '(٤٦٤)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'الْبَرَاءِ', id: 'اَلْبَرَاءْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْرَأُ:', id: 'إِيَا مَمْبَاچَا' },
                    { ar: '﴿وَالتِّينِ', id: 'وَالتِّينِ' },
                    { ar: 'وَالزَّيْتُونِ﴾', id: 'وَالزَّيْتُونِ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْعِشَاءِ،', id: 'عِشَاءْ' }
                ],
                [
                    { ar: 'وَمَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'سَمِعْتُ', id: 'أَكُو تَلَاهْ مَنْدڠَارْ' },
                    { ar: 'أَحَداً', id: 'سَسَأَوْرَاڠْ' },
                    { ar: 'أَحْسَنَ', id: 'يَڠْ لَبِيهْ بَاگُوسْ' },
                    { ar: 'صَوْتاً', id: 'سُوَارَانْيَا' },
                    { ar: 'مِنْهُ،', id: 'دَارِينْيَا' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'قِرَاءَةً.', id: 'بَاچَاءَانْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'ـ', id: '-' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'تَلَاهْ مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٣٩)؛', id: '(٧٣٩)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٤٩)،', id: '(٤٤٩)' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'ابْنِ', id: 'إِبْنُ' }
                ],
                [
                    { ar: 'عَبَّاسٍ', id: 'عَبَّاسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'فِي', id: 'فَادَا' },
                    { ar: 'حُضُورِ', id: 'كَحَادِيرَانْ' },
                    { ar: 'الْجِنِّ', id: 'جِنْ' },
                    { ar: 'وَاسْتِمَاعِهِمُ', id: 'دَانْ مَنْدڠَارْنْيَا مَرَكَ' },
                    { ar: 'الْقُرْآنَ', id: 'اَلْقُرْآنْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' }
                ],
                [
                    { ar: 'وَفِيهِ:', id: 'دَانْ دِي دَالَمْنْيَا' },
                    { ar: 'وَهُوَ', id: 'دَانْ أَدَافُونْ إِيَا' },
                    { ar: 'يُصَلِّي', id: 'إِيَا صَلَاةْ' },
                    { ar: 'بِأَصْحَابِهِ', id: 'دڠَنْ صَحَابَاتْنْيَا' },
                    { ar: 'صَلَاةَ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ،', id: 'فَجَرْ' },
                    { ar: 'فَلَمَّا', id: 'مَاكَا تَتْكَالَا' },
                    { ar: 'سَمِعُوا', id: 'مَرَكَ مَنْدڠَارْ' },
                    { ar: 'الْقُرْآنَ', id: 'اَلْقُرْآنْ' },
                    { ar: 'اسْتَمَعُوا', id: 'مَرَكَ مَنْدڠَارْكَانْ' },
                    { ar: 'لَهُ.', id: 'كَفَادَانْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٤٥)؛', id: '(٧٤٥)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤٥١)،', id: '(٤٥١)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'قَتَادَةَ', id: 'قَتَادَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ:', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'يَقْرَأُ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'بِأُمِّ', id: 'دڠَنْ أُمُّ' },
                    { ar: 'الْكِتَابِ', id: 'اَلْكِتَابْ' },
                    { ar: 'وَسُورَةٍ', id: 'دَانْ سُورَةْ' },
                    { ar: 'مَعَهَا،', id: 'بَسَرْتَانْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَتَيْنِ', id: 'دُوَ رَكَاعَاتْ' }
                ],
                [
                    { ar: 'الْأُولَيَيْنِ', id: 'يَڠْ فَرْتَامَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُورْ' },
                    { ar: 'وَصَلَاةِ', id: 'دَانْ صَلَاةْ' },
                    { ar: 'الْعَصْرِ.', id: 'عَصَرْ' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'رِوَايَةٍ:', id: 'سَاطُو رِوَايَاتْ' },
                    { ar: 'وَهَكَذَا', id: 'دَانْ سَفَرْتِي إِنِيلَاهْ' },
                    { ar: 'يَفْعَلُ', id: 'إِيَا مَلَاكُوكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'الصُّبْحِ.', id: 'صُبُوحْ' },
                    { ar: 'مَعَ', id: 'بَسَرْتَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'سَبَقَ', id: 'تَلَاهْ تَرْدَاهُولُو' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَحَادِيثِ', id: 'حَدِيثْ٢' },
                    { ar: 'الْجَهْرِ', id: 'مڠَرَاسْكَانْ' },
                    { ar: 'بِالْقِرَاءَةِ.', id: 'دڠَنْ بَاچَاءَانْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٨٢٣', id: '(٨٢٣' },
                    { ar: 'وَ٨٢٤)؛', id: 'دَانْ ٨٢٤)' },
                    { ar: 'وَالنَّسَائِيُّ', id: 'دَانْ اَلنَّسَائِي' },
                    { ar: '(١٤١/٢)', id: '(١٤١/٢)' },
                    { ar: 'وَغَيْرُهُمَا،', id: 'دَانْ سَلَائِينْ كَدُوَانْيَا' }
                ],
                [
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'عُبَادَةَ', id: 'عُبَادَةْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'الصَّامِتِ', id: 'اَلصَّامِتْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'كُنَّا', id: 'أَدَالَاهْ كَامِي' },
                    { ar: 'خَلْفَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'رَسُولِ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' }
                ],
                [
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ', id: 'فَجَرْ' },
                    { ar: 'فَثَقُلَتْ', id: 'مَاكَا مَنْجَادِي بَرَاتْ' },
                    { ar: 'عَلَيْهِ', id: 'أَتَاسْنْيَا' },
                    { ar: 'الْقِرَاءَةُ،', id: 'بَاچَاءَانْ' },
                    { ar: 'فَلَمَّا', id: 'مَاكَا تَتْكَالَا' },
                    { ar: 'انْصَرَفَ', id: 'إِيَا سَلَسَايْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«لَعَلَّكُمْ', id: 'مُونْگكِينْ كَالِيَانْ' },
                    { ar: 'تَقْرَءُونَ', id: 'كَالِيَانْ مَمْبَاچَا' }
                ],
                [
                    { ar: 'خَلْفَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'إِمَامِكُمْ»', id: 'إِمَامْ كَالِيَانْ»' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'قُلْنَا', id: 'كَامِي بَرْكَاتَا' },
                    { ar: 'يَا', id: 'وَاهَايْ' },
                    { ar: 'رَسُولَ', id: 'رَسُولْ' },
                    { ar: 'اللهِ،', id: 'اَلله' },
                    { ar: 'إِي', id: 'إِيَا' },
                    { ar: 'وَاللهِ،', id: 'دَمِي اَلله' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«لَا', id: '«جَاڠَانْلَاهْ' },
                    { ar: 'تَفْعَلُوا', id: 'كَالِيَانْ مَلَاكُوكَانْ' }
                ],
                [
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'بِأُمِّ', id: 'دڠَنْ أُمُّ' },
                    { ar: 'الْقُرْآنِ،', id: 'اَلْقُرْآنْ' },
                    { ar: 'فَإِنَّهُ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ سَاهْ' },
                    { ar: 'صَلَاةَ', id: 'صَلَاةْ' },
                    { ar: 'لِمَنْ', id: 'بَاگِي أَوْرَاڠْ' },
                    { ar: 'لَمْ', id: 'يَڠْ بَلُومْ' },
                    { ar: 'يَقْرَأْ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'بِهَا».', id: 'دڠَانْنْيَا»' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'رِوَايَةٍ:', id: 'سَاطُو رِوَايَاتْ' },
                    { ar: '«فَلَا', id: '«مَاكَا جَاڠَانْلَاهْ' },
                    { ar: 'تَقْرَءُوا', id: 'كَالِيَانْ مَمْبَاچَا' }
                ],
                [
                    { ar: 'بِشَيْءٍ', id: 'دڠَنْ سَسُوَاتُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْقُرْآنِ', id: 'اَلْقُرْآنْ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'جَهَرْتُ', id: 'أَكُو مڠَرَاسْكَانْ' },
                    { ar: 'بِهِ', id: 'دڠَانْنْيَا' },
                    { ar: 'إِلَّا', id: 'كَعُوَالِي' },
                    { ar: 'بِأُمِّ', id: 'دڠَنْ أُمُّ' },
                    { ar: 'الْقُرْآنِ».', id: 'اَلْقُرْآنْ»' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'حَالِ', id: 'حَالْ' },
                    { ar: 'عَدَمِ', id: 'تِيدَاكْ أَدَانْيَا' },
                    { ar: 'سَمَاعِهِ', id: 'مَنْدڠَارْنْيَا دِيَا (مَأْمُومْ) كَفَادَا' }
                ],
                [
                    { ar: 'الْإِمَامَ', id: 'إِمَامْ' },
                    { ar: 'تُعْتَبَرُ', id: 'دِيَاڠْگَافْ' },
                    { ar: 'الصَّلَاةُ', id: 'صَلَاةْ' },
                    { ar: 'كَأَنَّهَا', id: 'سَأَكَانْ٢ إِيَا' },
                    { ar: 'سِرِّيَّةٌ', id: 'فَلَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'حَقِّهِ.', id: 'حَقْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'فَهَذِهِ', id: 'مَاكَا أَدَافُونْ إِنِي' },
                    { ar: 'الْأَحَادِيثُ', id: 'حَدِيثْ٢' },
                    { ar: 'تَدُلُّ', id: 'مَنُونْجُوكْكَانْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'يَجْهَرُ', id: 'إِيَا مڠَرَاسْكَانْ' },
                    { ar: 'بِقِرَاءَتِهِ', id: 'دڠَنْ بَاچَاءَانْنْيَا' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'يَسْمَعُهَا', id: 'مَنْدڠَارْنْيَا' }
                ],
                [
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'حَضَرَ.', id: 'حَاضِيرْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new151);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 151 to data.js');
