const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new146 = `    146: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الَّذِي', id: 'يَڠْ' },
                    { ar: 'يَكُونُ', id: 'أَدَا' },
                    { ar: 'عَلَى', id: 'فَادَا' },
                    { ar: 'رَأْسِ', id: 'فَڠْهُوجُوڠْ' },
                    { ar: 'رَكْعَتَيْنِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُرْ' },
                    { ar: 'وَالْعَصْرِ', id: 'دَانْ عَصَرْ' },
                    { ar: 'وَالْمَغْرِبِ', id: 'دَانْ مَغْرِبْ' },
                    { ar: 'وَالْعِشَاءِ', id: 'دَانْ عِشَاءْ' }
                ],
                [
                    { ar: 'فَيُسَنُّ', id: 'مَاكَا دِيسُنَّهْكَانْ' },
                    { ar: 'التَّشَهُّدُ', id: 'تَشَهُدْ' },
                    { ar: 'فِيهِ.', id: 'دِي دَالَمْنْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'جَاءَ', id: 'تَلَاهْ دَاتَڠْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'حَدِيثِ', id: 'حَدِيثْ' },
                    { ar: 'الْمُسِيءِ', id: 'أَوْرَاڠْ يَڠْ بُورُوكْ' },
                    { ar: 'صَلَاتَهُ', id: 'صَلَاةْنْيَا' },
                    { ar: 'عِنْدَ', id: 'رِيوَايَاتْ' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٨٦٠)', id: '(٨٦٠)' },
                    { ar: '«فَإِذَا', id: 'مَاكَا أَفَابِيلَا' },
                    { ar: 'جَلَسْتَ', id: 'كَامُو دُودُوكْ' }
                ],
                [
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'وَسَطِ', id: 'تَڠَاهْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'فَاطْمَئِنَّ', id: 'مَاكَا طُمَأْنِينَةْلَاهْ' },
                    { ar: 'وَافْتَرِشْ', id: 'دَانْ دُودُوكْ إِفْتِرَاشْلَاهْ' },
                    { ar: 'فَخِذَكَ', id: 'فَاهَامُو' },
                    { ar: 'الْيُسْرَى،', id: 'يَڠْ كِيرِي' },
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'تَشَهَّدْ».', id: 'بَرْتَشَهُدْلَاهْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَالدَّلِيلُ', id: 'دَانْ أَدَافُونْ دَلِيلْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'أَنَّهُ', id: 'سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'سُنَّةٌ', id: 'سُنَّةْ' },
                    { ar: 'وَلَيْسَ', id: 'دَانْ بُوكَانْ' },
                    { ar: 'بِفَرْضٍ؛', id: 'فَرْضُ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'رَوَاهُ', id: 'مَرِيوَايَاتْكَانْنْيَا' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(١١٧٣)', id: '(١١٧٣)' }
                ],
                [
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٥٧٠)', id: '(٥٧٠)' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'رَسُولَ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'قَامَ', id: 'بَرْدِيرِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُرْ' },
                    { ar: 'وَعَلَيْهِ', id: 'دَانْ أَتَاسْنْيَا' },
                    { ar: 'جُلُوسٌ', id: 'دُودُوكْ' }
                ],
                [
                    { ar: 'فَلَمَّا', id: 'مَاكَا تَتْكَالَا' },
                    { ar: 'أَتَمَّ', id: 'إِيَا مَنْيَمْفُورْنَكَاانْ' },
                    { ar: 'صَلَاتَهُ', id: 'صَلَاةْنْيَا' },
                    { ar: 'سَجَدَ', id: 'إِيَا سُجُودْ' },
                    { ar: 'سَجْدَتَيْنِ.', id: 'دُوَ كَالِي سُجُودْ' },
                    { ar: '(أَيْ', id: 'يَكْنِي' },
                    { ar: 'لِلسَّهْوِ', id: 'كَرَنَا لُوفَا' },
                    { ar: 'تَعْوِيضاً', id: 'سَبَاگَايْ گَانْتِي' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَوَّلِ', id: 'يَڠْ فَرْتَامَا' }
                ],
                [
                    { ar: 'الَّذِي', id: 'يَڠْ' },
                    { ar: 'تَرَكَهُ', id: 'إِيَا مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'بِتَرْكِ', id: 'دڠَنْ مَنِيڠْگَلْكَانْ' },
                    { ar: 'الْجُلُوسِ', id: 'دُودُوكْ' },
                    { ar: 'لَهُ،', id: 'بَاگِينْيَا' },
                    { ar: 'فَلَوْ', id: 'مَاكَا سَأَنْدَايْنْيَا' },
                    { ar: 'كَانَ', id: 'إِيَا أَدَالَاهْ' },
                    { ar: 'رُكْناً', id: 'رُكُونْ' },
                    { ar: 'لَاضْطُرَّ', id: 'نِسْچَايَا إِيَا تَرْفَكْسَا' },
                    { ar: 'إِلَى', id: 'كَفَادَا' },
                    { ar: 'الْإِتْيَانِ', id: 'مَنْدَاتَاڠْكَانْ' },
                    { ar: 'بِهِ،', id: 'دڠَانْنْيَا' }
                ],
                [
                    { ar: 'وَلَمْ', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يَنْجَبِرْ', id: 'تَرْتَامْبَالْ' },
                    { ar: 'تَرْكُهُ', id: 'مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'بِسُجُودِ', id: 'دڠَنْ سُجُودْ' },
                    { ar: 'السَّهْوِ).', id: 'سَهْوِي' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٢', id: '٢' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الصَّلَاةُ', id: 'مَمْبَاچَا شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'عَقِبَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَوَّلِ:', id: 'يَڠْ فَرْتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'هِيَ', id: 'إِيَا' },
                    { ar: 'أَيْضاً', id: 'جُوگَا' },
                    { ar: 'سُنَّةٌ', id: 'سُنَّةْ' },
                    { ar: 'يُجْبَرُ', id: 'دِيتَامْبَالْ' },
                    { ar: 'تَرْكُهَا', id: 'مَنِيڠْگَلْكَانْنْيَا' },
                    { ar: 'بِالسُّجُودِ.', id: 'دڠَنْ سُجُودْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٣', id: '٣' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْجُلُوسُ', id: 'دُودُوكْ' },
                    { ar: 'لِلتَّشَهُّدِ', id: 'أُونْتُوكْ تَشَهُدْ' },
                    { ar: 'الْأَوَّلِ:', id: 'يَڠْ فَرْتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'أَيْ', id: 'يَكْنِي' },
                    { ar: 'فَهِيَ', id: 'مَاكَا إِيَا' },
                    { ar: 'إِذاً', id: 'كَالَاوْ بَگِيتُو' },
                    { ar: 'ثَلَاثُ', id: 'تِيگَا' },
                    { ar: 'سُنَنٍ', id: 'سُنَّةْ٢' },
                    { ar: 'مُسْتَقِلَّةٍ:', id: 'يَڠْ بَرْدِيرِي سَنْدِيرِي' },
                    { ar: 'سُنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'الْجُلُوسِ،', id: 'دُودُوكْ' },
                    { ar: 'وَسُنَّةُ', id: 'دَانْ سُنَّةْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'فِيهِ،', id: 'دِي دَالَمْنْيَا' }
                ],
                [
                    { ar: 'ثُمَّ', id: 'كَمُودِيَانْ' },
                    { ar: 'سُنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'الصَّلَاةِ', id: 'بَرْشَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٤', id: '٤' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الصَّلَاةُ', id: 'مَمْبَاچَا شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'آلِ', id: 'كَلُوَارْگَا' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'الْأَخِيرِ', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'الَّذِي', id: 'يَڠْ' }
                ],
                [
                    { ar: 'هُوَ', id: 'إِيَا أَدَالَاهْ' },
                    { ar: 'رُكْنٌ:', id: 'رُكُونْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'أَيْ', id: 'يَكْنِي' },
                    { ar: 'يُسَنُّ', id: 'دِيسُنَّهْكَانْ' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'أَدَاءِ', id: 'مَنُونَايْكَانْ' },
                    { ar: 'رُكْنِ', id: 'رُكُونْ' },
                    { ar: 'التَّشَهُّدِ', id: 'تَشَهُدْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْجَلْسَةِ', id: 'دُودُوكْ' },
                    { ar: 'الْأَخِيرَةِ،', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'وَرُكْنِ', id: 'دَانْ رُكُونْ' },
                    { ar: 'الصَّلَاةِ', id: 'شَلَاوَاتْ' }
                ],
                [
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ،', id: 'ﷺ' },
                    { ar: 'الصَّلَاةُ', id: 'بَرْشَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'آلِ', id: 'كَلُوَارْگَا' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ،', id: 'ﷺ' },
                    { ar: 'لِمَا', id: 'كَرَنَا أَفَا يَڠْ' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ بَرْلَالُو' },
                    { ar: 'مَعَكَ', id: 'بَرْسَمَامُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الصِّيغَةِ', id: 'رِدَاكْسِي' }
                ],
                [
                    { ar: 'الْكَامِلَةِ', id: 'يَڠْ سَمْفُورْنَا' },
                    { ar: 'لِلصَّلَاةِ', id: 'أُونْتُوكْ شَلَاوَاتْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ.', id: 'ﷺ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٥', id: '٥' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْقُنُوتُ', id: 'قُنُوتْ' },
                    { ar: 'عِنْدَ', id: 'كَِتيكَا' },
                    { ar: 'الِاعْتِدَالِ', id: 'إِعْتِدَالْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الثَّانِيَةِ', id: 'يَڠْ كَدُوَ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الْفَجْرِ،', id: 'فَجَرْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'آخِرِ', id: 'أَخِيرْ' },
                    { ar: 'رَكْعَةٍ', id: 'رَكَاعَاتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْوِتْرِ', id: 'وِتِرْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'النِّصْفِ', id: 'سَفَارُوهْ' },
                    { ar: 'الثَّانِي', id: 'يَڠْ كَدُوَ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'رَمَضَانَ،', id: 'رَمَضَانْ' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' }
                ],
                [
                    { ar: 'اعْتِدَالِ', id: 'إِعْتِدَالْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الْأَخِيرَةِ', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَيِّ', id: 'سَتِيَافْ' },
                    { ar: 'صَلَاةٍ', id: 'صَلَاةْ' },
                    { ar: 'بِالنِّسْبَةِ', id: 'دڠَنْ نِسْبَتْ' },
                    { ar: 'لِقُنُوتِ', id: 'أُونْتُوكْ قُنُوتْ' },
                    { ar: 'النَّازِلَةِ:', id: 'نَازِلَةْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/146: \[[\s\S]*?\n\};/, new146);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully patched data.js');
