const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new153 = `,
    153: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٧٤٧)؛', id: '(٧٤٧)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٤١٠)،', id: '(٤١٠)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' }
                ],
                [
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'أَمَّنَ', id: 'مَمْبَاچَا أَمِينْ' },
                    { ar: 'الإِمَامُ', id: 'إِمَامْ' },
                    { ar: 'فَأَمِّنُوا،', id: 'مَاكَا بَاچَالَاهْ أَمِينْ أَوْلَيهْ كَالِيَانْ' },
                    { ar: 'فَإِنَّ', id: 'مَاكَا سَسُوڠْگُوهْنْيَا' },
                    { ar: 'مَنْ', id: 'بَارَاڠْسِيَافَا' },
                    { ar: 'وَافَقَ', id: 'تَلَاهْ مَنْچُوَچُوكِي' },
                    { ar: 'تَأْمِينُهُ', id: 'بَاچَاءَانْ أَمِينْنْيَا' },
                    { ar: 'تَأْمِينَ', id: 'بَاچَاءَانْ أَمِينْ' }
                ],
                [
                    { ar: 'المَلَائِكَةِ', id: 'مَلَائِكَةْ' },
                    { ar: 'غُفِرَ', id: 'دِيَامْفُونِي' },
                    { ar: 'لَهُ', id: 'بَاگِينْيَا' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'تَقَدَّمَ', id: 'تَلَاهْ تَرْدَاهُولُو' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'ذَنْبِهِ».', id: 'دُوسَانْيَا»' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(٩٣٤)،', id: '(٩٣٤)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'كَانَ', id: 'إِيَا أَدَا' },
                    { ar: 'رَسُولُ', id: 'رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'تَلَا:', id: 'إِيَا مَمْبَاچَا' },
                    { ar: '﴿غَيْرِ', id: 'بُوكَانْ' },
                    { ar: 'المَغْضُوبِ', id: 'يَڠْ دِيمُورْكَائِي' },
                    { ar: 'عَلَيْهِمْ', id: 'أَتَاسْ مَرَكَ' },
                    { ar: 'وَلَا', id: 'دَانْ بُوكَانْ' },
                    { ar: 'الضَّالِّينَ﴾', id: 'أَوْرَاڠْ٢ يَڠْ تَرْسَسَاتْ' }
                ],
                [
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'آمِينَ،', id: 'آمِينْ' },
                    { ar: 'حَتَّى', id: 'سَهِينْگَا' },
                    { ar: 'يَسْمَعَ', id: 'مَنْدڠَارْ' },
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'يَلِيهِ', id: 'أَدَا دِي دَكَاتْنْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الصَّفِّ', id: 'بَارِيسَانْ' },
                    { ar: 'الأَوَّلِ.', id: 'يَڠْ فَرْتَامَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَزَادَ', id: 'دَانْ تَلَاهْ مَنَامْبَاهِي' },
                    { ar: 'ابْنُ', id: 'إِبْنُ' },
                    { ar: 'مَاجَهْ', id: 'مَاجَهْ' },
                    { ar: '(٨٥٣):', id: '(٨٥٣)' },
                    { ar: 'فَيَرْتَجُّ', id: 'مَاكَا بَرْگَمُورُوهْ' },
                    { ar: 'بِهَا', id: 'دڠَانْنْيَا' },
                    { ar: 'المَسْجِدُ.', id: 'مَسْجِدْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '٨', id: '٨' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'قِرَاءَةُ', id: 'بَاچَاءَانْ' },
                    { ar: 'شَيْءٍ', id: 'سَسُوَاتُو' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْقُرْآنِ', id: 'اَلْقُرْآنْ' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'الْفَاتِحَةِ:', id: 'اَلْفَاتِحَةْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَتَتَحَقَّقُ', id: 'دَانْ مَنْجَادِي نْيَاتَا' },
                    { ar: 'السُّنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'سُورَةٍ', id: 'سَاتُو سُورَةْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْقُرْآنِ', id: 'اَلْقُرْآنْ' },
                    { ar: 'مَهْمَا', id: 'بَتَافَافُونْ' },
                    { ar: 'قَصُرَتْ،', id: 'إِيَا فَنْدَكْ' },
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'بِقِرَاءَةِ', id: 'دڠَنْ بَاچَاءَانْ' },
                    { ar: 'ثَلَاثِ', id: 'تِيگَا' },
                    { ar: 'آيَاتٍ', id: 'أَيَاتْ٢' }
                ],
                [
                    { ar: 'مُتَوَالِيَاتٍ.', id: 'يَڠْ بَرْتُورُوتْ٢' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَمَكَانُ', id: 'دَانْ أَدَافُونْ تَمْفَاتْ' },
                    { ar: 'اسْتِحْبَابِهَا', id: 'كَسُنَّهَانْنْيَا' },
                    { ar: 'الرَّكْعَتَانِ', id: 'دُوَ رَكَاعَاتْ' },
                    { ar: 'الْأُولَيَانِ', id: 'يَڠْ فَرْتَامَا' },
                    { ar: 'فَقَطْ', id: 'سَاجَا' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'كُلِّ', id: 'تِيَافْ٢' },
                    { ar: 'صَلَاةٍ،', id: 'صَلَاةْ' },
                    { ar: 'بِالنِّسْبَةِ', id: 'دڠَنْ دِينِسْبَاتْكَانْ' },
                    { ar: 'لِلْإِمَامِ،', id: 'بَاگِي إِمَامْ' }
                ],
                [
                    { ar: 'وَالْمُنْفَرِدِ', id: 'دَانْ يَڠْ سَنْدِيرِيَانْ' },
                    { ar: 'مُطْلَقاً.', id: 'سَچَارَا مُطْلَقْ' },
                    { ar: 'وَبِالنِّسْبَةِ', id: 'دَانْ دِينِسْبَاتْكَانْ' },
                    { ar: 'لِلْمُقْتَدِي', id: 'بَاگِي مَأْمُومْ' },
                    { ar: 'أَيْضاً', id: 'جُوغَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'السِّرِّيَّةِ،', id: 'سِرِّيَّةْ' }
                ],
                [
                    { ar: 'أَوْ', id: 'أَتَاوْ' },
                    { ar: 'حَيْثُ', id: 'سَكِيرَانْيَا' },
                    { ar: 'يَكُونُ', id: 'إِيَا أَدَا' },
                    { ar: 'بَعِيداً', id: 'جَاوُهْ' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَسْمَعُ', id: 'إِيَا مَنْدڠَارْ' },
                    { ar: 'قِرَاءَةَ', id: 'بَاچَاءَانْ' },
                    { ar: 'الْإِمَامِ.', id: 'إِمَامْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَقْرَأَ', id: 'إِيَا مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُوحْ' },
                    { ar: 'وَالظُّهْرِ', id: 'دَانْ ظُهُورْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'طِوَالِ', id: 'يَڠْ فَانْجَاڠْ٢' },
                    { ar: 'الْمُفَصَّلِ،', id: 'سُورَةْ٢ مُفَصَّلْ' },
                    { ar: 'كَالْحُجُرَاتِ،', id: 'سَفَرْتِي اَلْحُجُرَاتْ' }
                ],
                [
                    { ar: 'وَالرَّحْمَنِ،', id: 'دَانْ اَلرَّحْمَن' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'الْعَصْرِ', id: 'عَصَرْ' },
                    { ar: 'وَالْعِشَاءِ،', id: 'دَانْ عِشَاءْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'أَوَاسِطِهِ،', id: 'يَڠْ تڠَاهْ٢نْيَا' },
                    { ar: 'كَالشَّمْسِ', id: 'سَفَرْتِي اَلشَّمْسْ' },
                    { ar: 'وَضُحَاهَا،', id: 'وَضُحَاهَا' }
                ],
                [
                    { ar: 'وَاللَّيْلِ', id: 'دَانْ اَللَّيْل' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'يَغْشَى،', id: 'مَنُوتُوفِي' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'الْمَغْرِبِ', id: 'مَغْرِبْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'قِصَارِهِ،', id: 'يَڠْ فَنْدَكْ٢نْيَا' },
                    { ar: 'كَقُلْ', id: 'سَفَرْتِي قُلْ' },
                    { ar: 'هُوَ', id: 'دِيَا' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'أَحَدٌ.', id: 'يَڠْ مَهَا أَسَا' }
                ],
                [
                    { ar: 'لِحَدِيثِ', id: 'كَرَنَا حَدِيثْ' },
                    { ar: 'النَّسَائِيِّ', id: 'اَلنَّسَائِي' },
                    { ar: '(١٦٧/٢)،', id: '(١٦٧/٢)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'سُلَيْمَانَ', id: 'سُلَيْمَانْ' },
                    { ar: 'بْنِ', id: 'بِنْ' },
                    { ar: 'يَسَارٍ،', id: 'يَسَارْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' }
                ],
                [
                    { ar: 'رَضِيَ', id: 'سَمُوغَا مَرِيضَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'مَا', id: 'تِيدَاكْلَاهْ' },
                    { ar: 'صَلَّيْتُ', id: 'أَكُو صَلَاةْ' },
                    { ar: 'وَرَاءَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'أَحَدٍ', id: 'سَسَأَوْرَاڠْ' },
                    { ar: 'أَشْبَهَ', id: 'يَڠْ لَبِيهْ مَنْيَرُوفَائِي' },
                    { ar: 'صَلَاةً', id: 'صَلَاةْنْيَا' }
                ],
                [
                    { ar: 'بِرَسُولِ', id: 'دڠَنْ رَسُولْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'فُلَانٍ،', id: 'فُلَانْ' },
                    { ar: 'فَصَلَّيْنَا', id: 'مَاكَا كَامِي صَلَاةْ' },
                    { ar: 'وَرَاءَ', id: 'دِي بَلَاكَاڠْ' },
                    { ar: 'ذَلِكَ', id: 'إِيتُو' },
                    { ar: 'الْإِنْسَانِ،', id: 'مَانُوسِيَا' }
                ],
                [
                    { ar: 'وَكَانَ', id: 'دَانْ إِيَا أَدَا' },
                    { ar: 'يُطِيلُ', id: 'إِيَا مَمَانْجَاڠْكَانْ' },
                    { ar: 'الْأُولَيَيْنِ', id: 'دُوَ رَكَاعَاتْ فَرْتَامَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الظُّهْرِ', id: 'ظُهُورْ' },
                    { ar: 'وَيُخَفِّفُ', id: 'دَانْ مَرِيڠَانْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْأُخْرَيَيْنِ،', id: 'دُوَ رَكَاعَاتْ يَڠْ لَائِينْ' }
                ],
                [
                    { ar: 'وَيُخَفِّفُ', id: 'دَانْ مَرِيڠَانْكَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْعَصْرِ،', id: 'عَصَرْ' },
                    { ar: 'وَيَقْرَأُ', id: 'دَانْ مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْمَغْرِبِ', id: 'مَغْرِبْ' },
                    { ar: 'بِقِصَارِ', id: 'دڠَنْ سُورَةْ٢ فَنْدَكْ' },
                    { ar: 'الْمُفَصَّلِ،', id: 'مُفَصَّلْ' }
                ],
                [
                    { ar: 'وَيَقْرَأُ', id: 'دَانْ مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْعِشَاءِ', id: 'عِشَاءْ' },
                    { ar: 'بِالشَّمْسِ', id: 'دڠَنْ اَلشَّمْس' },
                    { ar: 'وَضُحَاهَا', id: 'وَضُحَاهَا' },
                    { ar: 'وَأَشْبَاهِهَا،', id: 'دَانْ يَڠْ مَنْيَرُوفَائِينْيَا' },
                    { ar: 'وَيَقْرَأُ', id: 'دَانْ مَمْبَاچَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُوحْ' }
                ],
                [
                    { ar: 'بِسُورَتَيْنِ', id: 'دڠَنْ دُوَ سُورَةْ' },
                    { ar: 'طَوِيلَتَيْنِ.', id: 'يَڠْ فَانْجَاڠْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new153);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 153 to data.js');
