const fs = require('fs');
let content = fs.readFileSync('data.js', 'utf8');

const new147 = `,
    147: [
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَحْمَدُ', id: 'أَحْمَدْ' },
                    { ar: 'وَغَيْرُهُ،', id: 'دَانْ سَلَائِنْنْيَا' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَنَسٍ', id: 'أَنَسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«مَا زَالَ', id: 'سَنَانْتِيَاسَا' }
                ],
                [
                    { ar: 'رَسُولُ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللَّهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'يَقْنُتُ', id: 'إِيَا بَرْقُنُوتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُحْ' },
                    { ar: 'حَتَّى', id: 'سَهِيڠْگَا' },
                    { ar: 'فَارَقَ', id: 'إِيَا بَرْفِيسَاهْ' },
                    { ar: 'الدُّنْيَا».', id: 'دُونِيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْبُخَارِيُّ', id: 'اَلْبُخَارِي' },
                    { ar: '(٩٥٦)؛', id: '(٩٥٦)' },
                    { ar: 'وَمُسْلِمٌ', id: 'دَانْ مُسْلِمْ' },
                    { ar: '(٦٧٧)،', id: '(٦٧٧)' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَنَسٍ', id: 'أَنَسْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ،', id: 'دَارِينْيَا' }
                ],
                [
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْگُوهْ' },
                    { ar: 'سُئِلَ:', id: 'إِيَا دِيتَانْيَا' },
                    { ar: 'أَقَنَتَ', id: 'أَفَاكَاهْ بَرْقُنُوتْ' },
                    { ar: 'النَّبِيُّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'الصُّبْحَ؟', id: 'صُبُحْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'نَعَمْ،', id: 'يَا' },
                    { ar: 'فَقِيلَ', id: 'مَاكَا دِيكَاتَاكَانْ' },
                    { ar: 'لَهُ:', id: 'بَاگِينْيَا' }
                ],
                [
                    { ar: 'أَوَقَنَتَ', id: 'أَفَاكَاهْ إِيَا بَرْقُنُوتْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الرُّكُوعِ؟', id: 'رُكُوعْ' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: 'بَعْدَ', id: 'سَتَلَاهْ' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوعْ' },
                    { ar: 'يَسِيراً.', id: 'سَدِيكِيتْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: '[يُنْظَرُ', id: 'دِيلِيهَاتْ' },
                    { ar: 'الْبَيْهَقِيُّ', id: 'اَلْبَيْهَقِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُحْ' },
                    { ar: 'وَفِي', id: 'دَانْ دِي دَالَمْ' },
                    { ar: 'قُنُوتِ', id: 'قُنُوتْ' },
                    { ar: 'الْوِتْرِ].', id: 'وِتِرْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَتُؤَدَّى', id: 'دَانْ دِيتُونَايْكَانْ' },
                    { ar: 'سُنَّةُ', id: 'سُنَّةْ' },
                    { ar: 'الْقُنُوتِ', id: 'قُنُوتْ' },
                    { ar: 'بِأَنْ', id: 'دڠَنْ بَهْوَ' },
                    { ar: 'يُثْنِيَ', id: 'إِيَا مَمُوجِي' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَاڠْ يَڠْ صَلَاةْ' },
                    { ar: 'عَلَى', id: 'أَتَاسْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'تَعَالَى', id: 'مَهَا تِيڠْگِي' },
                    { ar: 'وَيَدْعُوَهُ', id: 'دَانْ إِيَا بَرْدُعَاءْ كَفَادَانْيَا' }
                ],
                [
                    { ar: 'بِأَيِّ', id: 'دڠَنْ سَتِيَافْ' },
                    { ar: 'لَفْظٍ', id: 'لَفَظْ' },
                    { ar: 'شَاءَ،', id: 'إِيَا كَهَنْدَاكِي' },
                    { ar: 'كَأَنْ', id: 'سَفَرْتِي بَهْوَ' },
                    { ar: 'يَقُولَ:', id: 'إِيَا بَرْكَاتَا' },
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' },
                    { ar: 'اغْفِرْ', id: 'أَمْفُونِيلَاهْ' },
                    { ar: 'لِي', id: 'بَاگِيكُو' },
                    { ar: 'يَا غَفُورُ».', id: 'وَهَايْ يَڠْ مَهَا فڠَامْفُونْ' }
                ],
                [
                    { ar: 'وَلَكِنَّ', id: 'دَانْ تَتَافِي' },
                    { ar: 'الْكَمَالَ', id: 'كَسَمْفُورْنَاءَانْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'أَدَائِهَا', id: 'مَنُونَايْكَانْنْيَا' },
                    { ar: 'يَكُونُ', id: 'أَدَا' },
                    { ar: 'بِالْتِزَامِ', id: 'دڠَنْ مَنَتَافِي' },
                    { ar: 'الدُّعَاءِ', id: 'دُعَاءْ' },
                    { ar: 'الْوَارِدِ', id: 'يَڠْ دَاتَڠْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'رَسُولِ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' }
                ],
                [
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'ذَلِكَ.', id: 'إِيتُو' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'رَوَى', id: 'تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'أَبُو', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(١٤٢٥)', id: '(١٤٢٥)' },
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'الْحَسَنِ', id: 'اَلْحَسَنْ' },
                    { ar: 'بْنِ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'عَلِيٍّ', id: 'عَلِي' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُمَا', id: 'دَارِي كَدُوَانْيَا' },
                    { ar: 'قَالَ:', id: 'إِيَا بَرْكَاتَا' }
                ],
                [
                    { ar: 'عَلَّمَنِي', id: 'إِيَا تَلَاهْ مڠَاجَارِيكُو' },
                    { ar: 'رَسُولُ', id: 'أُوتُوسَانْ' },
                    { ar: 'اللهِ', id: 'اَلله' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'كَلِمَاتٍ', id: 'كَلِمَاتْ٢' },
                    { ar: 'أَقُولُهُنَّ', id: 'أَكُو مڠُچَافْكَانْنْيَا' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْوِتْرِ:', id: 'وِتِرْ' }
                ],
                [
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' },
                    { ar: 'اهْدِنِي', id: 'بَرِيلَاهْ فَتُونْجُوكْ كَفَادَاكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'هَدَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي فَتُونْجُوكْ' },
                    { ar: 'وَعَافِنِي', id: 'دَانْ بَرِيلَاهْ عَافِيَةْ كَفَادَاكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'عَافَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي عَافِيَةْ' }
                ],
                [
                    { ar: 'وَتَوَلَّنِي', id: 'دَانْ فَلِيهَارَالَاهْ أَكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'تَوَلَّيْتَ،', id: 'أڠْكَاوْ فَلِيهَارَا' },
                    { ar: 'وَبَارِكْ', id: 'دَانْ بَرِيلَاهْ بَرْكَاهْ' },
                    { ar: 'لِي', id: 'بَاگِيكُو' },
                    { ar: 'فِيمَا', id: 'دِي دَالَمْ أَفَا يَڠْ' },
                    { ar: 'أَعْطَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي' }
                ],
                [
                    { ar: 'وَقِنِي', id: 'دَانْ جَاگَالَاهْ أَكُو' },
                    { ar: 'شَرَّ', id: 'كَبُورُوكَانْ' },
                    { ar: 'مَا', id: 'أَفَا يَڠْ' },
                    { ar: 'قَضَيْتَ،', id: 'أڠْكَاوْ تَلَاهْ تَتَافْكَانْ' },
                    { ar: 'إِنَّكَ', id: 'سَسُوڠْگُوهْنْيَا أڠْكَاوْ' },
                    { ar: 'تَقْضِي', id: 'أڠْكَاوْ مَنَتَافْكَانْ' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يُقْضَى', id: 'دِيتَتَافْكَانْ' },
                    { ar: 'عَلَيْكَ،', id: 'أَتَاسْمُو' }
                ],
                [
                    { ar: 'وَإِنَّهُ', id: 'دَانْ سَسُوڠْگُوهْنْيَا إِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'يَذِلُّ', id: 'مَنْجَادِي هِينَا' },
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'وَالَيْتَ،', id: 'أڠْكَاوْ كَاسِيهِي' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يَعِزُّ', id: 'مَنْجَادِي مُلِيَا' },
                    { ar: 'مَنْ', id: 'أَوْرَاڠْ يَڠْ' },
                    { ar: 'عَادَيْتَ،', id: 'أڠْكَاوْ مُوسُوهِي' }
                ],
                [
                    { ar: 'تَبَارَكْتَ', id: 'مَهَا سُچِي أڠْكَاوْ' },
                    { ar: 'رَبَّنَا', id: 'تُوهَانْ كَامِي' },
                    { ar: 'وَتَعَالَيْتَ»', id: 'دَانْ مَهَا تِيڠْگِي أڠْكَاوْ' },
                    { ar: 'وَيُسَنُّ', id: 'دَانْ دِيسُنَّهْكَانْ' },
                    { ar: 'لِلْإِمَامِ', id: 'بَاگِي إِمَامْ' },
                    { ar: 'أَنْ', id: 'بَهْوَ' },
                    { ar: 'يَأْتِيَ', id: 'إِيَا مَنْدَاتَاڠْكَانْ' },
                    { ar: 'بِهِ', id: 'دڠَانْنْيَا' },
                    { ar: 'بِصِيغَةِ', id: 'دڠَنْ بَنْتُوكْ' },
                    { ar: 'الْجَمْعِ.', id: 'جَمَاعْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'قَالَ', id: 'تَلَاهْ بَرْكَاتَا' },
                    { ar: 'التِّرْمِذِيُّ', id: 'اَلتِّرْمِذِي' },
                    { ar: '(٤٦٤):', id: '(٤٦٤)' },
                    { ar: 'هَذَا', id: 'إِنِي' },
                    { ar: 'حَدِيثٌ', id: 'حَدِيثْ' },
                    { ar: 'حَسَنٌ.', id: 'يَڠْ حَسَنْ' },
                    { ar: 'وَقَالَ:', id: 'دَانْ إِيَا بَرْكَاتَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'نَعْرِفُ', id: 'كَامِي مڠَتَاهُويْ' }
                ],
                [
                    { ar: 'عَنِ', id: 'دَارِي' },
                    { ar: 'النَّبِيِّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْقُنُوتِ', id: 'قُنُوتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الْوِتْرِ', id: 'وِتِرْ' },
                    { ar: 'شَيْئاً', id: 'سَسُوَاتُو' },
                    { ar: 'أَحْسَنَ', id: 'يَڠْ لَبِيهْ بَائِيكْ' },
                    { ar: 'مِنْهُ.', id: 'دَارِينْيَا' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَعِنْدَ', id: 'دَانْ دِي سِيسِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'دَاوُدَ', id: 'دَاوُدْ' },
                    { ar: '(١٤٢٨)', id: '(١٤٢٨)' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'أُبَيَّ', id: 'أُبَيّ' },
                    { ar: 'بْنَ', id: 'أَنَاكْ لَاكِي٢' },
                    { ar: 'كَعْبٍ', id: 'كَعَبْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' }
                ],
                [
                    { ar: 'أَمَّهُمْ', id: 'إِيَا مڠِيمَامِي مَرِكَ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'يَعْنِي', id: 'يَكْنِي' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'رَمَضَانَ', id: 'رَمَضَانْ' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'وَكَانَ', id: 'دَانْ أَدَالَاهْ إِيَا' },
                    { ar: 'يَقْنُتُ', id: 'إِيَا بَرْقُنُوتْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'النِّصْفِ', id: 'سَفَارُوهْ' },
                    { ar: 'الْأَخِيرِ', id: 'يَڠْ تَرَاخِيرْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'رَمَضَانَ.', id: 'رَمَضَانْ' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَرَوَى', id: 'دَانْ تَلَاهْ مَرِيوَايَاتْكَانْ' },
                    { ar: 'الْحَاكِمُ', id: 'اَلْحَاكِمْ' },
                    { ar: 'عَنْ', id: 'دَارِي' },
                    { ar: 'أَبِي', id: 'أَبُو' },
                    { ar: 'هُرَيْرَةَ', id: 'هُرَيْرَةْ' },
                    { ar: 'رَضِيَ', id: 'سَمُوَگَا مَرِيدَائِي' },
                    { ar: 'اللهُ', id: 'اَلله' },
                    { ar: 'عَنْهُ', id: 'دَارِينْيَا' },
                    { ar: 'أَنَّ', id: 'سَسُوڠْگُوهْنْيَا' },
                    { ar: 'النَّبِيَّ', id: 'نَبِي' },
                    { ar: 'ﷺ', id: 'ﷺ' }
                ],
                [
                    { ar: 'كَانَ', id: 'أَدَالَاهْ إِيَا' },
                    { ar: 'إِذَا', id: 'أَفَابِيلَا' },
                    { ar: 'رَفَعَ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'رَأْسَهُ', id: 'كَفَالَانْيَا' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الرُّكُوعِ', id: 'رُكُوعْ' },
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'صَلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'الصُّبْحِ', id: 'صُبُحْ' }
                ],
                [
                    { ar: 'فِي', id: 'دِي دَالَمْ' },
                    { ar: 'الرَّكْعَةِ', id: 'رَكَاعَاتْ' },
                    { ar: 'الثَّانِيَةِ،', id: 'يَڠْ كَدُوَ' },
                    { ar: 'رَفَعَ', id: 'إِيَا مڠَاڠْكَاتْ' },
                    { ar: 'يَدَيْهِ', id: 'كَدُوَ تَاڠَانْنْيَا' },
                    { ar: 'يَدْعُو', id: 'إِيَا بَرْدُعَاءْ' },
                    { ar: 'بِهَذَا', id: 'دڠَنْ إِنِي' },
                    { ar: 'الدُّعَاءِ:', id: 'دُعَاءْ' },
                    { ar: '«اللَّهُمَّ', id: 'يَا اَلله' }
                ],
                [
                    { ar: 'اهْدِنِي', id: 'بَرِيلَاهْ فَتُونْجُوكْ كَفَادَاكُو' },
                    { ar: 'فِيمَنْ', id: 'دِي دَالَمْ أَوْرَاڠْ يَڠْ' },
                    { ar: 'هَدَيْتَ...».', id: 'أڠْكَاوْ تَلَاهْ مَمْبَرِي فَتُونْجُوكْ' }
                ]
            ]
        }
    ]
};`;

let result = content.replace(/\n\};/, new147);
fs.writeFileSync('data.js', result, 'utf8');
console.log('Successfully added page 147 to data.js');
