const pagesData = {
    144: [
        {
            type: 'heading',
            lines: [
                [
                    { ar: 'سُنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: 'السُّنَّةُ:', id: 'سُنَّه اَدَالَهْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'هِيَ', id: 'إِيَا' },
                    { ar: 'مَا', id: 'أَفَا٢ يَڠْ' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْإِنْسَانِ', id: 'مَانُوسِيَا' },
                    { ar: 'فِعْلُهُ', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'غَيْرِ', id: 'بُوكَنْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْحَتْمِ،', id: 'وَاجِبْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يُثَابُ', id: 'دِيبَرِي فَاهَالَا' }
                ],
                [
                    { ar: 'الْمُسْلِمُ', id: 'سَأَوْرَڠْ مُسْلِمْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'فِعْلِهِ', id: 'مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'يُعَاقَبُ', id: 'دِيهُوكُومْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهِ.', id: 'مَنِيڠْڮَلْكَنّيَا.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَرْكَانٌ', id: 'رُوكُون٢' },
                    { ar: 'وَشُرُوطٌ', id: 'دَانْ شَرَط٢' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'بُدَّ', id: 'بُولَيْه تِيدَاكْ' },
                    { ar: 'مِنْ', id: 'دَارِي' },
                    { ar: 'فِعْلِهَا', id: 'مڠرجاكنيَا' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' },
                    { ar: 'الْإِلْزَامِ', id: 'كَوَاجِبَنْ' }
                ],
                [
                    { ar: 'أَوْ', id: 'أَتَوْ' },
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'كَيْ', id: 'أَڮَرْ' },
                    { ar: 'تَصِحَّ', id: 'سَهْ' },
                    { ar: 'الصَّلَاةُ؛', id: 'صَلَاةْ؛' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'ذَكَرْنَاهَا', id: 'كَامِي تَلَاهْ مَثَبُوتْكَنّيَا' },
                    { ar: 'فِيمَا', id: 'فَدَا أَفَا يَڠْ' },
                    { ar: 'سَبَقَ.', id: 'تَلَاهْ لَالُو.' }
                ],
                [
                    { ar: 'وَلِلصَّلَاةِ', id: 'دَانْ بَاڮِي صَلَاةْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'سُنَنٌ', id: 'سُنَّه٢' },
                    { ar: 'يُطْلَبُ', id: 'دِيتُونْتُوتْ' },
                    { ar: 'مِنَ', id: 'دَارِي' },
                    { ar: 'الْمُصَلِّي', id: 'أَوْرَڠْ يَڠْ صَلَاةْ' },
                    { ar: 'فِعْلُهَا،', id: 'مڠرجاكنيَا،' },
                    { ar: 'وَلَكِنْ', id: 'دَانْ تَتَافِي' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'سَبِيلِ', id: 'جَالَنْ' }
                ],
                [
                    { ar: 'الْحَتْمِ،', id: 'كَفَسْتِيَانْ،' },
                    { ar: 'بِحَيْثُ', id: 'سَكِيْرَاڽَ' },
                    { ar: 'يَزْدَادُ', id: 'بَرْتَامْبَاهْ' },
                    { ar: 'ثَوَابُ', id: 'فَاهَالَا' },
                    { ar: 'الصَّلَاةِ', id: 'صَلَاةْ' },
                    { ar: 'بِفِعْلِهَا', id: 'دڠَنْ مڠرجاكنيَا' },
                    { ar: 'وَلَا', id: 'دَانْ تِيدَاكْ' },
                    { ar: 'عِقَابَ', id: 'هُوكُومَنْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'تَرْكِهَا.', id: 'مَنِيڠْڮَلْكَنّيَا.' },
                    { ar: 'وَهَذِهِ', id: 'دَانْ اِينِي' }
                ],
                [
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'كَثِيرَةٌ،', id: 'بَاڽَاكْ،' },
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'تَنْقَسِمُ', id: 'تَرْبَاڮِي' },
                    { ar: 'فِي', id: 'دَالَمْ' },
                    { ar: 'مَجْمُوعِهَا', id: 'كُومْفُولَنّيَا' },
                    { ar: 'إِلَى :', id: 'كَفَدَا :' },
                    { ar: 'سُنَنٍ', id: 'سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ،', id: 'صَلَاةْ،' }
                ],
                [
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'فِي', id: 'دِي' },
                    { ar: 'أَثْنَائِهَا،', id: 'تڠَهْ-تڠَهْيَا،' },
                    { ar: 'وَسُنَنٍ', id: 'دَانْ سُنَّه٢' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'عَقِبَهَا.', id: 'سَتَلَاهْيَا.' }
                ]
            ]
        },
        {
            type: 'subheading',
            lines: [
                [
                    { ar: '( أ )', id: '(A)' },
                    { ar: 'السُّنَنُ', id: 'سُنَّه٢' },
                    { ar: 'الَّتِي', id: 'يَڠْ' },
                    { ar: 'تُؤَدَّى', id: 'دِيتُونَايْكَنْ' },
                    { ar: 'قَبْلَ', id: 'سَبَلُومْ' },
                    { ar: 'الصَّلَاةِ:', id: 'صَلَاةْ:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'وَهِيَ', id: 'دَانْ اِيَا' },
                    { ar: 'لَا', id: 'تِيدَاكْ' },
                    { ar: 'تَزِيدُ', id: 'لَبِيهْ' },
                    { ar: 'عَلَى', id: 'أَتَسْ' },
                    { ar: 'الْأُمُورِ', id: 'فَرْكَارَا٢' },
                    { ar: 'الثَّلَاثَةِ', id: 'يَڠْ تِيقَا' },
                    { ar: 'التَّالِيَةِ:', id: 'بَرِيكُوتْ اِينِي:' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الْأَوَّلُ', id: 'فَرْتَامَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْأَذَانُ :', id: 'أَذَانْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'تَعْرِيفُهُ', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'دَلِيلِهِ', id: 'دَلِيلْيَا' },
                    { ar: 'وَشُرُوطِهِ', id: 'دَانْ شَرَط٢يَا' },
                    { ar: 'وَمَا', id: 'دَانْ أَفَا يَڠْ' },
                    { ar: 'يَتَعَلَّقُ', id: 'بَرْكَائِيْتَنْ' },
                    { ar: 'بِذَلِكَ .', id: 'دڠَنْ حَالْ اِيتُو.' }
                ]
            ]
        },
        {
            type: 'paragraph',
            lines: [
                [
                    { ar: 'الثَّانِي', id: 'كَدُوَا' },
                    { ar: 'ـ', id: '-' },
                    { ar: 'الْإِقَامَةُ :', id: 'إِقَامَةْ :' },
                    { ar: 'وَقَدْ', id: 'دَانْ سُوڠْڮُوه' },
                    { ar: 'مَرَّ', id: 'تَلَاهْ لِيوَاتْ' },
                    { ar: 'أَيْضاً', id: 'جُوڮَا' },
                    { ar: 'تَعْرِيفُهَا', id: 'دَفِينِيسِييَا' },
                    { ar: 'وَبَيَانُ', id: 'دَانْ فَنْجَلَاسَنْ' },
                    { ar: 'شُرُوطِهَا', id: 'شَرَط٢يَا' },
                    { ar: 'وَالْفَرْقُ', id: 'دَانْ فَرْبَيدَاءَنْ' },
                    { ar: 'بَيْنَهَا', id: 'دِي أَنْتَارَايَا' },
                    { ar: 'وَبَيْنَ', id: 'دَانْ دِي أَنْتَارَا' },
                    { ar: 'الْأَذَانِ.', id: 'أَذَانْ.' }
                ]
            ]
        }
    ]
};
